[Killed] BlockStatement
src/core/application/suggest-mutant-fixes.use-case.ts:27:41
   public async execute(
     mutants: MutantDetail[],
     profile: "local" | "cloud" | "regex" = "regex"
-  ): Promise<MutantRemediationAdvice[]> {
-    const survivedOrNoCoverage = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
-    );
-
-    const results: MutantRemediationAdvice[] = [];
-    for (const m of survivedOrNoCoverage) {
-      results.push(await this.generateRemediation(m, profile));
-    }
-    return results;
-  }
+  ): Promise<MutantRemediationAdvice[]> {}
 
   private async generateRemediation(
killedBy: SuggestMutantFixesUseCase should return empty array if all mutants were killed
statusReason: expected undefined to deeply equal []

[Killed] MethodExpression
src/core/application/suggest-mutant-fixes.use-case.ts:28:34
     mutants: MutantDetail[],
     profile: "local" | "cloud" | "regex" = "regex"
   ): Promise<MutantRemediationAdvice[]> {
-    const survivedOrNoCoverage = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
-    );
+    const survivedOrNoCoverage = mutants;
 
     const results: MutantRemediationAdvice[] = [];
killedBy: SuggestMutantFixesUseCase should return empty array if all mutants were killed
statusReason: expected [ { mutantId: 'm1', …(8) } ] to deeply equal []

[Killed] ArrowFunction
src/core/application/suggest-mutant-fixes.use-case.ts:29:7
     profile: "local" | "cloud" | "regex" = "regex"
   ): Promise<MutantRemediationAdvice[]> {
     const survivedOrNoCoverage = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
+      () => undefined,
     );
 
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:29:14
     profile: "local" | "cloud" | "regex" = "regex"
   ): Promise<MutantRemediationAdvice[]> {
     const survivedOrNoCoverage = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
+      (m) => false,
     );
 
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/core/application/suggest-mutant-fixes.use-case.ts:33:43
     );
 
     const results: MutantRemediationAdvice[] = [];
-    for (const m of survivedOrNoCoverage) {
-      results.push(await this.generateRemediation(m, profile));
-    }
+    for (const m of survivedOrNoCoverage) {}
     return results;
   }
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:43:21
     mutant: MutantDetail,
     profile?: "local" | "cloud" | "regex"
   ): Promise<MutantRemediationAdvice> {
-    const mutator = mutant.mutatorName || "UnknownMutator";
+    const mutator = mutant.mutatorName && "UnknownMutator";
     const contextResult = this.getMutantContextUseCase ? await this.getMutantContextUseCase.execute(mutant.id) : null;
     const original = contextResult?.isOk ? contextResult.value.originalCode : "Code unavailable";
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected 'UnknownMutator' to be 'Equality' // Object.is equality

[Killed] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:43:21
     mutant: MutantDetail,
     profile?: "local" | "cloud" | "regex"
   ): Promise<MutantRemediationAdvice> {
-    const mutator = mutant.mutatorName || "UnknownMutator";
+    const mutator = false;
     const contextResult = this.getMutantContextUseCase ? await this.getMutantContextUseCase.execute(mutant.id) : null;
     const original = contextResult?.isOk ? contextResult.value.originalCode : "Code unavailable";
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: mutator.includes is not a function

[Killed] OptionalChaining
src/core/application/suggest-mutant-fixes.use-case.ts:45:22
   ): Promise<MutantRemediationAdvice> {
     const mutator = mutant.mutatorName || "UnknownMutator";
     const contextResult = this.getMutantContextUseCase ? await this.getMutantContextUseCase.execute(mutant.id) : null;
-    const original = contextResult?.isOk ? contextResult.value.originalCode : "Code unavailable";
+    const original = contextResult.isOk ? contextResult.value.originalCode : "Code unavailable";
     const replacement = mutant.replacement || "";
     const startLine = mutant.line || 1;
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: Cannot read properties of null (reading 'isOk')

[Survived] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:46:25
     const mutator = mutant.mutatorName || "UnknownMutator";
     const contextResult = this.getMutantContextUseCase ? await this.getMutantContextUseCase.execute(mutant.id) : null;
     const original = contextResult?.isOk ? contextResult.value.originalCode : "Code unavailable";
-    const replacement = mutant.replacement || "";
+    const replacement = mutant.replacement && "";
     const startLine = mutant.line || 1;
     const startColumn = mutant.column || 1;

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:46:25
     const mutator = mutant.mutatorName || "UnknownMutator";
     const contextResult = this.getMutantContextUseCase ? await this.getMutantContextUseCase.execute(mutant.id) : null;
     const original = contextResult?.isOk ? contextResult.value.originalCode : "Code unavailable";
-    const replacement = mutant.replacement || "";
+    const replacement = true;
     const startLine = mutant.line || 1;
     const startColumn = mutant.column || 1;

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:47:23
     const contextResult = this.getMutantContextUseCase ? await this.getMutantContextUseCase.execute(mutant.id) : null;
     const original = contextResult?.isOk ? contextResult.value.originalCode : "Code unavailable";
     const replacement = mutant.replacement || "";
-    const startLine = mutant.line || 1;
+    const startLine = true;
     const startColumn = mutant.column || 1;
 

[Survived] StringLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:50:23
     const startLine = mutant.line || 1;
     const startColumn = mutant.column || 1;
 
-    let explanation = `Mutant survived at line ${startLine} using mutator '${mutator}'.`;
+    let explanation = ``;
     let suggestedAssertion = `expect(result).toBeDefined();`;
     let boundaryTestSnippet = `it('should handle boundary condition for ${mutator} at line ${startLine}', () => {\n  // Add boundary test assertion\n});`;

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:55:9
     let boundaryTestSnippet = `it('should handle boundary condition for ${mutator} at line ${startLine}', () => {\n  // Add boundary test assertion\n});`;
 
     // Try Local LLM (Ollama) if profile is local or undefined (fallback chain)
-    if (profile === "local") {
+    if (true) {
       try {
         const ollamaRes = await fetch("http://localhost:11434/api/generate", {

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:55:9
     let boundaryTestSnippet = `it('should handle boundary condition for ${mutator} at line ${startLine}', () => {\n  // Add boundary test assertion\n});`;
 
     // Try Local LLM (Ollama) if profile is local or undefined (fallback chain)
-    if (profile === "local") {
+    if (false) {
       try {
         const ollamaRes = await fetch("http://localhost:11434/api/generate", {

[NoCoverage] BooleanLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:63:21
           body: JSON.stringify({
             model: "qwen2.5-coder", // Defaulting to a good local coder model
-            stream: false,
+            stream: true,
             format: "json"
           }),

[NoCoverage] BlockStatement
src/core/application/suggest-mutant-fixes.use-case.ts:67:27
             format: "json"
           }),
         });
-        if (ollamaRes.ok) {
-          const data = await ollamaRes.json();
-          const parsed = JSON.parse(data.response);
-          return {
-            mutantId: mutant.id,
-            fileName: mutant.filePath,
-            mutatorName: mutator,
-            originalCode: original,
-            mutatedCode: replacement,
-            location: {
-              start: { line: startLine, column: startColumn },
-              end: { line: startLine, column: startColumn },
-            },
-            explanation: parsed.explanation || explanation,
-            suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
-            boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
-          };
-        }
+        if (ollamaRes.ok) {}
       } catch (e) {
         // Fallthrough if Ollama is not running or fails

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:67:13
             format: "json"
           }),
         });
-        if (ollamaRes.ok) {
+        if (false) {
           const data = await ollamaRes.json();
           const parsed = JSON.parse(data.response);

[NoCoverage] ObjectLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:70:18
         if (ollamaRes.ok) {
           const data = await ollamaRes.json();
           const parsed = JSON.parse(data.response);
-          return {
-            mutantId: mutant.id,
-            fileName: mutant.filePath,
-            mutatorName: mutator,
-            originalCode: original,
-            mutatedCode: replacement,
-            location: {
-              start: { line: startLine, column: startColumn },
-              end: { line: startLine, column: startColumn },
-            },
-            explanation: parsed.explanation || explanation,
-            suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
-            boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
-          };
+          return {};
         }
       } catch (e) {

[NoCoverage] ObjectLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:78:20
             mutatedCode: replacement,
             location: {
               start: { line: startLine, column: startColumn },
-              end: { line: startLine, column: startColumn },
+              end: {},
             },
             explanation: parsed.explanation || explanation,

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:80:26
               start: { line: startLine, column: startColumn },
               end: { line: startLine, column: startColumn },
             },
-            explanation: parsed.explanation || explanation,
+            explanation: false,
             suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
             boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:80:26
               start: { line: startLine, column: startColumn },
               end: { line: startLine, column: startColumn },
             },
-            explanation: parsed.explanation || explanation,
+            explanation: true,
             suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
             boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:81:33
               end: { line: startLine, column: startColumn },
             },
             explanation: parsed.explanation || explanation,
-            suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
+            suggestedAssertion: true,
             boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
           };

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:81:33
               end: { line: startLine, column: startColumn },
             },
             explanation: parsed.explanation || explanation,
-            suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
+            suggestedAssertion: false,
             boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
           };

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:82:34
             },
             explanation: parsed.explanation || explanation,
             suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
-            boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
+            boundaryTestSnippet: false,
           };
         }

[NoCoverage] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:82:34
             },
             explanation: parsed.explanation || explanation,
             suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
-            boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
+            boundaryTestSnippet: parsed.boundaryTestSnippet && boundaryTestSnippet,
           };
         }

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:91:9
     }
 
     // Cloud LLM fallback if profile is cloud
-    if (profile === "cloud") {
+    if (true) {
       if (process.env.OPENAI_API_KEY) {
         try {

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:91:9
     }
 
     // Cloud LLM fallback if profile is cloud
-    if (profile === "cloud") {
+    if (false) {
       if (process.env.OPENAI_API_KEY) {
         try {

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:92:11
 
     // Cloud LLM fallback if profile is cloud
     if (profile === "cloud") {
-      if (process.env.OPENAI_API_KEY) {
+      if (false) {
         try {
           const cloudRes = await fetch("https://api.openai.com/v1/chat/completions", {

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:92:11
 
     // Cloud LLM fallback if profile is cloud
     if (profile === "cloud") {
-      if (process.env.OPENAI_API_KEY) {
+      if (true) {
         try {
           const cloudRes = await fetch("https://api.openai.com/v1/chat/completions", {

[NoCoverage] StringLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:94:40
     if (profile === "cloud") {
       if (process.env.OPENAI_API_KEY) {
         try {
-          const cloudRes = await fetch("https://api.openai.com/v1/chat/completions", {
+          const cloudRes = await fetch("", {
             method: "POST",
             headers: {

[NoCoverage] StringLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:95:21
       if (process.env.OPENAI_API_KEY) {
         try {
           const cloudRes = await fetch("https://api.openai.com/v1/chat/completions", {
-            method: "POST",
+            method: "",
             headers: {
               "Content-Type": "application/json",

[NoCoverage] BlockStatement
src/core/application/suggest-mutant-fixes.use-case.ts:106:28
               response_format: { type: "json_object" }
             }),
           });
-          if (cloudRes.ok) {
-            const data = await cloudRes.json();
-            const parsed = JSON.parse(data.choices[0].message.content);
-            return {
-              mutantId: mutant.id,
-              fileName: mutant.filePath,
-              mutatorName: mutator,
-              originalCode: original,
-              mutatedCode: replacement,
-              location: {
-                start: { line: startLine, column: startColumn },
-                end: { line: startLine, column: startColumn },
-              },
-              explanation: parsed.explanation || explanation,
-              suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
-              boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
-            };
-          }
+          if (cloudRes.ok) {}
         } catch (e) {
           // Fallthrough

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:106:15
               response_format: { type: "json_object" }
             }),
           });
-          if (cloudRes.ok) {
+          if (false) {
             const data = await cloudRes.json();
             const parsed = JSON.parse(data.choices[0].message.content);

[NoCoverage] ObjectLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:115:25
               mutatorName: mutator,
               originalCode: original,
               mutatedCode: replacement,
-              location: {
-                start: { line: startLine, column: startColumn },
-                end: { line: startLine, column: startColumn },
-              },
+              location: {},
               explanation: parsed.explanation || explanation,
               suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,

[NoCoverage] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:119:28
                 start: { line: startLine, column: startColumn },
                 end: { line: startLine, column: startColumn },
               },
-              explanation: parsed.explanation || explanation,
+              explanation: parsed.explanation && explanation,
               suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
               boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,

[NoCoverage] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:120:35
                 end: { line: startLine, column: startColumn },
               },
               explanation: parsed.explanation || explanation,
-              suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
+              suggestedAssertion: parsed.suggestedAssertion && suggestedAssertion,
               boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
             };

[NoCoverage] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:121:36
               },
               explanation: parsed.explanation || explanation,
               suggestedAssertion: parsed.suggestedAssertion || suggestedAssertion,
-              boundaryTestSnippet: parsed.boundaryTestSnippet || boundaryTestSnippet,
+              boundaryTestSnippet: true,
             };
           }

[Killed] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:131:9
     }
 
     // Regex Fallback
-    if (mutator.includes("Equality") || mutator.includes("Conditional")) {
+    if (mutator.includes("Equality") && mutator.includes("Conditional")) {
       explanation = `Equality/Boundary condition survived at line ${startLine}. Code changed from '${original}' to '${replacement}'.`;
       suggestedAssertion = `expect(result).toBe(exactExpectedBoundaryValue);`;
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected 'Mutant survived at line 10 using muta…' to contain 'Equality/Boundary condition survived'

[Killed] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:131:9
     }
 
     // Regex Fallback
-    if (mutator.includes("Equality") || mutator.includes("Conditional")) {
+    if (true) {
       explanation = `Equality/Boundary condition survived at line ${startLine}. Code changed from '${original}' to '${replacement}'.`;
       suggestedAssertion = `expect(result).toBe(exactExpectedBoundaryValue);`;
killedBy: SuggestMutantFixesUseCase should generate remediation advice for NoCoverage mutants
statusReason: expected 'Equality/Boundary condition survived …' to contain 'String/Literal mutation survived'

[Killed] StringLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:136:21
       suggestedAssertion = `expect(result).toBe(exactExpectedBoundaryValue);`;
       boundaryTestSnippet = `it('should test exact boundary value at line ${startLine}', () => {\n  const result = testSubject(boundaryInput);\n  expect(result).toEqual(expectedBoundaryValue);\n});`;
     } else if (mutator.includes("String") || mutator.includes("Literal")) {
-      explanation = `String/Literal mutation survived at line ${startLine}. Code mutated to '${replacement}'.`;
+      explanation = ``;
       suggestedAssertion = `expect(outputString).toContain(expectedSubstring);`;
       boundaryTestSnippet = `it('should assert literal output formatting at line ${startLine}', () => {\n  expect(output).toBe(expectedLiteral);\n});`;
killedBy: SuggestMutantFixesUseCase should generate remediation advice for NoCoverage mutants
statusReason: expected '' to contain 'String/Literal mutation survived'

[Survived] StringLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:137:28
       boundaryTestSnippet = `it('should test exact boundary value at line ${startLine}', () => {\n  const result = testSubject(boundaryInput);\n  expect(result).toEqual(expectedBoundaryValue);\n});`;
     } else if (mutator.includes("String") || mutator.includes("Literal")) {
       explanation = `String/Literal mutation survived at line ${startLine}. Code mutated to '${replacement}'.`;
-      suggestedAssertion = `expect(outputString).toContain(expectedSubstring);`;
+      suggestedAssertion = ``;
       boundaryTestSnippet = `it('should assert literal output formatting at line ${startLine}', () => {\n  expect(output).toBe(expectedLiteral);\n});`;
     } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {

[Survived] StringLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:138:29
     } else if (mutator.includes("String") || mutator.includes("Literal")) {
       explanation = `String/Literal mutation survived at line ${startLine}. Code mutated to '${replacement}'.`;
       suggestedAssertion = `expect(outputString).toContain(expectedSubstring);`;
-      boundaryTestSnippet = `it('should assert literal output formatting at line ${startLine}', () => {\n  expect(output).toBe(expectedLiteral);\n});`;
+      boundaryTestSnippet = ``;
     } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
       explanation = `Logical operator condition survived at line ${startLine}. Branch condition was not exercised in both true/false states.`;

[NoCoverage] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:139:16
       explanation = `String/Literal mutation survived at line ${startLine}. Code mutated to '${replacement}'.`;
       suggestedAssertion = `expect(outputString).toContain(expectedSubstring);`;
       boundaryTestSnippet = `it('should assert literal output formatting at line ${startLine}', () => {\n  expect(output).toBe(expectedLiteral);\n});`;
-    } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
+    } else if (mutator.includes("Boolean") && mutator.includes("Logical")) {
       explanation = `Logical operator condition survived at line ${startLine}. Branch condition was not exercised in both true/false states.`;
       suggestedAssertion = `expect(conditionResult).toBe(false); // test false branch explicitly`;

[Killed] ObjectLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:145:12
       boundaryTestSnippet = `it('should test false branch condition at line ${startLine}', () => {\n  expect(testSubject(falseInput)).toBe(false);\n});`;
     }
 
-    return {
-      mutantId: mutant.id,
-      fileName: mutant.filePath,
-      mutatorName: mutator,
-      originalCode: original,
-      mutatedCode: replacement,
-      location: {
-        start: { line: startLine, column: startColumn },
-        end: { line: startLine, column: startColumn },
-      },
-      explanation,
-      suggestedAssertion,
-      boundaryTestSnippet,
-    };
+    return {};
   }
 }
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected undefined to be 'm1' // Object.is equality
