[NoCoverage] ArithmeticOperator
src/App.tsx:27:46
         <button
           type="button"
           class="counter"
-          onClick={() => setCount((count) => count + 1)}
+          onClick={() => setCount((count) => count - 1)}
         >
           Count is {count()}

[NoCoverage] ArrowFunction
src/App.tsx:27:35
         <button
           type="button"
           class="counter"
-          onClick={() => setCount((count) => count + 1)}
+          onClick={() => setCount(() => undefined)}
         >
           Count is {count()}
