[NoCoverage] StringLiteral
src/index.tsx:6:38
 import './index.css'
 import App from './App.tsx'
 
-const root = document.getElementById('root')
+const root = document.getElementById("")
 
 render(() => <App />, root!)

[NoCoverage] ArrowFunction
src/index.tsx:8:8
 
 const root = document.getElementById('root')
 
-render(() => <App />, root!)
+render(() => undefined, root!)
 
