[Killed] BlockStatement
src/Counter.tsx:3:27
 import { createSignal } from 'solid-js';
 
-export function Counter() {
-  const [count, setCount] = createSignal(0);
-  return (
-    <div>
-      <button onClick={() => setCount(c => c + 1)}>
-        Count: {count()}
-      </button>
-    </div>
-  );
-}
+export function Counter() {}
 
killedBy: Counter increments value
statusReason: Unable to find role="button"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/Counter.tsx:7:39
   const [count, setCount] = createSignal(0);
   return (
     <div>
-      <button onClick={() => setCount(c => c + 1)}>
+      <button onClick={() => setCount(() => undefined)}>
         Count: {count()}
       </button>
killedBy: Counter increments value
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Count: 1
Received:
  Count:

[Killed] ArithmeticOperator
src/Counter.tsx:7:44
   const [count, setCount] = createSignal(0);
   return (
     <div>
-      <button onClick={() => setCount(c => c + 1)}>
+      <button onClick={() => setCount(c => c - 1)}>
         Count: {count()}
       </button>
killedBy: Counter increments value
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Count: 1
Received:
  Count: -1
