[Killed] ConditionalExpression
src/index.ts:95:7
   mode: "sse" | "stdio" = "sse",
 ): Promise<Result<void, Error>> {
   const server = adapter || createMcpServerAdapter(logger, 3000);
-  if (mode === "stdio") {
+  if (true) {
     return server.startStdio();
   }
killedBy: Plugin Index (Composition Root) sollte den Standalone-Server mit Standard-Adapter erzeugen und starten können
statusReason: expected "start" to be called at least once
