[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:27:28
 import { NullNotificationAdapter } from "../notification/null-notification.adapter.js";
 import { type Result, ok, err } from "../../core/domain/result.js";
 
-export const SERVER_INFO = { name: "stryker-mcp-server", version: "1.0.0" };
+export const SERVER_INFO = {};
 
 function parseFilePath(args: unknown): string | undefined {
killedBy: McpServerAdapter sollte die korrekten Server-Metadaten bereitstellen
statusReason: expected undefined to be 'stryker-mcp-server' // Object.is equality

[Survived] LogicalOperator
src/infrastructure/mcp/mcp-server.adapter.ts:30:7
 export const SERVER_INFO = { name: "stryker-mcp-server", version: "1.0.0" };
 
 function parseFilePath(args: unknown): string | undefined {
-  if (typeof args !== "object" || args === null) return undefined;
+  if (typeof args !== "object" && args === null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
   return typeof rawPath === "string" && rawPath.trim() !== "" ? rawPath.trim() : undefined;

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:32:10
 function parseFilePath(args: unknown): string | undefined {
   if (typeof args !== "object" || args === null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
-  return typeof rawPath === "string" && rawPath.trim() !== "" ? rawPath.trim() : undefined;
+  return typeof rawPath !== "string" && rawPath.trim() !== "" ? rawPath.trim() : undefined;
 }
 
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:94:51
       await this.mcpServer.connect(transport);
     });
 
-    app.post("/mcp/messages", async (req, res) => {
-      const sessionId = req.query.sessionId as string | undefined;
-      if (!sessionId) {
-        res.status(400).send("Missing sessionId query parameter");
-        return;
-      }
-
-      const transport = this.sseTransports.get(sessionId);
-      if (transport) {
-        await transport.handlePostMessage(req, res, req.body);
-      } else {
-        res.status(404).send(`Session not found: ${sessionId}`);
-      }
-    });
+    app.post("/mcp/messages", async (req, res) => {});
 
     return new Promise((resolve) => {
killedBy: McpServerAdapter sollte HTTP-Anfragen auf den Routen korrekt verarbeiten und absichern
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:96:11
 
     app.post("/mcp/messages", async (req, res) => {
       const sessionId = req.query.sessionId as string | undefined;
-      if (!sessionId) {
+      if (sessionId) {
         res.status(400).send("Missing sessionId query parameter");
         return;
killedBy: McpServerAdapter sollte HTTP-Anfragen auf den Routen korrekt verarbeiten und absichern
statusReason: expected 404 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:102:11
       }
 
       const transport = this.sseTransports.get(sessionId);
-      if (transport) {
+      if (true) {
         await transport.handlePostMessage(req, res, req.body);
       } else {
killedBy: McpServerAdapter sollte HTTP-Anfragen auf den Routen korrekt verarbeiten und absichern
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:102:22
       }
 
       const transport = this.sseTransports.get(sessionId);
-      if (transport) {
-        await transport.handlePostMessage(req, res, req.body);
-      } else {
+      if (transport) {} else {
         res.status(404).send(`Session not found: ${sessionId}`);
       }
killedBy: McpServerAdapter sollte HTTP-Anfragen auf den Routen korrekt verarbeiten und absichern
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:104:14
       const transport = this.sseTransports.get(sessionId);
       if (transport) {
         await transport.handlePostMessage(req, res, req.body);
-      } else {
-        res.status(404).send(`Session not found: ${sessionId}`);
-      }
+      } else {}
     });
 
killedBy: McpServerAdapter sollte HTTP-Anfragen auf den Routen korrekt verarbeiten und absichern
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:109:37
       }
     });
 
-    return new Promise((resolve) => {
-      this.httpServer = app.listen(this.port);
-
-      this.httpServer.once("listening", () => {
-        this.logConnectionInstructions();
-        resolve(ok(undefined));
-      });
-
-      this.httpServer.once("error", (error) => {
-        resolve(err(error));
-      });
-    });
+    return new Promise((resolve) => {});
   }
 
killedBy: McpServerAdapter sollte den Server erfolgreich starten und ein ok-Result zurückgeben
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:112:47
     return new Promise((resolve) => {
       this.httpServer = app.listen(this.port);
 
-      this.httpServer.once("listening", () => {
-        this.logConnectionInstructions();
-        resolve(ok(undefined));
-      });
+      this.httpServer.once("listening", () => {});
 
       this.httpServer.once("error", (error) => {
killedBy: McpServerAdapter sollte den Server erfolgreich starten und ein ok-Result zurückgeben
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:117:48
         resolve(ok(undefined));
       });
 
-      this.httpServer.once("error", (error) => {
-        resolve(err(error));
-      });
+      this.httpServer.once("error", (error) => {});
     });
   }
killedBy: McpServerAdapter sollte ein err-Result zurückgeben, wenn der Port bereits belegt ist
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:123:45
     });
   }
 
-  private logConnectionInstructions(): void {
-    const sseUrl = `http://127.0.0.1:${this.activePort}/mcp/sse`;
-
-    this.logger.info("🚀 Stryker MCP Server läuft!");
-    this.logger.info(`🔗 SSE URL: ${sseUrl}`);
-    this.logger.info("💡 Um KI-Agenten (wie Cline, Cursor oder Roo Code) zu verbinden, nutze dieses Snippet:");
-    this.logger.info(`
-{
-  "mcpServers": {
-    "stryker-mutation-testing": {
-      "url": "${sseUrl}"
-    }
-  }
-}
-`);
-    this.logger.info("🛑 Drücke Strg+C, um den Server zu beenden.");
-  }
+  private logConnectionInstructions(): void {}
 
   public stop(): Promise<void> {

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:141:32
     this.logger.info("🛑 Drücke Strg+C, um den Server zu beenden.");
   }
 
-  public stop(): Promise<void> {
-    return new Promise((resolve) => {
-      if (this.httpServer) {
-        this.httpServer.close(() => resolve());
-      } else {
-        resolve();
-      }
-    });
-  }
+  public stop(): Promise<void> {}
 
   private registerResourceHandlers(): void {
killedBy: McpServerAdapter sollte ein err-Result zurückgeben, wenn der Port bereits belegt ist
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:142:37
   }
 
   public stop(): Promise<void> {
-    return new Promise((resolve) => {
-      if (this.httpServer) {
-        this.httpServer.close(() => resolve());
-      } else {
-        resolve();
-      }
-    });
+    return new Promise((resolve) => {});
   }
 
killedBy: McpServerAdapter sollte die korrekten Server-Metadaten bereitstellen
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:143:11
 
   public stop(): Promise<void> {
     return new Promise((resolve) => {
-      if (this.httpServer) {
+      if (false) {
         this.httpServer.close(() => resolve());
       } else {
killedBy: McpServerAdapter schließt den aktiven HTTP-Server während des Shutdowns
statusReason: expected "close" to be called once, but got 0 times

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:143:11
 
   public stop(): Promise<void> {
     return new Promise((resolve) => {
-      if (this.httpServer) {
+      if (true) {
         this.httpServer.close(() => resolve());
       } else {
killedBy: McpServerAdapter sollte die korrekten Server-Metadaten bereitstellen
statusReason: Cannot read properties of null (reading 'close')

[Killed] ArrowFunction
src/infrastructure/mcp/mcp-server.adapter.ts:144:31
   public stop(): Promise<void> {
     return new Promise((resolve) => {
       if (this.httpServer) {
-        this.httpServer.close(() => resolve());
+        this.httpServer.close(() => undefined);
       } else {
         resolve();
killedBy: McpServerAdapter sollte den Server erfolgreich starten und ein ok-Result zurückgeben
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:145:14
     return new Promise((resolve) => {
       if (this.httpServer) {
         this.httpServer.close(() => resolve());
-      } else {
-        resolve();
-      }
+      } else {}
     });
   }
killedBy: McpServerAdapter sollte die korrekten Server-Metadaten bereitstellen
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:160:9
           mimeType: "application/json",
           description: "Der vollständige Stryker Mutation Testing Report im JSON-Format.",
         },
-        {
-          uri: "stryker://report/summary",
-          name: "Mutation Testing Summary Metrics",
-          mimeType: "application/json",
-          description: "Kompakte Zusammenfassung der Mutations-Metriken (Score, Killed, Survived).",
-        },
+        {},
         {
           uri: "stryker://report/survived",
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: expected undefined to be 'stryker://report/summary' // Object.is equality

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:172:9
           mimeType: "application/json",
           description: "Liste aller überlebenden Mutanten inkl. Pfad, Zeile, Mutator und Ersetzung.",
         },
-        {
-          uri: "stryker://status",
-          name: "Stryker Execution Status",
-          mimeType: "application/json",
-          description: "Aktueller Ausführungsstatus von Stryker (idle, running, completed, failed).",
-        },
+        {},
       ],
     }));
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: expected undefined to be 'stryker://status' // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:184:11
     this.mcpServer.setRequestHandler(ReadResourceRequestSchema, async (request) => {
       const uri = request.params.uri;
 
-      if (uri === "stryker://report/latest") {
+      if (false) {
         const report = this.reportStream.current();
         return {
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: Ressource nicht gefunden

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:184:46
     this.mcpServer.setRequestHandler(ReadResourceRequestSchema, async (request) => {
       const uri = request.params.uri;
 
-      if (uri === "stryker://report/latest") {
-        const report = this.reportStream.current();
-        return {
-          contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: JSON.stringify(report ?? { files: {} }),
-            },
-          ],
-        };
-      }
+      if (uri === "stryker://report/latest") {}
 
       if (uri === "stryker://report/summary") {
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: Ressource nicht gefunden

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:186:16
 
       if (uri === "stryker://report/latest") {
         const report = this.reportStream.current();
-        return {
-          contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: JSON.stringify(report ?? { files: {} }),
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:201:28
         const summaryResult = this.getSummaryUseCase.execute();
         const summaryText = summaryResult.isOk
           ? JSON.stringify(summaryResult.value)
-          : JSON.stringify({ error: summaryResult.error.message });
+          : JSON.stringify({});
 
         return {
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: expected '{}' to contain 'Kein Mutation-Testing-Report verfügbar'

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:203:16
           ? JSON.stringify(summaryResult.value)
           : JSON.stringify({ error: summaryResult.error.message });
 
-        return {
-          contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: summaryText,
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:205:13
 
         return {
           contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: summaryText,
-            },
+            {},
           ],
         };
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:231:11
         };
       }
 
-      if (uri === "stryker://status") {
+      if (uri !== "stryker://status") {
         const status = this.statusStream.current();
         return {
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: Ressource nicht gefunden

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:235:13
         const status = this.statusStream.current();
         return {
           contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: JSON.stringify(status),
-            },
+            {},
           ],
         };
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:257:23
           inputSchema: {
             type: "object",
             properties: {
-              mutate: {
-                type: "array",
-                items: { type: "string" },
-                description: "Array von Datei-Globs für Mutationen (z.B. ['src/calculator.ts']).",
-              },
+              mutate: {},
               concurrency: {
                 type: "number",

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:283:26
           inputSchema: {
             type: "object",
             properties: {
-              commitSha: {
-                type: "string",
-                description: "Spezifischer Commit-Hash für gezielten Testlauf (z.B. 'a9d1206').",
-              },
+              commitSha: {},
               revision: {
                 type: "string",

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:337:34
                 type: "boolean",
                 description: "Benachrichtigungen aktivieren oder deaktivieren.",
               },
-              persistentOverlay: {
-                type: "boolean",
-                description: "Persistente Floating-Benachrichtigung aktivieren.",
-              },
+              persistentOverlay: {},
               sound: {
                 type: "boolean",

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:354:11
     this.mcpServer.setRequestHandler(CallToolRequestSchema, async (request) => {
       const { name, arguments: args } = request.params;
 
-      if (name === "run_mutation_tests") {
+      if (false) {
         const options = args as { mutate?: string[]; concurrency?: number; testRunner?: string; configFile?: string };
         const runResult = await this.runUseCase.execute(options);
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: Unbekanntes MCP Tool 'run_mutation_tests'

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:358:30
         const options = args as { mutate?: string[]; concurrency?: number; testRunner?: string; configFile?: string };
         const runResult = await this.runUseCase.execute(options);
 
-        if (!runResult.isOk) {
-          return {
-            isError: true,
-            content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen von Mutationstests: ${runResult.error.message}`,
-              },
-            ],
-          };
-        }
+        if (!runResult.isOk) {}
 
         const summaryResult = this.getSummaryUseCase.execute();
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: expected undefined to be true // Object.is equality

[Killed] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:377:173
           content: [
             {
               type: "text",
-              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary?.killed ?? "N/A"}`,
+              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary.killed ?? "N/A"}`,
             },
           ],
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: Cannot read properties of null (reading 'killed')

[Killed] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:377:134
           content: [
             {
               type: "text",
-              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary?.killed ?? "N/A"}`,
+              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary.survived ?? "N/A"}\nKilled: ${summary?.killed ?? "N/A"}`,
             },
           ],
killedBy: McpServerAdapter sollte MCP-Ressourcen inklusive stryker://report/survived strikt prüfen
statusReason: Cannot read properties of null (reading 'survived')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:383:11
         };
       }
 
-      if (name === "run_targeted_mutation_tests") {
+      if (false) {
         const rawArgs = args as {
           commitSha?: string;
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: Unbekanntes MCP Tool 'run_targeted_mutation_tests'

[Killed] LogicalOperator
src/infrastructure/mcp/mcp-server.adapter.ts:393:11
         };
 
         const hasSpecificOptions =
-          typeof rawArgs?.commitSha === "string" ||
-          typeof rawArgs?.revision === "string" ||
-          typeof rawArgs?.fromRevision === "string";
+          (typeof rawArgs?.commitSha === "string" || typeof rawArgs?.revision === "string") && typeof rawArgs?.fromRevision === "string";
 
         const targetOptions = hasSpecificOptions
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: expected "spy" to be called with arguments: [ { commitSha: 'a9d1206' } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:393:11
         };
 
         const hasSpecificOptions =
-          typeof rawArgs?.commitSha === "string" ||
+          typeof rawArgs?.commitSha !== "string" ||
           typeof rawArgs?.revision === "string" ||
           typeof rawArgs?.fromRevision === "string";
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: expected "spy" to be called with arguments: [ 'main' ]

Received: 

  1st spy call:

  Array [
-   "main",

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:398:13
           typeof rawArgs?.fromRevision === "string";
 
         const targetOptions = hasSpecificOptions
-          ? {
-              commitSha: rawArgs?.commitSha,
-              revision: rawArgs?.revision,
-              fromRevision: rawArgs?.fromRevision,
-              toRevision: rawArgs?.toRevision,
-            }
+          ? {}
           : rawArgs?.baseBranch;
 
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: expected "spy" to be called with arguments: [ { commitSha: 'a9d1206' } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:408:30
 
         const runResult = await this.runTargetedUseCase.execute(targetOptions);
 
-        if (!runResult.isOk) {
-          return {
-            isError: true,
-            content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen zielgerichteter Mutationstests: ${runResult.error.message}`,
-              },
-            ],
-          };
-        }
+        if (!runResult.isOk) {}
 
         const summaryResult = this.getSummaryUseCase.execute();
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:433:11
         };
       }
 
-      if (name === "get_mutation_score") {
+      if (true) {
         const summaryResult = this.getSummaryUseCase.execute();
         if (!summaryResult.isOk) {
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: expected 'Kein Mutation-Testing-Report verfügba…' to be '[]' // Object.is equality

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:435:34
 
       if (name === "get_mutation_score") {
         const summaryResult = this.getSummaryUseCase.execute();
-        if (!summaryResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: summaryResult.error.message }],
-          };
-        }
+        if (!summaryResult.isOk) {}
 
         return {
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: expected undefined to be true // Object.is equality

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:436:18
       if (name === "get_mutation_score") {
         const summaryResult = this.getSummaryUseCase.execute();
         if (!summaryResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: summaryResult.error.message }],
-          };
+          return {};
         }
 
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: expected undefined to be true // Object.is equality

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:444:13
 
         return {
           content: [
-            {
-              type: "text",
-              text: JSON.stringify(summaryResult.value, null, 2),
-            },
+            {},
           ],
         };
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:452:11
         };
       }
 
-      if (name === "get_survived_mutants") {
+      if (name !== "get_survived_mutants") {
         const filePath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filePath);
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: Unbekanntes MCP Tool 'get_survived_mutants'

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:452:11
         };
       }
 
-      if (name === "get_survived_mutants") {
+      if (true) {
         const filePath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filePath);
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: expected 'Kein Mutation-Testing-Report verfügba…' to contain 'Desktop-Benachrichtigungen erfolgreic…'

[Killed] BooleanLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:455:13
       if (name === "get_survived_mutants") {
         const filePath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filePath);
-        if (!survivedResult.isOk) {
+        if (survivedResult.isOk) {
           return {
             isError: true,
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:455:13
       if (name === "get_survived_mutants") {
         const filePath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filePath);
-        if (!survivedResult.isOk) {
+        if (true) {
           return {
             isError: true,
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: Cannot read properties of undefined (reading 'message')

[Survived] ArrayDeclaration
src/infrastructure/mcp/mcp-server.adapter.ts:458:22
         if (!survivedResult.isOk) {
           return {
             isError: true,
-            content: [{ type: "text", text: survivedResult.error.message }],
+            content: [],
           };
         }

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:462:16
           };
         }
 
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(survivedResult.value, null, 2),
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:472:11
         };
       }
 
-      if (name === "configure_desktop_notifications") {
+      if (name !== "configure_desktop_notifications") {
         const configOptions = args as { enabled?: boolean; persistentOverlay?: boolean; sound?: boolean };
         this.notificationService.configure(configOptions);
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: Unbekanntes MCP Tool 'configure_desktop_notifications'
