[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:472:11
         };
       }
 
-      if (name === "configure_desktop_notifications") {
+      if (true) {
         const configOptions = args as { enabled?: boolean; persistentOverlay?: boolean; sound?: boolean };
         this.notificationService.configure(configOptions);
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: promise resolved "{ content: [ { type: 'text', …(1) } ] }" instead of rejecting

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:478:13
 
         return {
           content: [
-            {
-              type: "text",
-              text: "Desktop-Benachrichtigungen erfolgreich konfiguriert.",
-            },
+            {},
           ],
         };
killedBy: McpServerAdapter sollte MCP-Tools inklusive run_targeted_mutation_tests strikt prüfen
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrowFunction
src/infrastructure/mcp/mcp-server.adapter.ts:491:64
   }
 
   private registerPromptHandlers(): void {
-    this.mcpServer.setRequestHandler(ListPromptsRequestSchema, async () => ({
-      prompts: [
-        {
-          name: "analyze_survived_mutants",
-          description: "Generiert einen KI-Prompt zur tiefenursächlichen Analyse und Behebung überlebender Mutanten.",
-          arguments: [
-            {
-              name: "filePath",
-              description: "Optionaler Dateipfad zur Eingrenzung der Analyse.",
-              required: false,
-            },
-          ],
-        },
-      ],
-    }));
+    this.mcpServer.setRequestHandler(ListPromptsRequestSchema, () => undefined);
 
     this.mcpServer.setRequestHandler(GetPromptRequestSchema, async (request) => {
killedBy: McpServerAdapter sollte MCP-Prompts strikt prüfen
statusReason: Cannot read properties of undefined (reading 'prompts')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:497:13
           name: "analyze_survived_mutants",
           description: "Generiert einen KI-Prompt zur tiefenursächlichen Analyse und Behebung überlebender Mutanten.",
           arguments: [
-            {
-              name: "filePath",
-              description: "Optionaler Dateipfad zur Eingrenzung der Analyse.",
-              required: false,
-            },
+            {},
           ],
         },
killedBy: McpServerAdapter sollte MCP-Prompts strikt prüfen
statusReason: expected undefined to be 'filePath' // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:500:25
             {
               name: "filePath",
               description: "Optionaler Dateipfad zur Eingrenzung der Analyse.",
-              required: false,
+              required: true,
             },
           ],
killedBy: McpServerAdapter sollte MCP-Prompts strikt prüfen
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:510:11
     this.mcpServer.setRequestHandler(GetPromptRequestSchema, async (request) => {
       const { name, arguments: args } = request.params;
 
-      if (name === "analyze_survived_mutants") {
+      if (true) {
         const filePath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filePath);
killedBy: McpServerAdapter sollte MCP-Prompts strikt prüfen
statusReason: promise resolved "{ messages: [ { role: 'user', …(1) } ] }" instead of rejecting

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:510:11
     this.mcpServer.setRequestHandler(GetPromptRequestSchema, async (request) => {
       const { name, arguments: args } = request.params;
 
-      if (name === "analyze_survived_mutants") {
+      if (name !== "analyze_survived_mutants") {
         const filePath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filePath);
killedBy: McpServerAdapter sollte MCP-Prompts strikt prüfen
statusReason: Prompt 'analyze_survived_mutants' nicht gefunden.

[Killed] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:520:28
         const promptText = `Du bist ein Experte für Mutation Testing und TDD.
 Hier ist die Analyse der überlebenden Mutanten für das Projekt:
 
-Gesamter Mutationsscore: ${summary?.mutationScore ?? "N/A"}%
+Gesamter Mutationsscore: ${summary.mutationScore ?? "N/A"}%
 Überlebte Mutanten: ${survived.length}
 
killedBy: McpServerAdapter sollte MCP-Prompts strikt prüfen
statusReason: Cannot read properties of null (reading 'mutationScore')

[Killed] LogicalOperator
src/infrastructure/mcp/mcp-server.adapter.ts:520:28
         const promptText = `Du bist ein Experte für Mutation Testing und TDD.
 Hier ist die Analyse der überlebenden Mutanten für das Projekt:
 
-Gesamter Mutationsscore: ${summary?.mutationScore ?? "N/A"}%
+Gesamter Mutationsscore: ${summary?.mutationScore && "N/A"}%
 Überlebte Mutanten: ${survived.length}
 
killedBy: McpServerAdapter sollte MCP-Prompts strikt prüfen
statusReason: expected 'Du bist ein Experte für Mutation Test…' to contain 'Gesamter Mutationsscore: N/A%'
