[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:13:70
 
 export type AudioPlayerFn = (soundPath: string) => Promise<void>;
 
-export function defaultAudioPlayer(soundPath: string): Promise<void> {
-  return new Promise((resolve) => {
-    let command: string;
-    if (process.platform === "win32") {
-      const escapedPath = soundPath.replace(/'/g, "''");
-      command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (process.platform === "darwin") {
-      command = `afplay "${soundPath}"`;
-    } else {
-      command = `aplay "${soundPath}" || paplay "${soundPath}"`;
-    }
-
-    exec(command, (err) => {
-      resolve();
-    });
-  });
-}
+export function defaultAudioPlayer(soundPath: string): Promise<void> {}
 
 export class DesktopNotifierAdapter implements NotificationServicePort {
killedBy: DesktopNotifierAdapter führt defaultAudioPlayer ohne unbehandelte Fehler aus
statusReason: You must provide a Promise to expect() when using .resolves, not 'undefined'.

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:14:35
 export type AudioPlayerFn = (soundPath: string) => Promise<void>;
 
 export function defaultAudioPlayer(soundPath: string): Promise<void> {
-  return new Promise((resolve) => {
-    let command: string;
-    if (process.platform === "win32") {
-      const escapedPath = soundPath.replace(/'/g, "''");
-      command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (process.platform === "darwin") {
-      command = `afplay "${soundPath}"`;
-    } else {
-      command = `aplay "${soundPath}" || paplay "${soundPath}"`;
-    }
-
-    exec(command, (err) => {
-      resolve();
-    });
-  });
+  return new Promise((resolve) => {});
 }
 
killedBy: DesktopNotifierAdapter führt defaultAudioPlayer ohne unbehandelte Fehler aus
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:16:39
 export function defaultAudioPlayer(soundPath: string): Promise<void> {
   return new Promise((resolve) => {
     let command: string;
-    if (process.platform === "win32") {
-      const escapedPath = soundPath.replace(/'/g, "''");
-      command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (process.platform === "darwin") {
+    if (process.platform === "win32") {} else if (process.platform === "darwin") {
       command = `afplay "${soundPath}"`;
     } else {
killedBy: DesktopNotifierAdapter führt defaultAudioPlayer ohne unbehandelte Fehler aus
statusReason: promise rejected "TypeError: The "command" argument must be… { code: '…' }" instead of resolving

[Survived] EqualityOperator
src/infrastructure/notification/desktop-notifier.adapter.ts:16:9
 export function defaultAudioPlayer(soundPath: string): Promise<void> {
   return new Promise((resolve) => {
     let command: string;
-    if (process.platform === "win32") {
+    if (process.platform !== "win32") {
       const escapedPath = soundPath.replace(/'/g, "''");
       command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;

[NoCoverage] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:19:47
     if (process.platform === "win32") {
       const escapedPath = soundPath.replace(/'/g, "''");
       command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (process.platform === "darwin") {
-      command = `afplay "${soundPath}"`;
-    } else {
+    } else if (process.platform === "darwin") {} else {
       command = `aplay "${soundPath}" || paplay "${soundPath}"`;
     }

[NoCoverage] EqualityOperator
src/infrastructure/notification/desktop-notifier.adapter.ts:19:16
     if (process.platform === "win32") {
       const escapedPath = soundPath.replace(/'/g, "''");
       command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (process.platform === "darwin") {
+    } else if (process.platform !== "darwin") {
       command = `afplay "${soundPath}"`;
     } else {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:25:28
       command = `aplay "${soundPath}" || paplay "${soundPath}"`;
     }
 
-    exec(command, (err) => {
-      resolve();
-    });
+    exec(command, (err) => {});
   });
 }
killedBy: DesktopNotifierAdapter führt defaultAudioPlayer ohne unbehandelte Fehler aus
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:60:9
   }
 
   public async notifyProgress(progressPercent: number, currentMutant?: string): Promise<void> {
-    if (!this.options.enabled) return;
+    if (this.options.enabled) return;
 
     const message = currentMutant
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:75:9
   }
 
   public async notifyCompletion(score: number, killed: number, survived: number): Promise<void> {
-    if (!this.options.enabled) return;
+    if (true) return;
 
     const title = `🧬 Mutationstests Beendet (${score}% Score)`;
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:79:61
 
     const title = `🧬 Mutationstests Beendet (${score}% Score)`;
     const message = `${killed} Mutanten getötet | ${survived} überlebt`;
-    const isPersistent = this.options.persistentOverlay !== false;
+    const isPersistent = this.options.persistentOverlay !== true;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] EqualityOperator
src/infrastructure/notification/desktop-notifier.adapter.ts:94:26
   public async notifyError(errorMessage: string): Promise<void> {
     if (!this.options.enabled) return;
 
-    const isPersistent = this.options.persistentOverlay !== false;
+    const isPersistent = this.options.persistentOverlay === false;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter sendet Fehlerbenachrichtigung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:117:33
     const playSound = Boolean(params.sound);
     const soundPath = this.getSoundPath();
 
-    if (playSound && soundPath) {
-      try {
-        await this.audioPlayer(soundPath);
-      } catch (audioErr) {
-        this.logger.debug("Audio-Wiedergabe fehlgeschlagen:", audioErr as Error);
-      }
-    }
+    if (playSound && soundPath) {}
 
     return new Promise((resolve) => {
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:117:9
     const playSound = Boolean(params.sound);
     const soundPath = this.getSoundPath();
 
-    if (playSound && soundPath) {
+    if (false) {
       try {
         await this.audioPlayer(soundPath);
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:118:11
     const soundPath = this.getSoundPath();
 
     if (playSound && soundPath) {
-      try {
-        await this.audioPlayer(soundPath);
-      } catch (audioErr) {
+      try {} catch (audioErr) {
         this.logger.debug("Audio-Wiedergabe fehlgeschlagen:", audioErr as Error);
       }
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:125:37
       }
     }
 
-    return new Promise((resolve) => {
-      try {
-        const notificationPayload = {
-          ...params,
-          sound: playSound ? soundPath || true : false,
-        };
-
-        this.notifierService.notify(notificationPayload, (err: Error | null) => {
-          if (err) {
-            this.logger.debug("Desktop-Benachrichtigung konnte nicht gesendet werden:", err);
-          }
-          resolve();
-        });
-      } catch (err) {
-        this.logger.debug("Unerwarteter Fehler beim Senden der Benachrichtigung:", err as Error);
-        resolve();
-      }
-    });
+    return new Promise((resolve) => {});
   }
 
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:126:11
     }
 
     return new Promise((resolve) => {
-      try {
-        const notificationPayload = {
-          ...params,
-          sound: playSound ? soundPath || true : false,
-        };
-
-        this.notifierService.notify(notificationPayload, (err: Error | null) => {
-          if (err) {
-            this.logger.debug("Desktop-Benachrichtigung konnte nicht gesendet werden:", err);
-          }
-          resolve();
-        });
-      } catch (err) {
+      try {} catch (err) {
         this.logger.debug("Unerwarteter Fehler beim Senden der Benachrichtigung:", err as Error);
         resolve();
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:129:50
       try {
         const notificationPayload = {
           ...params,
-          sound: playSound ? soundPath || true : false,
+          sound: playSound ? soundPath || true : true,
         };
 
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Survived] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:129:30
       try {
         const notificationPayload = {
           ...params,
-          sound: playSound ? soundPath || true : false,
+          sound: playSound ? false : false,
         };
 

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:146:9
   }
 
   private getSoundPath(): string {
-    if (this.options.customSoundPath) {
+    if (false) {
       return path.resolve(this.options.customSoundPath);
     }
killedBy: DesktopNotifierAdapter unterstützt benutzerdefinierten Pfad für Mutant Hunter Sound
statusReason: expected "spy" to be called with arguments: [ StringContaining "custom" ]

Received: 

  1st spy call:

  Array [
-   StringContaining "custom",
