[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:112:7
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
   if (name.includes("array") || name.includes("collection")) return "Array & Collection";
-  if (name.includes("async") || name.includes("promise") || name.includes("await")) return "Async & Promises";
+  if (false) return "Async & Promises";
   return "Unknown Category";
 }
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Async & Promises' // Object.is equality
