[Killed] BlockStatement
src/core/application/suggest-mutant-fixes.use-case.ts:20:70
 }
 
 export class SuggestMutantFixesUseCase {
-  public execute(mutants: MutantDetail[]): MutantRemediationAdvice[] {
-    const survivedOrNoCoverage = mutants.filter((m) => m.status === "Survived" || m.status === "NoCoverage");
-
-    return survivedOrNoCoverage.map((m) => this.generateRemediation(m));
-  }
+  public execute(mutants: MutantDetail[]): MutantRemediationAdvice[] {}
 
   private generateRemediation(mutant: MutantDetail): MutantRemediationAdvice {
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] MethodExpression
src/core/application/suggest-mutant-fixes.use-case.ts:21:34
 
 export class SuggestMutantFixesUseCase {
   public execute(mutants: MutantDetail[]): MutantRemediationAdvice[] {
-    const survivedOrNoCoverage = mutants.filter((m) => m.status === "Survived" || m.status === "NoCoverage");
+    const survivedOrNoCoverage = mutants;
 
     return survivedOrNoCoverage.map((m) => this.generateRemediation(m));
killedBy: SuggestMutantFixesUseCase should return empty array if all mutants were killed
statusReason: expected [ { mutantId: '1', …(8) } ] to deeply equal []

[Killed] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:21:56
 
 export class SuggestMutantFixesUseCase {
   public execute(mutants: MutantDetail[]): MutantRemediationAdvice[] {
-    const survivedOrNoCoverage = mutants.filter((m) => m.status === "Survived" || m.status === "NoCoverage");
+    const survivedOrNoCoverage = mutants.filter((m) => true);
 
     return survivedOrNoCoverage.map((m) => this.generateRemediation(m));
killedBy: SuggestMutantFixesUseCase should return empty array if all mutants were killed
statusReason: expected [ { mutantId: '1', …(8) } ] to deeply equal []

[Killed] ArrowFunction
src/core/application/suggest-mutant-fixes.use-case.ts:23:37
   public execute(mutants: MutantDetail[]): MutantRemediationAdvice[] {
     const survivedOrNoCoverage = mutants.filter((m) => m.status === "Survived" || m.status === "NoCoverage");
 
-    return survivedOrNoCoverage.map((m) => this.generateRemediation(m));
+    return survivedOrNoCoverage.map(() => undefined);
   }
 
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: expected '[\n  null\n]' to contain 'Arithmetic'

[Killed] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:27:21
   }
 
   private generateRemediation(mutant: MutantDetail): MutantRemediationAdvice {
-    const mutator = mutant.mutatorName || "UnknownMutator";
+    const mutator = mutant.mutatorName && "UnknownMutator";
     const original = mutant.replacement ? "original code" : "";
     const replacement = mutant.replacement || "";
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: expected '[\n  {\n    "mutantId": "1",\n    "fi…' to contain 'Arithmetic'

[Killed] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:27:21
   }
 
   private generateRemediation(mutant: MutantDetail): MutantRemediationAdvice {
-    const mutator = mutant.mutatorName || "UnknownMutator";
+    const mutator = true;
     const original = mutant.replacement ? "original code" : "";
     const replacement = mutant.replacement || "";
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: mutator.includes is not a function

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:29:25
   private generateRemediation(mutant: MutantDetail): MutantRemediationAdvice {
     const mutator = mutant.mutatorName || "UnknownMutator";
     const original = mutant.replacement ? "original code" : "";
-    const replacement = mutant.replacement || "";
+    const replacement = false;
     const startLine = mutant.line || 1;
     const startColumn = mutant.column || 1;

[Survived] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:29:25
   private generateRemediation(mutant: MutantDetail): MutantRemediationAdvice {
     const mutator = mutant.mutatorName || "UnknownMutator";
     const original = mutant.replacement ? "original code" : "";
-    const replacement = mutant.replacement || "";
+    const replacement = mutant.replacement && "";
     const startLine = mutant.line || 1;
     const startColumn = mutant.column || 1;

[Survived] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:30:23
     const mutator = mutant.mutatorName || "UnknownMutator";
     const original = mutant.replacement ? "original code" : "";
     const replacement = mutant.replacement || "";
-    const startLine = mutant.line || 1;
+    const startLine = mutant.line && 1;
     const startColumn = mutant.column || 1;
 

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:30:23
     const mutator = mutant.mutatorName || "UnknownMutator";
     const original = mutant.replacement ? "original code" : "";
     const replacement = mutant.replacement || "";
-    const startLine = mutant.line || 1;
+    const startLine = false;
     const startColumn = mutant.column || 1;
 

[Survived] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:31:25
     const original = mutant.replacement ? "original code" : "";
     const replacement = mutant.replacement || "";
     const startLine = mutant.line || 1;
-    const startColumn = mutant.column || 1;
+    const startColumn = mutant.column && 1;
 
     let explanation = `Mutant survived at line ${startLine} using mutator '${mutator}'.`;

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:31:25
     const original = mutant.replacement ? "original code" : "";
     const replacement = mutant.replacement || "";
     const startLine = mutant.line || 1;
-    const startColumn = mutant.column || 1;
+    const startColumn = false;
 
     let explanation = `Mutant survived at line ${startLine} using mutator '${mutator}'.`;

[Killed] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:37:9
     let suggestedAssertion = `expect(result).toBeDefined();`;
     let boundaryTestSnippet = `it('should handle boundary condition for ${mutator} at line ${startLine}', () => {\n  // Add boundary test assertion\n});`;
 
-    if (mutator.includes("Equality") || mutator.includes("Conditional")) {
+    if (false) {
       explanation = `Equality/Boundary condition survived at line ${startLine}. Code changed from '${original}' to '${replacement}'.`;
       suggestedAssertion = `expect(result).toBe(exactExpectedBoundaryValue);`;
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected 'Mutant survived at line 15 using muta…' to contain 'Equality/Boundary condition survived'

[Killed] LogicalOperator
src/core/application/suggest-mutant-fixes.use-case.ts:37:9
     let suggestedAssertion = `expect(result).toBeDefined();`;
     let boundaryTestSnippet = `it('should handle boundary condition for ${mutator} at line ${startLine}', () => {\n  // Add boundary test assertion\n});`;
 
-    if (mutator.includes("Equality") || mutator.includes("Conditional")) {
+    if (mutator.includes("Equality") && mutator.includes("Conditional")) {
       explanation = `Equality/Boundary condition survived at line ${startLine}. Code changed from '${original}' to '${replacement}'.`;
       suggestedAssertion = `expect(result).toBe(exactExpectedBoundaryValue);`;
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected 'Mutant survived at line 15 using muta…' to contain 'Equality/Boundary condition survived'

[Killed] BlockStatement
src/core/application/suggest-mutant-fixes.use-case.ts:41:75
       explanation = `Equality/Boundary condition survived at line ${startLine}. Code changed from '${original}' to '${replacement}'.`;
       suggestedAssertion = `expect(result).toBe(exactExpectedBoundaryValue);`;
       boundaryTestSnippet = `it('should test exact boundary value at line ${startLine}', () => {\n  const result = testSubject(boundaryInput);\n  expect(result).toEqual(expectedBoundaryValue);\n});`;
-    } else if (mutator.includes("String") || mutator.includes("Literal")) {
-      explanation = `String/Literal mutation survived at line ${startLine}. Code mutated to '${replacement}'.`;
-      suggestedAssertion = `expect(outputString).toContain(expectedSubstring);`;
-      boundaryTestSnippet = `it('should assert literal output formatting at line ${startLine}', () => {\n  expect(output).toBe(expectedLiteral);\n});`;
-    } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
+    } else if (mutator.includes("String") || mutator.includes("Literal")) {} else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
       explanation = `Logical operator condition survived at line ${startLine}. Branch condition was not exercised in both true/false states.`;
       suggestedAssertion = `expect(conditionResult).toBe(false); // test false branch explicitly`;
killedBy: SuggestMutantFixesUseCase should generate remediation advice for NoCoverage mutants
statusReason: expected 'Mutant survived at line 22 using muta…' to contain 'String/Literal mutation survived'

[Killed] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:41:16
       explanation = `Equality/Boundary condition survived at line ${startLine}. Code changed from '${original}' to '${replacement}'.`;
       suggestedAssertion = `expect(result).toBe(exactExpectedBoundaryValue);`;
       boundaryTestSnippet = `it('should test exact boundary value at line ${startLine}', () => {\n  const result = testSubject(boundaryInput);\n  expect(result).toEqual(expectedBoundaryValue);\n});`;
-    } else if (mutator.includes("String") || mutator.includes("Literal")) {
+    } else if (false) {
       explanation = `String/Literal mutation survived at line ${startLine}. Code mutated to '${replacement}'.`;
       suggestedAssertion = `expect(outputString).toContain(expectedSubstring);`;
killedBy: SuggestMutantFixesUseCase should generate remediation advice for NoCoverage mutants
statusReason: expected 'Mutant survived at line 22 using muta…' to contain 'String/Literal mutation survived'

[Survived] ConditionalExpression
src/core/application/suggest-mutant-fixes.use-case.ts:45:16
       explanation = `String/Literal mutation survived at line ${startLine}. Code mutated to '${replacement}'.`;
       suggestedAssertion = `expect(outputString).toContain(expectedSubstring);`;
       boundaryTestSnippet = `it('should assert literal output formatting at line ${startLine}', () => {\n  expect(output).toBe(expectedLiteral);\n});`;
-    } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
+    } else if (true) {
       explanation = `Logical operator condition survived at line ${startLine}. Branch condition was not exercised in both true/false states.`;
       suggestedAssertion = `expect(conditionResult).toBe(false); // test false branch explicitly`;

[NoCoverage] BlockStatement
src/core/application/suggest-mutant-fixes.use-case.ts:45:76
       explanation = `String/Literal mutation survived at line ${startLine}. Code mutated to '${replacement}'.`;
       suggestedAssertion = `expect(outputString).toContain(expectedSubstring);`;
       boundaryTestSnippet = `it('should assert literal output formatting at line ${startLine}', () => {\n  expect(output).toBe(expectedLiteral);\n});`;
-    } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
-      explanation = `Logical operator condition survived at line ${startLine}. Branch condition was not exercised in both true/false states.`;
-      suggestedAssertion = `expect(conditionResult).toBe(false); // test false branch explicitly`;
-      boundaryTestSnippet = `it('should test false branch condition at line ${startLine}', () => {\n  expect(testSubject(falseInput)).toBe(false);\n});`;
-    }
+    } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {}
 
     return {

[Killed] ObjectLiteral
src/core/application/suggest-mutant-fixes.use-case.ts:51:12
       boundaryTestSnippet = `it('should test false branch condition at line ${startLine}', () => {\n  expect(testSubject(falseInput)).toBe(false);\n});`;
     }
 
-    return {
-      mutantId: mutant.id,
-      fileName: mutant.filePath,
-      mutatorName: mutator,
-      originalCode: original,
-      mutatedCode: replacement,
-      location: { start: { line: startLine, column: startColumn }, end: { line: startLine, column: startColumn } },
-      explanation,
-      suggestedAssertion,
-      boundaryTestSnippet,
-    };
+    return {};
   }
 }
killedBy: SuggestMutantFixesUseCase should generate remediation advice for survived mutants
statusReason: expected undefined to be 'm1' // Object.is equality
