[Survived] ArrayDeclaration
src/core/domain/mutation-trend-tracker.ts:11:38
 }
 
 export class MutationTrendTracker {
-  private history: HistoricalRun[] = [];
+  private history: HistoricalRun[] = ["Stryker was here"];
 
   constructor(initialHistory: HistoricalRun[] = []) {

[Killed] BlockStatement
src/core/domain/mutation-trend-tracker.ts:13:53
 export class MutationTrendTracker {
   private history: HistoricalRun[] = [];
 
-  constructor(initialHistory: HistoricalRun[] = []) {
-    this.history = [...initialHistory];
-  }
+  constructor(initialHistory: HistoricalRun[] = []) {}
 
   public recordRun(run: HistoricalRun): void {
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected +0 to be 7.5 // Object.is equality

[Killed] ArrayDeclaration
src/core/domain/mutation-trend-tracker.ts:14:20
   private history: HistoricalRun[] = [];
 
   constructor(initialHistory: HistoricalRun[] = []) {
-    this.history = [...initialHistory];
+    this.history = [];
   }
 
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected +0 to be 7.5 // Object.is equality

[Killed] BlockStatement
src/core/domain/mutation-trend-tracker.ts:17:46
     this.history = [...initialHistory];
   }
 
-  public recordRun(run: HistoricalRun): void {
-    this.history.push(run);
-  }
+  public recordRun(run: HistoricalRun): void {}
 
   public getHistory(): HistoricalRun[] {
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected 85 to be 92.5 // Object.is equality

[NoCoverage] BlockStatement
src/core/domain/mutation-trend-tracker.ts:21:40
     this.history.push(run);
   }
 
-  public getHistory(): HistoricalRun[] {
-    return [...this.history];
-  }
+  public getHistory(): HistoricalRun[] {}
 
   public getTrendSummary(): { scoreDelta: number; isImproving: boolean; latestScore: number } {

[Killed] BlockStatement
src/core/domain/mutation-trend-tracker.ts:25:95
     return [...this.history];
   }
 
-  public getTrendSummary(): { scoreDelta: number; isImproving: boolean; latestScore: number } {
-    if (this.history.length === 0) {
-      return { scoreDelta: 0, isImproving: true, latestScore: 0 };
-    }
-
-    const latest = this.history[this.history.length - 1];
-    if (this.history.length === 1) {
-      return { scoreDelta: 0, isImproving: true, latestScore: latest.mutationScore };
-    }
-
-    const previous = this.history[this.history.length - 2];
-    const scoreDelta = Number((latest.mutationScore - previous.mutationScore).toFixed(2));
-    const isImproving = scoreDelta >= 0;
-
-    return {
-      scoreDelta,
-      isImproving,
-      latestScore: latest.mutationScore,
-    };
-  }
+  public getTrendSummary(): { scoreDelta: number; isImproving: boolean; latestScore: number } {}
 }
 
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/core/domain/mutation-trend-tracker.ts:26:9
   }
 
   public getTrendSummary(): { scoreDelta: number; isImproving: boolean; latestScore: number } {
-    if (this.history.length === 0) {
+    if (true) {
       return { scoreDelta: 0, isImproving: true, latestScore: 0 };
     }
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected +0 to be 92.5 // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-trend-tracker.ts:26:9
   }
 
   public getTrendSummary(): { scoreDelta: number; isImproving: boolean; latestScore: number } {
-    if (this.history.length === 0) {
+    if (this.history.length !== 0) {
       return { scoreDelta: 0, isImproving: true, latestScore: 0 };
     }
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected +0 to be 92.5 // Object.is equality

[NoCoverage] BooleanLiteral
src/core/domain/mutation-trend-tracker.ts:27:44
 
   public getTrendSummary(): { scoreDelta: number; isImproving: boolean; latestScore: number } {
     if (this.history.length === 0) {
-      return { scoreDelta: 0, isImproving: true, latestScore: 0 };
+      return { scoreDelta: 0, isImproving: false, latestScore: 0 };
     }
 

[Killed] ArithmeticOperator
src/core/domain/mutation-trend-tracker.ts:30:33
       return { scoreDelta: 0, isImproving: true, latestScore: 0 };
     }
 
-    const latest = this.history[this.history.length - 1];
+    const latest = this.history[this.history.length + 1];
     if (this.history.length === 1) {
       return { scoreDelta: 0, isImproving: true, latestScore: latest.mutationScore };
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Cannot read properties of undefined (reading 'mutationScore')

[Killed] EqualityOperator
src/core/domain/mutation-trend-tracker.ts:31:9
     }
 
     const latest = this.history[this.history.length - 1];
-    if (this.history.length === 1) {
+    if (this.history.length !== 1) {
       return { scoreDelta: 0, isImproving: true, latestScore: latest.mutationScore };
     }
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected +0 to be 7.5 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-trend-tracker.ts:31:9
     }
 
     const latest = this.history[this.history.length - 1];
-    if (this.history.length === 1) {
+    if (true) {
       return { scoreDelta: 0, isImproving: true, latestScore: latest.mutationScore };
     }
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected +0 to be 7.5 // Object.is equality

[Killed] BooleanLiteral
src/core/domain/mutation-trend-tracker.ts:32:44
 
     const latest = this.history[this.history.length - 1];
     if (this.history.length === 1) {
-      return { scoreDelta: 0, isImproving: true, latestScore: latest.mutationScore };
+      return { scoreDelta: 0, isImproving: false, latestScore: latest.mutationScore };
     }
 
killedBy: MutationTrendTracker should handle single run gracefully
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-trend-tracker.ts:35:35
       return { scoreDelta: 0, isImproving: true, latestScore: latest.mutationScore };
     }
 
-    const previous = this.history[this.history.length - 2];
+    const previous = this.history[this.history.length + 2];
     const scoreDelta = Number((latest.mutationScore - previous.mutationScore).toFixed(2));
     const isImproving = scoreDelta >= 0;
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: Cannot read properties of undefined (reading 'mutationScore')

[Killed] ArithmeticOperator
src/core/domain/mutation-trend-tracker.ts:36:32
     }
 
     const previous = this.history[this.history.length - 2];
-    const scoreDelta = Number((latest.mutationScore - previous.mutationScore).toFixed(2));
+    const scoreDelta = Number((latest.mutationScore + previous.mutationScore).toFixed(2));
     const isImproving = scoreDelta >= 0;
 
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected 177.5 to be 7.5 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-trend-tracker.ts:37:25
 
     const previous = this.history[this.history.length - 2];
     const scoreDelta = Number((latest.mutationScore - previous.mutationScore).toFixed(2));
-    const isImproving = scoreDelta >= 0;
+    const isImproving = false;
 
     return {
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-trend-tracker.ts:37:25
 
     const previous = this.history[this.history.length - 2];
     const scoreDelta = Number((latest.mutationScore - previous.mutationScore).toFixed(2));
-    const isImproving = scoreDelta >= 0;
+    const isImproving = scoreDelta < 0;
 
     return {
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected false to be true // Object.is equality
