[Survived] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:32:59
 
 export const SERVER_INFO = { name: "stryker-mcp-server", version: "1.0.0" };
 
-function parseFilePath(args: unknown): string | undefined {
-  if (typeof args !== "object" || args === null) return undefined;
-  const rawPath = (args as { filePath?: unknown }).filePath;
-  return typeof rawPath === "string" && rawPath.trim() !== "" ? rawPath.trim() : undefined;
-}
+function parseFilePath(args: unknown): string | undefined {}
 
 export class McpServerAdapter {

[Survived] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:33:35
 export const SERVER_INFO = { name: "stryker-mcp-server", version: "1.0.0" };
 
 function parseFilePath(args: unknown): string | undefined {
-  if (typeof args !== "object" || args === null) return undefined;
+  if (typeof args !== "object" || args !== null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
   return typeof rawPath === "string" && rawPath.trim() !== "" ? rawPath.trim() : undefined;

[Survived] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:33:7
 export const SERVER_INFO = { name: "stryker-mcp-server", version: "1.0.0" };
 
 function parseFilePath(args: unknown): string | undefined {
-  if (typeof args !== "object" || args === null) return undefined;
+  if (false || args === null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
   return typeof rawPath === "string" && rawPath.trim() !== "" ? rawPath.trim() : undefined;

[Killed] LogicalOperator
src/infrastructure/mcp/mcp-server.adapter.ts:35:10
 function parseFilePath(args: unknown): string | undefined {
   if (typeof args !== "object" || args === null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
-  return typeof rawPath === "string" && rawPath.trim() !== "" ? rawPath.trim() : undefined;
+  return typeof rawPath === "string" || rawPath.trim() !== "" ? rawPath.trim() : undefined;
 }
 
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:35:10
 function parseFilePath(args: unknown): string | undefined {
   if (typeof args !== "object" || args === null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
-  return typeof rawPath === "string" && rawPath.trim() !== "" ? rawPath.trim() : undefined;
+  return true ? rawPath.trim() : undefined;
 }
 
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:56:5
     private readonly getSummaryUseCase: GetMutationSummaryUseCase,
     private readonly port: number = 3000,
     private readonly notificationService: NotificationServicePort = new NullNotificationAdapter(),
-  ) {
-    this.mcpServer = new Server(SERVER_INFO, {
-      capabilities: {
-        resources: {},
-        tools: {},
-        prompts: {},
-      },
-    });
-
-    this.registerResourceHandlers();
-    this.registerToolHandlers();
-    this.registerPromptHandlers();
-  }
+  ) {}
 
   public get activePort(): number {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Cannot read properties of undefined (reading '1')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:70:35
     this.registerPromptHandlers();
   }
 
-  public get activePort(): number {
-    const address = this.httpServer?.address();
-    return address ? (address as AddressInfo).port : this.port;
-  }
+  public get activePort(): number {}
 
   public async startStdio(): Promise<Result<void, Error>> {
killedBy: McpServerAdapter sollte den initialen konfigurierten Port zurückgeben, wenn der Server offline ist
statusReason: expected undefined to be +0 // Object.is equality

[Killed] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:71:21
   }
 
   public get activePort(): number {
-    const address = this.httpServer?.address();
+    const address = this.httpServer.address();
     return address ? (address as AddressInfo).port : this.port;
   }
killedBy: McpServerAdapter sollte den initialen konfigurierten Port zurückgeben, wenn der Server offline ist
statusReason: Cannot read properties of null (reading 'address')

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:75:59
     return address ? (address as AddressInfo).port : this.port;
   }
 
-  public async startStdio(): Promise<Result<void, Error>> {
-    try {
-      const transport = new StdioServerTransport();
-      await this.mcpServer.connect(transport);
-      return ok(undefined);
-    } catch (error) {
-      return err(error as Error);
-    }
-  }
+  public async startStdio(): Promise<Result<void, Error>> {}
 
   public async start(): Promise<Result<void, Error>> {

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:76:9
   }
 
   public async startStdio(): Promise<Result<void, Error>> {
-    try {
-      const transport = new StdioServerTransport();
-      await this.mcpServer.connect(transport);
-      return ok(undefined);
-    } catch (error) {
+    try {} catch (error) {
       return err(error as Error);
     }

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:80:21
       const transport = new StdioServerTransport();
       await this.mcpServer.connect(transport);
       return ok(undefined);
-    } catch (error) {
-      return err(error as Error);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:88:46
   public async start(): Promise<Result<void, Error>> {
     const app = express();
 
-    app.get("/mcp/sse", async (_req, res) => {
-      const transport = new SSEServerTransport("/mcp/messages", res);
-      this.sseTransports.set(transport.sessionId, transport);
-
-      transport.onclose = () => {
-        this.sseTransports.delete(transport.sessionId);
-      };
-
-      await this.mcpServer.connect(transport);
-    });
+    app.get("/mcp/sse", async (_req, res) => {});
 
     app.post("/mcp/messages", async (req, res) => {

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:92:33
       const transport = new SSEServerTransport("/mcp/messages", res);
       this.sseTransports.set(transport.sessionId, transport);
 
-      transport.onclose = () => {
-        this.sseTransports.delete(transport.sessionId);
-      };
+      transport.onclose = () => {};
 
       await this.mcpServer.connect(transport);

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:99:51
       await this.mcpServer.connect(transport);
     });
 
-    app.post("/mcp/messages", async (req, res) => {
-      const sessionId = req.query.sessionId as string | undefined;
-      if (!sessionId) {
-        res.status(400).send("Missing sessionId query parameter");
-        return;
-      }
-
-      const transport = this.sseTransports.get(sessionId);
-      if (!transport) {
-        res.status(404).send("Session not found");
-        return;
-      }
-
-      await transport.handlePostMessage(req, res);
-    });
+    app.post("/mcp/messages", async (req, res) => {});
 
     return new Promise((resolve) => {

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:101:11
 
     app.post("/mcp/messages", async (req, res) => {
       const sessionId = req.query.sessionId as string | undefined;
-      if (!sessionId) {
+      if (false) {
         res.status(400).send("Missing sessionId query parameter");
         return;

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:101:11
 
     app.post("/mcp/messages", async (req, res) => {
       const sessionId = req.query.sessionId as string | undefined;
-      if (!sessionId) {
+      if (true) {
         res.status(400).send("Missing sessionId query parameter");
         return;

[NoCoverage] BooleanLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:107:11
       }
 
       const transport = this.sseTransports.get(sessionId);
-      if (!transport) {
+      if (transport) {
         res.status(404).send("Session not found");
         return;

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:107:23
       }
 
       const transport = this.sseTransports.get(sessionId);
-      if (!transport) {
-        res.status(404).send("Session not found");
-        return;
-      }
+      if (!transport) {}
 
       await transport.handlePostMessage(req, res);

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:115:37
       await transport.handlePostMessage(req, res);
     });
 
-    return new Promise((resolve) => {
-      this.httpServer = app.listen(this.port, () => {
-        this.logger.info(`MCP Server started on port ${this.activePort}`);
-        resolve(ok(undefined));
-      });
-
-      this.httpServer.on("error", (error) => {
-        this.logger.error("Failed to start MCP Server", error);
-        resolve(err(error));
-      });
-    });
+    return new Promise((resolve) => {});
   }
 
killedBy: McpServerAdapter sollte den Server erfolgreich starten und ein ok-Result zurückgeben
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:116:53
     });
 
     return new Promise((resolve) => {
-      this.httpServer = app.listen(this.port, () => {
-        this.logger.info(`MCP Server started on port ${this.activePort}`);
-        resolve(ok(undefined));
-      });
+      this.httpServer = app.listen(this.port, () => {});
 
       this.httpServer.on("error", (error) => {
killedBy: McpServerAdapter sollte den Server erfolgreich starten und ein ok-Result zurückgeben
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:121:46
         resolve(ok(undefined));
       });
 
-      this.httpServer.on("error", (error) => {
-        this.logger.error("Failed to start MCP Server", error);
-        resolve(err(error));
-      });
+      this.httpServer.on("error", (error) => {});
     });
   }

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:128:53
     });
   }
 
-  public async stop(): Promise<Result<void, Error>> {
-    return new Promise((resolve) => {
-      if (!this.httpServer) {
-        resolve(ok(undefined));
-        return;
-      }
-
-      this.httpServer.close((error) => {
-        if (error) {
-          this.logger.error("Error stopping MCP Server", error);
-          resolve(err(error));
-        } else {
-          this.logger.info("MCP Server stopped");
-          this.httpServer = null;
-          resolve(ok(undefined));
-        }
-      });
-    });
-  }
+  public async stop(): Promise<Result<void, Error>> {}
 
   private registerResourceHandlers(): void {
killedBy: McpServerAdapter schließt den aktiven HTTP-Server während des Shutdowns
statusReason: expected "close" to be called once, but got 0 times

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:129:37
   }
 
   public async stop(): Promise<Result<void, Error>> {
-    return new Promise((resolve) => {
-      if (!this.httpServer) {
-        resolve(ok(undefined));
-        return;
-      }
-
-      this.httpServer.close((error) => {
-        if (error) {
-          this.logger.error("Error stopping MCP Server", error);
-          resolve(err(error));
-        } else {
-          this.logger.info("MCP Server stopped");
-          this.httpServer = null;
-          resolve(ok(undefined));
-        }
-      });
-    });
+    return new Promise((resolve) => {});
   }
 
killedBy: McpServerAdapter sollte die korrekten Server-Metadaten bereitstellen
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] BooleanLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:130:11
 
   public async stop(): Promise<Result<void, Error>> {
     return new Promise((resolve) => {
-      if (!this.httpServer) {
+      if (this.httpServer) {
         resolve(ok(undefined));
         return;
killedBy: McpServerAdapter sollte die korrekten Server-Metadaten bereitstellen
statusReason: Cannot read properties of null (reading 'close')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:130:29
 
   public async stop(): Promise<Result<void, Error>> {
     return new Promise((resolve) => {
-      if (!this.httpServer) {
-        resolve(ok(undefined));
-        return;
-      }
+      if (!this.httpServer) {}
 
       this.httpServer.close((error) => {
killedBy: McpServerAdapter sollte die korrekten Server-Metadaten bereitstellen
statusReason: Cannot read properties of null (reading 'close')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:135:40
         return;
       }
 
-      this.httpServer.close((error) => {
-        if (error) {
-          this.logger.error("Error stopping MCP Server", error);
-          resolve(err(error));
-        } else {
-          this.logger.info("MCP Server stopped");
-          this.httpServer = null;
-          resolve(ok(undefined));
-        }
-      });
+      this.httpServer.close((error) => {});
     });
   }
killedBy: McpServerAdapter sollte den Server erfolgreich starten und ein ok-Result zurückgeben
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Survived] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:136:13
       }
 
       this.httpServer.close((error) => {
-        if (error) {
+        if (true) {
           this.logger.error("Error stopping MCP Server", error);
           resolve(err(error));

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:136:20
       }
 
       this.httpServer.close((error) => {
-        if (error) {
-          this.logger.error("Error stopping MCP Server", error);
-          resolve(err(error));
-        } else {
+        if (error) {} else {
           this.logger.info("MCP Server stopped");
           this.httpServer = null;

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:139:16
         if (error) {
           this.logger.error("Error stopping MCP Server", error);
           resolve(err(error));
-        } else {
-          this.logger.info("MCP Server stopped");
-          this.httpServer = null;
-          resolve(ok(undefined));
-        }
+        } else {}
       });
     });
killedBy: McpServerAdapter sollte den Server erfolgreich starten und ein ok-Result zurückgeben
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:169:9
           mimeType: "application/json",
           description: "Liste aller überlebenden Mutanten inkl. Pfad, Zeile, Mutator und Ersetzung.",
         },
-        {
-          uri: "stryker://analytics/trends",
-          name: "Mutation Testing Score Trends",
-          mimeType: "application/json",
-          description: "Historische Trendanalyse der Mutationsscore-Entwicklung.",
-        },
+        {},
         {
           uri: "stryker://status",
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected undefined to be 'stryker://analytics/trends' // Object.is equality

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:187:11
     this.mcpServer.setRequestHandler(ReadResourceRequestSchema, async (request) => {
       const uri = request.params.uri;
 
-      if (uri === "stryker://report/latest") {
+      if (uri !== "stryker://report/latest") {
         const report = this.reportStream.current();
         return {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Ressource nicht gefunden

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:187:11
     this.mcpServer.setRequestHandler(ReadResourceRequestSchema, async (request) => {
       const uri = request.params.uri;
 
-      if (uri === "stryker://report/latest") {
+      if (true) {
         const report = this.reportStream.current();
         return {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected '{"files":{"src/foo.ts":{"mutants":[{"…' to contain 'mutationScore'

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:191:13
         const report = this.reportStream.current();
         return {
           contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: JSON.stringify(report ?? { files: {} }),
-            },
+            {},
           ],
         };
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected undefined to be '{"files":{}}' // Object.is equality

[Killed] LogicalOperator
src/infrastructure/mcp/mcp-server.adapter.ts:194:36
             {
               uri,
               mimeType: "application/json",
-              text: JSON.stringify(report ?? { files: {} }),
+              text: JSON.stringify(report && {
+  files: {}
+}),
             },
           ],
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected 'null' to be '{"files":{}}' // Object.is equality

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:200:47
         };
       }
 
-      if (uri === "stryker://report/summary") {
-        const summaryResult = this.getSummaryUseCase.execute();
-        const summaryText = summaryResult.isOk
-          ? JSON.stringify(summaryResult.value)
-          : JSON.stringify({ error: summaryResult.error.message });
-
-        return {
-          contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: summaryText,
-            },
-          ],
-        };
-      }
+      if (uri === "stryker://report/summary") {}
 
       if (uri === "stryker://report/survived") {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Ressource nicht gefunden

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:200:11
         };
       }
 
-      if (uri === "stryker://report/summary") {
+      if (true) {
         const summaryResult = this.getSummaryUseCase.execute();
         const summaryText = summaryResult.isOk
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected '{"totalMutants":2,"killed":1,"survive…' to contain 'Arithmetic'

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:217:11
         };
       }
 
-      if (uri === "stryker://report/survived") {
+      if (false) {
         const survivedResult = this.getSurvivedUseCase.execute();
         const text = survivedResult.isOk
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Ressource nicht gefunden

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:217:48
         };
       }
 
-      if (uri === "stryker://report/survived") {
-        const survivedResult = this.getSurvivedUseCase.execute();
-        const text = survivedResult.isOk
-          ? JSON.stringify(survivedResult.value, null, 2)
-          : JSON.stringify({ error: survivedResult.error.message });
-
-        return {
-          contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text,
-            },
-          ],
-        };
-      }
+      if (uri === "stryker://report/survived") {}
 
       if (uri === "stryker://analytics/trends") {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Ressource nicht gefunden

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:223:16
           ? JSON.stringify(survivedResult.value, null, 2)
           : JSON.stringify({ error: survivedResult.error.message });
 
-        return {
-          contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text,
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:234:11
         };
       }
 
-      if (uri === "stryker://analytics/trends") {
+      if (uri !== "stryker://analytics/trends") {
         const summary = this.getSummaryUseCase.execute();
         if (summary.isOk) {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Ressource nicht gefunden

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:234:11
         };
       }
 
-      if (uri === "stryker://analytics/trends") {
+      if (true) {
         const summary = this.getSummaryUseCase.execute();
         if (summary.isOk) {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected '{\n  "scoreDelta": 0,\n  "isImproving…' to contain 'idle'

[Survived] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:236:27
 
       if (uri === "stryker://analytics/trends") {
         const summary = this.getSummaryUseCase.execute();
-        if (summary.isOk) {
-          this.trendTracker.recordRun({
-            timestamp: new Date().toISOString(),
-            mutationScore: summary.value.mutationScore,
-            totalMutants: summary.value.totalMutants,
-            killedMutants: summary.value.killed,
-            survivedMutants: summary.value.survived,
-          });
-        }
+        if (summary.isOk) {}
         return {
           contents: [

[Survived] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:236:13
 
       if (uri === "stryker://analytics/trends") {
         const summary = this.getSummaryUseCase.execute();
-        if (summary.isOk) {
+        if (true) {
           this.trendTracker.recordRun({
             timestamp: new Date().toISOString(),

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:247:13
         }
         return {
           contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: JSON.stringify(this.trendTracker.getTrendSummary(), null, 2),
-            },
+            {},
           ],
         };
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:256:11
         };
       }
 
-      if (uri === "stryker://status") {
+      if (true) {
         const status = this.statusStream.current();
         return {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: promise resolved "{ contents: [ { …(3) } ] }" instead of rejecting

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:256:11
         };
       }
 
-      if (uri === "stryker://status") {
+      if (false) {
         const status = this.statusStream.current();
         return {
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Ressource nicht gefunden

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:258:16
 
       if (uri === "stryker://status") {
         const status = this.statusStream.current();
-        return {
-          contents: [
-            {
-              uri,
-              mimeType: "application/json",
-              text: JSON.stringify(status),
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Cannot read properties of undefined (reading '0')

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:307:25
           description: "Erkennt in Git geänderte TypeScript-Dateien (für Commits, Commit-Ranges oder Uncommitted Changes) und führt Mutationstests gezielt nur für diese aus.",
           inputSchema: {
             type: "object",
-            properties: {
-              commitSha: {
-                type: "string",
-                description: "Spezifischer Commit-Hash für gezielten Testlauf (z.B. 'a9d1206').",
-              },
-              revision: {
-                type: "string",
-                description: "Ziel-Branch oder Revision für Git-Diff (z.B. 'HEAD~1' oder 'main').",
-              },
-              fromRevision: {
-                type: "string",
-                description: "Start-Revision für Commit-Bereich (z.B. 'v1.0.0' oder 'HEAD~3').",
-              },
-              toRevision: {
-                type: "string",
-                description: "Ziel-Revision für Commit-Bereich (z.B. 'v1.1.0' oder 'HEAD').",
-              },
-              baseBranch: {
-                type: "string",
-                description: "Veraltet: Nutze 'revision' stattdessen.",
-              },
-            },
+            properties: {},
           },
         },

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:316:29
                 type: "string",
                 description: "Ziel-Branch oder Revision für Git-Diff (z.B. 'HEAD~1' oder 'main').",
               },
-              fromRevision: {
-                type: "string",
-                description: "Start-Revision für Commit-Bereich (z.B. 'v1.0.0' oder 'HEAD~3').",
-              },
+              fromRevision: {},
               toRevision: {
                 type: "string",

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:344:9
             },
           },
         },
-        {
-          name: "predict_mutation_impact",
-          description: "Analysiert geänderte Quelldateien und prognostiziert in < 1 Sekunde das Risiko überlebender Mutanten.",
-          inputSchema: {
-            type: "object",
-            properties: {
-              changedFiles: {
-                type: "array",
-                items: { type: "string" },
-                description: "Liste der geänderten Dateipfade.",
-              },
-            },
-            required: ["changedFiles"],
-          },
-        },
+        {},
         {
           name: "get_mutation_score",
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: expected [ 'run_mutation_tests', …(6) ] to include 'predict_mutation_impact'

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:347:24
         {
           name: "predict_mutation_impact",
           description: "Analysiert geänderte Quelldateien und prognostiziert in < 1 Sekunde das Risiko überlebender Mutanten.",
-          inputSchema: {
-            type: "object",
-            properties: {
-              changedFiles: {
-                type: "array",
-                items: { type: "string" },
-                description: "Liste der geänderten Dateipfade.",
-              },
-            },
-            required: ["changedFiles"],
-          },
+          inputSchema: {},
         },
         {

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:349:25
           description: "Analysiert geänderte Quelldateien und prognostiziert in < 1 Sekunde das Risiko überlebender Mutanten.",
           inputSchema: {
             type: "object",
-            properties: {
-              changedFiles: {
-                type: "array",
-                items: { type: "string" },
-                description: "Liste der geänderten Dateipfade.",
-              },
-            },
+            properties: {},
             required: ["changedFiles"],
           },

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:352:24
             properties: {
               changedFiles: {
                 type: "array",
-                items: { type: "string" },
+                items: {},
                 description: "Liste der geänderten Dateipfade.",
               },

[Survived] ArrayDeclaration
src/infrastructure/mcp/mcp-server.adapter.ts:356:23
                 description: "Liste der geänderten Dateipfade.",
               },
             },
-            required: ["changedFiles"],
+            required: [],
           },
         },

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:367:9
             properties: {},
           },
         },
-        {
-          name: "get_survived_mutants",
-          description: "Liefert alle überlebenden Mutanten inkl. Dateipfad, Zeile, Mutator-Typ und Ersetzungscode.",
-          inputSchema: {
-            type: "object",
-            properties: {
-              filePath: {
-                type: "string",
-                description: "Optionaler Dateipfad-Filter (z.B. 'src/calculator.ts').",
-              },
-            },
-          },
-        },
+        {},
         {
           name: "configure_desktop_notifications",
