[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:370:24
         {
           name: "get_survived_mutants",
           description: "Liefert alle überlebenden Mutanten inkl. Dateipfad, Zeile, Mutator-Typ und Ersetzungscode.",
-          inputSchema: {
-            type: "object",
-            properties: {
-              filePath: {
-                type: "string",
-                description: "Optionaler Dateipfad-Filter (z.B. 'src/calculator.ts').",
-              },
-            },
-          },
+          inputSchema: {},
         },
         {

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:386:24
           inputSchema: {
             type: "object",
             properties: {
-              enabled: {
-                type: "boolean",
-                description: "Benachrichtigungen aktivieren oder deaktivieren.",
-              },
+              enabled: {},
               persistentOverlay: {
                 type: "boolean",

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:407:11
     this.mcpServer.setRequestHandler(CallToolRequestSchema, async (request) => {
       const { name, arguments: args } = request.params;
 
-      if (name === "run_mutation_tests") {
+      if (name !== "run_mutation_tests") {
         const options = args as { mutate?: string[]; concurrency?: number; testRunner?: string; configFile?: string };
         const runResult = await this.runUseCase.execute(options);
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Unbekanntes Tool: run_mutation_tests

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:407:11
     this.mcpServer.setRequestHandler(CallToolRequestSchema, async (request) => {
       const { name, arguments: args } = request.params;
 
-      if (name === "run_mutation_tests") {
+      if (true) {
         const options = args as { mutate?: string[]; concurrency?: number; testRunner?: string; configFile?: string };
         const runResult = await this.runUseCase.execute(options);
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:411:13
         const options = args as { mutate?: string[]; concurrency?: number; testRunner?: string; configFile?: string };
         const runResult = await this.runUseCase.execute(options);
 
-        if (!runResult.isOk) {
+        if (runResult.isOk) {
           return {
             isError: true,
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:411:13
         const options = args as { mutate?: string[]; concurrency?: number; testRunner?: string; configFile?: string };
         const runResult = await this.runUseCase.execute(options);
 
-        if (!runResult.isOk) {
+        if (true) {
           return {
             isError: true,
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'message')

[NoCoverage] BooleanLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:413:22
 
         if (!runResult.isOk) {
           return {
-            isError: true,
+            isError: false,
             content: [
               {

[NoCoverage] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:415:15
           return {
             isError: true,
             content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen von Mutationstests: ${runResult.error.message}`,
-              },
+              {},
             ],
           };

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-server.adapter.ts:427:20
         const summary = summaryResult.isOk ? summaryResult.value : null;
 
         return {
-          content: [
-            {
-              type: "text",
-              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary?.killed ?? "N/A"}`,
-            },
-          ],
+          content: [],
         };
       }
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'text')

[Survived] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:430:77
           content: [
             {
               type: "text",
-              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary?.killed ?? "N/A"}`,
+              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary?.killed ?? "N/A"}`,
             },
           ],

[Survived] LogicalOperator
src/infrastructure/mcp/mcp-server.adapter.ts:430:173
           content: [
             {
               type: "text",
-              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary?.killed ?? "N/A"}`,
+              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary?.killed && "N/A"}`,
             },
           ],

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:436:11
         };
       }
 
-      if (name === "run_targeted_mutation_tests") {
+      if (true) {
         const rawArgs = args as {
           commitSha?: string;
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:436:11
         };
       }
 
-      if (name === "run_targeted_mutation_tests") {
+      if (name !== "run_targeted_mutation_tests") {
         const rawArgs = args as {
           commitSha?: string;
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'isOk')

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:446:11
         };
 
         const hasSpecificOptions =
-          typeof rawArgs?.commitSha === "string" ||
-          typeof rawArgs?.revision === "string" ||
-          typeof rawArgs?.fromRevision === "string";
+          true;
 
         const targetOptions = hasSpecificOptions

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:446:11
         };
 
         const hasSpecificOptions =
-          typeof rawArgs?.commitSha === "string" ||
-          typeof rawArgs?.revision === "string" ||
-          typeof rawArgs?.fromRevision === "string";
+          false;
 
         const targetOptions = hasSpecificOptions

[NoCoverage] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:447:11
 
         const hasSpecificOptions =
           typeof rawArgs?.commitSha === "string" ||
-          typeof rawArgs?.revision === "string" ||
+          typeof rawArgs?.revision !== "string" ||
           typeof rawArgs?.fromRevision === "string";
 

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:447:11
 
         const hasSpecificOptions =
           typeof rawArgs?.commitSha === "string" ||
-          typeof rawArgs?.revision === "string" ||
+          false ||
           typeof rawArgs?.fromRevision === "string";
 

[NoCoverage] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:448:11
         const hasSpecificOptions =
           typeof rawArgs?.commitSha === "string" ||
           typeof rawArgs?.revision === "string" ||
-          typeof rawArgs?.fromRevision === "string";
+          typeof rawArgs?.fromRevision !== "string";
 
         const targetOptions = hasSpecificOptions

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:448:11
         const hasSpecificOptions =
           typeof rawArgs?.commitSha === "string" ||
           typeof rawArgs?.revision === "string" ||
-          typeof rawArgs?.fromRevision === "string";
+          false;
 
         const targetOptions = hasSpecificOptions

[NoCoverage] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:452:26
 
         const targetOptions = hasSpecificOptions
           ? {
-              commitSha: rawArgs?.commitSha,
+              commitSha: rawArgs.commitSha,
               revision: rawArgs?.revision,
               fromRevision: rawArgs?.fromRevision,

[NoCoverage] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:453:25
         const targetOptions = hasSpecificOptions
           ? {
               commitSha: rawArgs?.commitSha,
-              revision: rawArgs?.revision,
+              revision: rawArgs.revision,
               fromRevision: rawArgs?.fromRevision,
               toRevision: rawArgs?.toRevision,

[NoCoverage] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:454:29
           ? {
               commitSha: rawArgs?.commitSha,
               revision: rawArgs?.revision,
-              fromRevision: rawArgs?.fromRevision,
+              fromRevision: rawArgs.fromRevision,
               toRevision: rawArgs?.toRevision,
             }

[NoCoverage] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:455:27
               commitSha: rawArgs?.commitSha,
               revision: rawArgs?.revision,
               fromRevision: rawArgs?.fromRevision,
-              toRevision: rawArgs?.toRevision,
+              toRevision: rawArgs.toRevision,
             }
           : rawArgs?.baseBranch;

[NoCoverage] OptionalChaining
src/infrastructure/mcp/mcp-server.adapter.ts:457:13
               fromRevision: rawArgs?.fromRevision,
               toRevision: rawArgs?.toRevision,
             }
-          : rawArgs?.baseBranch;
+          : rawArgs.baseBranch;
 
         const runResult = await this.runTargetedUseCase.execute(targetOptions);

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:461:13
 
         const runResult = await this.runTargetedUseCase.execute(targetOptions);
 
-        if (!runResult.isOk) {
+        if (false) {
           return {
             isError: true,

[NoCoverage] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:462:18
         const runResult = await this.runTargetedUseCase.execute(targetOptions);
 
         if (!runResult.isOk) {
-          return {
-            isError: true,
-            content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen zielgerichteter Mutationstests: ${runResult.error.message}`,
-              },
-            ],
-          };
+          return {};
         }
 

[NoCoverage] ArrayDeclaration
src/infrastructure/mcp/mcp-server.adapter.ts:464:22
         if (!runResult.isOk) {
           return {
             isError: true,
-            content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen zielgerichteter Mutationstests: ${runResult.error.message}`,
-              },
-            ],
+            content: [],
           };
         }

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:486:11
         };
       }
 
-      if (name === "suggest_mutant_fixes") {
+      if (true) {
         const filterPath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filterPath);
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: expected '[\n  {\n    "mutantId": "1",\n    "fi…' to contain 'HIGH'

[Killed] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:486:44
         };
       }
 
-      if (name === "suggest_mutant_fixes") {
-        const filterPath = parseFilePath(args);
-        const survivedResult = this.getSurvivedUseCase.execute(filterPath);
-        const survivedMutants = survivedResult.isOk ? survivedResult.value : [];
-        const advice = this.suggestFixesUseCase.execute(survivedMutants);
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(advice, null, 2),
-            },
-          ],
-        };
-      }
+      if (name === "suggest_mutant_fixes") {}
 
       if (name === "predict_mutation_impact") {
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Unbekanntes Tool: suggest_mutant_fixes

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:492:16
         const survivedMutants = survivedResult.isOk ? survivedResult.value : [];
         const advice = this.suggestFixesUseCase.execute(survivedMutants);
 
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(advice, null, 2),
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-server.adapter.ts:493:20
         const advice = this.suggestFixesUseCase.execute(survivedMutants);
 
         return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(advice, null, 2),
-            },
-          ],
+          content: [],
         };
       }
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:502:11
         };
       }
 
-      if (name === "predict_mutation_impact") {
+      if (false) {
         const changedFiles = (args as { changedFiles?: string[] })?.changedFiles || [];
         const riskAnalysis = this.predictImpactUseCase.execute(changedFiles);
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Unbekanntes Tool: predict_mutation_impact

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:502:11
         };
       }
 
-      if (name === "predict_mutation_impact") {
+      if (name !== "predict_mutation_impact") {
         const changedFiles = (args as { changedFiles?: string[] })?.changedFiles || [];
         const riskAnalysis = this.predictImpactUseCase.execute(changedFiles);
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: Unbekanntes Tool: predict_mutation_impact

[Killed] LogicalOperator
src/infrastructure/mcp/mcp-server.adapter.ts:503:30
       }
 
       if (name === "predict_mutation_impact") {
-        const changedFiles = (args as { changedFiles?: string[] })?.changedFiles || [];
+        const changedFiles = (args as {
+  changedFiles?: string[];
+})?.changedFiles && [];
         const riskAnalysis = this.predictImpactUseCase.execute(changedFiles);
 
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: expected '[]' to contain 'HIGH'

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:503:30
       }
 
       if (name === "predict_mutation_impact") {
-        const changedFiles = (args as { changedFiles?: string[] })?.changedFiles || [];
+        const changedFiles = true;
         const riskAnalysis = this.predictImpactUseCase.execute(changedFiles);
 
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: changedFiles.map is not a function

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:508:13
 
         return {
           content: [
-            {
-              type: "text",
-              text: JSON.stringify(riskAnalysis, null, 2),
-            },
+            {},
           ],
         };
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[NoCoverage] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:516:11
         };
       }
 
-      if (name === "get_mutation_score") {
+      if (name !== "get_mutation_score") {
         const summaryResult = this.getSummaryUseCase.execute();
         if (!summaryResult.isOk) {

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:516:11
         };
       }
 
-      if (name === "get_mutation_score") {
+      if (false) {
         const summaryResult = this.getSummaryUseCase.execute();
         if (!summaryResult.isOk) {

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:518:13
 
       if (name === "get_mutation_score") {
         const summaryResult = this.getSummaryUseCase.execute();
-        if (!summaryResult.isOk) {
+        if (true) {
           return {
             isError: true,

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:518:13
 
       if (name === "get_mutation_score") {
         const summaryResult = this.getSummaryUseCase.execute();
-        if (!summaryResult.isOk) {
+        if (false) {
           return {
             isError: true,

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:535:44
         };
       }
 
-      if (name === "get_survived_mutants") {
-        const filterPath = parseFilePath(args);
-        const survivedResult = this.getSurvivedUseCase.execute(filterPath);
-        if (!survivedResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: survivedResult.error.message }],
-          };
-        }
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(survivedResult.value, null, 2),
-            },
-          ],
-        };
-      }
+      if (name === "get_survived_mutants") {}
 
       if (name === "configure_desktop_notifications") {

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:535:11
         };
       }
 
-      if (name === "get_survived_mutants") {
+      if (false) {
         const filterPath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filterPath);

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:538:13
       if (name === "get_survived_mutants") {
         const filterPath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filterPath);
-        if (!survivedResult.isOk) {
+        if (false) {
           return {
             isError: true,

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:538:35
       if (name === "get_survived_mutants") {
         const filterPath = parseFilePath(args);
         const survivedResult = this.getSurvivedUseCase.execute(filterPath);
-        if (!survivedResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: survivedResult.error.message }],
-          };
-        }
+        if (!survivedResult.isOk) {}
 
         return {

[NoCoverage] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:547:13
 
         return {
           content: [
-            {
-              type: "text",
-              text: JSON.stringify(survivedResult.value, null, 2),
-            },
+            {},
           ],
         };

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-server.adapter.ts:555:55
         };
       }
 
-      if (name === "configure_desktop_notifications") {
-        const options = args as { enabled?: boolean; persistentOverlay?: boolean; sound?: boolean };
-        this.notificationService.configure(options);
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: `Desktop Benachrichtigungseinstellungen aktualisiert: ${JSON.stringify(options)}`,
-            },
-          ],
-        };
-      }
+      if (name === "configure_desktop_notifications") {}
 
       throw new Error(`Unbekanntes Tool: ${name}`);

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:555:11
         };
       }
 
-      if (name === "configure_desktop_notifications") {
+      if (false) {
         const options = args as { enabled?: boolean; persistentOverlay?: boolean; sound?: boolean };
         this.notificationService.configure(options);

[NoCoverage] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:559:16
         const options = args as { enabled?: boolean; persistentOverlay?: boolean; sound?: boolean };
         this.notificationService.configure(options);
 
-        return {
-          content: [
-            {
-              type: "text",
-              text: `Desktop Benachrichtigungseinstellungen aktualisiert: ${JSON.stringify(options)}`,
-            },
-          ],
-        };
+        return {};
       }
 

[Survived] ArrowFunction
src/infrastructure/mcp/mcp-server.adapter.ts:574:64
   }
 
   private registerPromptHandlers(): void {
-    this.mcpServer.setRequestHandler(ListPromptsRequestSchema, async () => ({
-      prompts: [
-        {
-          name: "explain_survived_mutants",
-          description: "Formatiert alle überlebenden Mutanten als verständliche Prompt-Anweisung zur KI-Testgenerierung.",
-        },
-        {
-          name: "remediate_mutants",
-          description: "Generiert konkreten Test-Code und Randwertprüfungen für überlebte Mutanten.",
-        },
-      ],
-    }));
+    this.mcpServer.setRequestHandler(ListPromptsRequestSchema, () => undefined);
 
     this.mcpServer.setRequestHandler(GetPromptRequestSchema, async (request) => {

[NoCoverage] ArrayDeclaration
src/infrastructure/mcp/mcp-server.adapter.ts:575:16
 
   private registerPromptHandlers(): void {
     this.mcpServer.setRequestHandler(ListPromptsRequestSchema, async () => ({
-      prompts: [
-        {
-          name: "explain_survived_mutants",
-          description: "Formatiert alle überlebenden Mutanten als verständliche Prompt-Anweisung zur KI-Testgenerierung.",
-        },
-        {
-          name: "remediate_mutants",
-          description: "Generiert konkreten Test-Code und Randwertprüfungen für überlebte Mutanten.",
-        },
-      ],
+      prompts: [],
     }));
 

[NoCoverage] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:590:11
     this.mcpServer.setRequestHandler(GetPromptRequestSchema, async (request) => {
       const { name } = request.params;
 
-      if (name === "explain_survived_mutants" || name === "remediate_mutants") {
+      if (name !== "explain_survived_mutants" || name === "remediate_mutants") {
         const survivedResult = this.getSurvivedUseCase.execute();
         const survived = survivedResult.isOk ? survivedResult.value : [];

[NoCoverage] EqualityOperator
src/infrastructure/mcp/mcp-server.adapter.ts:590:50
     this.mcpServer.setRequestHandler(GetPromptRequestSchema, async (request) => {
       const { name } = request.params;
 
-      if (name === "explain_survived_mutants" || name === "remediate_mutants") {
+      if (name === "explain_survived_mutants" || name !== "remediate_mutants") {
         const survivedResult = this.getSurvivedUseCase.execute();
         const survived = survivedResult.isOk ? survivedResult.value : [];

[NoCoverage] ArrayDeclaration
src/infrastructure/mcp/mcp-server.adapter.ts:592:71
 
       if (name === "explain_survived_mutants" || name === "remediate_mutants") {
         const survivedResult = this.getSurvivedUseCase.execute();
-        const survived = survivedResult.isOk ? survivedResult.value : [];
+        const survived = survivedResult.isOk ? survivedResult.value : ["Stryker was here"];
         const advice = this.suggestFixesUseCase.execute(survived);
 

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:595:13
         const survived = survivedResult.isOk ? survivedResult.value : [];
         const advice = this.suggestFixesUseCase.execute(survived);
 
-        if (survived.length === 0) {
+        if (false) {
           return {
             description: "Keine überlebenden Mutanten vorhanden.",

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-server.adapter.ts:595:13
         const survived = survivedResult.isOk ? survivedResult.value : [];
         const advice = this.suggestFixesUseCase.execute(survived);
 
-        if (survived.length === 0) {
+        if (true) {
           return {
             description: "Keine überlebenden Mutanten vorhanden.",

[NoCoverage] ArrayDeclaration
src/infrastructure/mcp/mcp-server.adapter.ts:598:23
         if (survived.length === 0) {
           return {
             description: "Keine überlebenden Mutanten vorhanden.",
-            messages: [
-              {
-                role: "user",
-                content: {
-                  type: "text",
-                  text: "🎉 Perfekt! Es gibt aktuell keine überlebenden Mutanten. Der Mutation Score liegt bei 100%!",
-                },
-              },
-            ],
+            messages: [],
           };
         }

[NoCoverage] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:617:16
           )
           .join("\n\n");
 
-        return {
-          description: "Aufforderung zur KI-Behebung überlebender Mutanten.",
-          messages: [
-            {
-              role: "user",
-              content: {
-                type: "text",
-                text: `Bitte erstelle Unit-Tests, um die folgenden überlebenden Mutanten zu beheben und einen 100% Mutation Score zu erreichen:\n\n${formattedMutants}`,
-              },
-            },
-          ],
-        };
+        return {};
       }
 

[NoCoverage] ObjectLiteral
src/infrastructure/mcp/mcp-server.adapter.ts:622:24
           messages: [
             {
               role: "user",
-              content: {
-                type: "text",
-                text: `Bitte erstelle Unit-Tests, um die folgenden überlebenden Mutanten zu beheben und einen 100% Mutation Score zu erreichen:\n\n${formattedMutants}`,
-              },
+              content: {},
             },
           ],
