[Killed] BlockStatement
src/core/application/get-mutation-summary.use-case.ts:9:52
 export class GetMutationSummaryUseCase {
   constructor(private readonly reportStream: ReportStream) {}
 
-  public execute(): Result<MutationSummary, Error> {
-    const report = this.reportStream.current();
-    if (!report) {
-      return err(new Error("Kein Mutation-Testing-Report verfügbar."));
-    }
-
-    const summary = calculateMutationSummary(report);
-    return ok(summary);
-  }
+  public execute(): Result<MutationSummary, Error> {}
 }
 
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/core/application/get-mutation-summary.use-case.ts:11:9
 
   public execute(): Result<MutationSummary, Error> {
     const report = this.reportStream.current();
-    if (!report) {
+    if (report) {
       return err(new Error("Kein Mutation-Testing-Report verfügbar."));
     }
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected '{"error":"Kein Mutation-Testing-Repor…' to contain 'mutationScore'

[Killed] ConditionalExpression
src/core/application/get-mutation-summary.use-case.ts:11:9
 
   public execute(): Result<MutationSummary, Error> {
     const report = this.reportStream.current();
-    if (!report) {
+    if (true) {
       return err(new Error("Kein Mutation-Testing-Report verfügbar."));
     }
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected '{"error":"Kein Mutation-Testing-Repor…' to contain 'mutationScore'
