[Killed] BlockStatement
src/core/application/get-survived-mutants.use-case.ts:9:74
 export class GetSurvivedMutantsUseCase {
   constructor(private readonly reportStream: ReportStream) {}
 
-  public execute(filePathFilter?: string): Result<MutantDetail[], Error> {
-    const report = this.reportStream.current();
-    if (!report) {
-      return err(new Error("Kein Mutation-Testing-Report verfügbar."));
-    }
-
-    const survived = extractSurvivedMutants(report, filePathFilter);
-    return ok(survived);
-  }
+  public execute(filePathFilter?: string): Result<MutantDetail[], Error> {}
 }
 
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: Cannot read properties of undefined (reading 'isOk')
