[Killed] BlockStatement
src/core/application/predict-mutation-impact.use-case.ts:10:62
 }
 
 export class PredictMutationImpactUseCase {
-  public execute(changedFiles: string[]): FileMutationRisk[] {
-    return changedFiles.map((file) => {
-      let riskLevel: "HIGH" | "MEDIUM" | "LOW" = "LOW";
-      let estimatedMutantCount = 5;
-      let reason = "Routine file change.";
-
-      if (file.includes("use-case") || file.includes("domain") || file.includes("adapter")) {
-        riskLevel = "HIGH";
-        estimatedMutantCount = 25;
-        reason = "Core business or adapter logic contains complex branching and assertions.";
-      } else if (file.includes("config") || file.includes("util") || file.includes("helper")) {
-        riskLevel = "MEDIUM";
-        estimatedMutantCount = 12;
-        reason = "Utility functions and configurations require boundary condition assertions.";
-      }
-
-      return {
-        filePath: file,
-        riskLevel,
-        estimatedMutantCount,
-        reason,
-      };
-    });
-  }
+  public execute(changedFiles: string[]): FileMutationRisk[] {}
 }
 
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/core/application/predict-mutation-impact.use-case.ts:11:39
 
 export class PredictMutationImpactUseCase {
   public execute(changedFiles: string[]): FileMutationRisk[] {
-    return changedFiles.map((file) => {
-      let riskLevel: "HIGH" | "MEDIUM" | "LOW" = "LOW";
-      let estimatedMutantCount = 5;
-      let reason = "Routine file change.";
-
-      if (file.includes("use-case") || file.includes("domain") || file.includes("adapter")) {
-        riskLevel = "HIGH";
-        estimatedMutantCount = 25;
-        reason = "Core business or adapter logic contains complex branching and assertions.";
-      } else if (file.includes("config") || file.includes("util") || file.includes("helper")) {
-        riskLevel = "MEDIUM";
-        estimatedMutantCount = 12;
-        reason = "Utility functions and configurations require boundary condition assertions.";
-      }
-
-      return {
-        filePath: file,
-        riskLevel,
-        estimatedMutantCount,
-        reason,
-      };
-    });
+    return changedFiles.map((file) => {});
   }
 }
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: expected '[\n  null\n]' to contain 'HIGH'

[Killed] BlockStatement
src/core/application/predict-mutation-impact.use-case.ts:16:93
       let estimatedMutantCount = 5;
       let reason = "Routine file change.";
 
-      if (file.includes("use-case") || file.includes("domain") || file.includes("adapter")) {
-        riskLevel = "HIGH";
-        estimatedMutantCount = 25;
-        reason = "Core business or adapter logic contains complex branching and assertions.";
-      } else if (file.includes("config") || file.includes("util") || file.includes("helper")) {
+      if (file.includes("use-case") || file.includes("domain") || file.includes("adapter")) {} else if (file.includes("config") || file.includes("util") || file.includes("helper")) {
         riskLevel = "MEDIUM";
         estimatedMutantCount = 12;
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: expected '[\n  {\n    "filePath": "src/core/dom…' to contain 'HIGH'

[Killed] LogicalOperator
src/core/application/predict-mutation-impact.use-case.ts:16:11
       let estimatedMutantCount = 5;
       let reason = "Routine file change.";
 
-      if (file.includes("use-case") || file.includes("domain") || file.includes("adapter")) {
+      if ((file.includes("use-case") || file.includes("domain")) && file.includes("adapter")) {
         riskLevel = "HIGH";
         estimatedMutantCount = 25;
killedBy: McpServerAdapter sollte MCP-Tools registrieren und ausführen
statusReason: expected '[\n  {\n    "filePath": "src/core/dom…' to contain 'HIGH'

[Killed] BlockStatement
src/core/application/predict-mutation-impact.use-case.ts:20:95
         riskLevel = "HIGH";
         estimatedMutantCount = 25;
         reason = "Core business or adapter logic contains complex branching and assertions.";
-      } else if (file.includes("config") || file.includes("util") || file.includes("helper")) {
-        riskLevel = "MEDIUM";
-        estimatedMutantCount = 12;
-        reason = "Utility functions and configurations require boundary condition assertions.";
-      }
+      } else if (file.includes("config") || file.includes("util") || file.includes("helper")) {}
 
       return {
killedBy: PredictMutationImpactUseCase should categorize helper and config files as MEDIUM risk
statusReason: expected 'LOW' to be 'MEDIUM' // Object.is equality

[Killed] ConditionalExpression
src/core/application/predict-mutation-impact.use-case.ts:20:18
         riskLevel = "HIGH";
         estimatedMutantCount = 25;
         reason = "Core business or adapter logic contains complex branching and assertions.";
-      } else if (file.includes("config") || file.includes("util") || file.includes("helper")) {
+      } else if (true) {
         riskLevel = "MEDIUM";
         estimatedMutantCount = 12;
killedBy: PredictMutationImpactUseCase should categorize generic files as LOW risk
statusReason: expected 'MEDIUM' to be 'LOW' // Object.is equality
