[Killed] BlockStatement
src/core/application/publish-report.use-case.ts:14:70
    * Nimmt den rohen Report von Stryker entgegen, validiert ihn
    * und publiziert ihn typsicher in den Stream.
    */
-  public execute(rawReport: MutationTestResult): Result<void, Error> {
-    if (!rawReport || typeof rawReport !== "object") {
-      return err(new Error("Invalid raw report provided by Stryker."));
-    }
-
-    const domainReport = this.mapToDomain(rawReport);
-
-    return this.reportStream.publish(domainReport);
-  }
+  public execute(rawReport: MutationTestResult): Result<void, Error> {}
 
   /**
killedBy: PublishReportUseCase sollte einen validen Stryker-Report in die Domain mappen und publizieren
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/core/application/publish-report.use-case.ts:15:23
    * und publiziert ihn typsicher in den Stream.
    */
   public execute(rawReport: MutationTestResult): Result<void, Error> {
-    if (!rawReport || typeof rawReport !== "object") {
+    if (!rawReport || false) {
       return err(new Error("Invalid raw report provided by Stryker."));
     }
killedBy: PublishReportUseCase sollte mit einem expliziten Error-Result fehlschlagen, wenn der rohe Report kein Objekt ist (z.B. primitiver Typ)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/application/publish-report.use-case.ts:15:23
    * und publiziert ihn typsicher in den Stream.
    */
   public execute(rawReport: MutationTestResult): Result<void, Error> {
-    if (!rawReport || typeof rawReport !== "object") {
+    if (!rawReport || typeof rawReport === "object") {
       return err(new Error("Invalid raw report provided by Stryker."));
     }
killedBy: PublishReportUseCase sollte einen validen Stryker-Report in die Domain mappen und publizieren
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/publish-report.use-case.ts:28:70
    * Wandelt die externe Struktur in unsere interne Domain-Struktur um.
    * Schützt die Domain vor unerwarteten API-Änderungen.
    */
-  private mapToDomain(rawReport: MutationTestResult): MutationReport {
-    return {
-      schemaVersion: rawReport.schemaVersion,
-      thresholds: rawReport.thresholds,
-      projectRoot: rawReport.projectRoot,
-      files: (rawReport.files || {}) as MutationReport["files"],
-    };
-  }
+  private mapToDomain(rawReport: MutationTestResult): MutationReport {}
 }
 
killedBy: PublishReportUseCase sollte einen validen Stryker-Report in die Domain mappen und publizieren
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/core/application/publish-report.use-case.ts:29:12
    * Schützt die Domain vor unerwarteten API-Änderungen.
    */
   private mapToDomain(rawReport: MutationTestResult): MutationReport {
-    return {
-      schemaVersion: rawReport.schemaVersion,
-      thresholds: rawReport.thresholds,
-      projectRoot: rawReport.projectRoot,
-      files: (rawReport.files || {}) as MutationReport["files"],
-    };
+    return {};
   }
 }
killedBy: PublishReportUseCase sollte einen validen Stryker-Report in die Domain mappen und publizieren
statusReason: expected undefined to deeply equal { …(1) }
