[Killed] ConditionalExpression
src/core/application/run-mutation-tests.use-case.ts:22:9
     options?: StrykerRunOptions,
   ): Promise<Result<MutationReport, Error>> {
     const currentStatus = this.statusStream.current();
-    if (currentStatus.state === "running") {
+    if (false) {
       return err(new Error("Ein Mutationstest-Lauf ist bereits aktiv."));
     }
killedBy: RunMutationTestsUseCase verhindert parallele Läufe, wenn bereits ein Lauf aktiv ist
statusReason: expected 'Cannot read properties of undefined (…' to be 'Ein Mutationstest-Lauf ist bereits ak…' // Object.is equality

[Killed] ConditionalExpression
src/core/application/run-mutation-tests.use-case.ts:22:9
     options?: StrykerRunOptions,
   ): Promise<Result<MutationReport, Error>> {
     const currentStatus = this.statusStream.current();
-    if (currentStatus.state === "running") {
+    if (true) {
       return err(new Error("Ein Mutationstest-Lauf ist bereits aktiv."));
     }
killedBy: RunMutationTestsUseCase führt Mutationstests erfolgreich aus, aktualisiert Status, publiziert Report und benachrichtigt Desktop
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/run-mutation-tests.use-case.ts:30:9
     this.statusStream.setRunning(startMsg, 0);
     await this.notificationService.notifyStatus(startMsg);
 
-    try {
-      const runResult = await this.strykerRunner.run(options);
-
-      if (!runResult.isOk) {
-        this.statusStream.setFailed(runResult.error.message);
-        await this.notificationService.notifyError(runResult.error.message);
-        return err(runResult.error);
-      }
-
-      const report = runResult.value;
-      this.reportStream.publish(report);
-      this.statusStream.setCompleted("Mutationstests erfolgreich beendet.");
-
-      const summary = calculateMutationSummary(report);
-      await this.notificationService.notifyCompletion(
-        summary.mutationScore,
-        summary.killed,
-        summary.survived,
-      );
-
-      return ok(report);
-    } catch (error) {
+    try {} catch (error) {
       const errorMessage = error instanceof Error ? error.message : String(error);
       this.statusStream.setFailed(errorMessage);
killedBy: RunMutationTestsUseCase führt Mutationstests erfolgreich aus, aktualisiert Status, publiziert Report und benachrichtigt Desktop
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/core/application/run-mutation-tests.use-case.ts:33:28
     try {
       const runResult = await this.strykerRunner.run(options);
 
-      if (!runResult.isOk) {
-        this.statusStream.setFailed(runResult.error.message);
-        await this.notificationService.notifyError(runResult.error.message);
-        return err(runResult.error);
-      }
+      if (!runResult.isOk) {}
 
       const report = runResult.value;
killedBy: RunMutationTestsUseCase setzt den Status auf 'failed', gibt ein err-Result zurück und benachrichtigt Desktop bei Fehler
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/core/application/run-mutation-tests.use-case.ts:51:21
       );
 
       return ok(report);
-    } catch (error) {
-      const errorMessage = error instanceof Error ? error.message : String(error);
-      this.statusStream.setFailed(errorMessage);
-      await this.notificationService.notifyError(errorMessage);
-      return err(new Error(errorMessage));
-    }
+    } catch (error) {}
   }
 }
killedBy: RunMutationTestsUseCase fängt unerwartete Exceptions in der Ausführung ab und benachrichtigt Desktop
statusReason: Cannot read properties of undefined (reading 'isOk')
