[Killed] BlockStatement
src/core/application/run-targeted-mutation-tests.use-case.ts:24:103
     private readonly runMutationTestsUseCase: RunMutationTestsUseCase,
   ) {}
 
-  public async execute(options?: string | TargetedRunOptions): Promise<Result<MutationReport, Error>> {
-    let changedFiles: string[] = [];
-
-    if (typeof options === "string") {
-      changedFiles = await this.gitService.getChangedFiles(options);
-    } else if (options?.commitSha) {
-      changedFiles = await this.gitService.getChangedFilesForCommit(options.commitSha);
-    } else if (options?.fromRevision && options?.toRevision) {
-      changedFiles = await this.gitService.getChangedFilesBetween(options.fromRevision, options.toRevision);
-    } else {
-      changedFiles = await this.gitService.getChangedFiles(options?.revision);
-    }
-
-    if (!changedFiles || changedFiles.length === 0) {
-      return err(
-        new Error("Keine geänderten TypeScript-Dateien für zielgerichteten Lauf gefunden."),
-      );
-    }
-
-    return this.runMutationTestsUseCase.execute({ mutate: changedFiles });
-  }
+  public async execute(options?: string | TargetedRunOptions): Promise<Result<MutationReport, Error>> {}
 }
 
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für einen einzelnen Commit und führt Mutationstests dafür aus
statusReason: Cannot read properties of undefined (reading 'isOk')

[Survived] ArrayDeclaration
src/core/application/run-targeted-mutation-tests.use-case.ts:25:34
   ) {}
 
   public async execute(options?: string | TargetedRunOptions): Promise<Result<MutationReport, Error>> {
-    let changedFiles: string[] = [];
+    let changedFiles: string[] = ["Stryker was here"];
 
     if (typeof options === "string") {

[Killed] ConditionalExpression
src/core/application/run-targeted-mutation-tests.use-case.ts:27:9
   public async execute(options?: string | TargetedRunOptions): Promise<Result<MutationReport, Error>> {
     let changedFiles: string[] = [];
 
-    if (typeof options === "string") {
+    if (false) {
       changedFiles = await this.gitService.getChangedFiles(options);
     } else if (options?.commitSha) {
killedBy: RunTargetedMutationTestsUseCase unterstützt String-Argument als Rückwärtskompatibilität für baseBranch
statusReason: expected "spy" to be called with arguments: [ 'main' ]

Received: 

  1st spy call:

  Array [
-   "main",

[Killed] ConditionalExpression
src/core/application/run-targeted-mutation-tests.use-case.ts:27:9
   public async execute(options?: string | TargetedRunOptions): Promise<Result<MutationReport, Error>> {
     let changedFiles: string[] = [];
 
-    if (typeof options === "string") {
+    if (true) {
       changedFiles = await this.gitService.getChangedFiles(options);
     } else if (options?.commitSha) {
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für einen einzelnen Commit und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/run-targeted-mutation-tests.use-case.ts:29:36
 
     if (typeof options === "string") {
       changedFiles = await this.gitService.getChangedFiles(options);
-    } else if (options?.commitSha) {
-      changedFiles = await this.gitService.getChangedFilesForCommit(options.commitSha);
-    } else if (options?.fromRevision && options?.toRevision) {
+    } else if (options?.commitSha) {} else if (options?.fromRevision && options?.toRevision) {
       changedFiles = await this.gitService.getChangedFilesBetween(options.fromRevision, options.toRevision);
     } else {
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für einen einzelnen Commit und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/run-targeted-mutation-tests.use-case.ts:29:16
 
     if (typeof options === "string") {
       changedFiles = await this.gitService.getChangedFiles(options);
-    } else if (options?.commitSha) {
+    } else if (true) {
       changedFiles = await this.gitService.getChangedFilesForCommit(options.commitSha);
     } else if (options?.fromRevision && options?.toRevision) {
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für eine Commit-Range (from/to) und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/application/run-targeted-mutation-tests.use-case.ts:31:16
       changedFiles = await this.gitService.getChangedFiles(options);
     } else if (options?.commitSha) {
       changedFiles = await this.gitService.getChangedFilesForCommit(options.commitSha);
-    } else if (options?.fromRevision && options?.toRevision) {
+    } else if (options?.fromRevision || options?.toRevision) {
       changedFiles = await this.gitService.getChangedFilesBetween(options.fromRevision, options.toRevision);
     } else {
killedBy: RunTargetedMutationTestsUseCase fällt auf getChangedFiles zurück wenn nur fromRevision ohne toRevision angegeben wird
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/run-targeted-mutation-tests.use-case.ts:31:62
       changedFiles = await this.gitService.getChangedFiles(options);
     } else if (options?.commitSha) {
       changedFiles = await this.gitService.getChangedFilesForCommit(options.commitSha);
-    } else if (options?.fromRevision && options?.toRevision) {
-      changedFiles = await this.gitService.getChangedFilesBetween(options.fromRevision, options.toRevision);
-    } else {
+    } else if (options?.fromRevision && options?.toRevision) {} else {
       changedFiles = await this.gitService.getChangedFiles(options?.revision);
     }
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für eine Commit-Range (from/to) und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/run-targeted-mutation-tests.use-case.ts:33:12
       changedFiles = await this.gitService.getChangedFilesForCommit(options.commitSha);
     } else if (options?.fromRevision && options?.toRevision) {
       changedFiles = await this.gitService.getChangedFilesBetween(options.fromRevision, options.toRevision);
-    } else {
-      changedFiles = await this.gitService.getChangedFiles(options?.revision);
-    }
+    } else {}
 
     if (!changedFiles || changedFiles.length === 0) {
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für eine Revision (z.B. HEAD~1 oder main)
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/core/application/run-targeted-mutation-tests.use-case.ts:34:60
     } else if (options?.fromRevision && options?.toRevision) {
       changedFiles = await this.gitService.getChangedFilesBetween(options.fromRevision, options.toRevision);
     } else {
-      changedFiles = await this.gitService.getChangedFiles(options?.revision);
+      changedFiles = await this.gitService.getChangedFiles(options.revision);
     }
 
killedBy: RunTargetedMutationTestsUseCase gibt ein err-Result zurück, wenn getChangedFiles null zurückgibt
statusReason: Cannot read properties of undefined (reading 'revision')

[Killed] BooleanLiteral
src/core/application/run-targeted-mutation-tests.use-case.ts:37:9
       changedFiles = await this.gitService.getChangedFiles(options?.revision);
     }
 
-    if (!changedFiles || changedFiles.length === 0) {
+    if (changedFiles || changedFiles.length === 0) {
       return err(
         new Error("Keine geänderten TypeScript-Dateien für zielgerichteten Lauf gefunden."),
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für einen einzelnen Commit und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/run-targeted-mutation-tests.use-case.ts:37:53
       changedFiles = await this.gitService.getChangedFiles(options?.revision);
     }
 
-    if (!changedFiles || changedFiles.length === 0) {
-      return err(
-        new Error("Keine geänderten TypeScript-Dateien für zielgerichteten Lauf gefunden."),
-      );
-    }
+    if (!changedFiles || changedFiles.length === 0) {}
 
     return this.runMutationTestsUseCase.execute({ mutate: changedFiles });
killedBy: RunTargetedMutationTestsUseCase gibt ein err-Result zurück, wenn getChangedFiles null zurückgibt
statusReason: Cannot read properties of undefined (reading 'isOk')
