[Killed] BlockStatement
src/core/domain/execution-status.ts:21:17
 export class ExecutionStatusStream {
   private readonly subject: BehaviorSubject<ExecutionState>;
 
-  constructor() {
-    this.subject = new BehaviorSubject<ExecutionState>({
-      state: "idle",
-      error: null,
-    });
-  }
+  constructor() {}
 
   public current(): ExecutionState {
killedBy: RunMutationTestsUseCase führt Mutationstests erfolgreich aus, aktualisiert Status, publiziert Report und benachrichtigt Desktop
statusReason: Cannot read properties of undefined (reading 'getValue')

[Killed] BlockStatement
src/core/domain/execution-status.ts:28:36
     });
   }
 
-  public current(): ExecutionState {
-    return this.subject.getValue();
-  }
+  public current(): ExecutionState {}
 
   public asObservable(): Observable<ExecutionState> {
killedBy: RunMutationTestsUseCase führt Mutationstests erfolgreich aus, aktualisiert Status, publiziert Report und benachrichtigt Desktop
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] BlockStatement
src/core/domain/execution-status.ts:32:53
     return this.subject.getValue();
   }
 
-  public asObservable(): Observable<ExecutionState> {
-    return this.subject.asObservable();
-  }
+  public asObservable(): Observable<ExecutionState> {}
 
   public setIdle(): void {
killedBy: ExecutionStatusStream Domain Model benachrichtigt Abonnenten reaktiv über Änderungen
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/core/domain/execution-status.ts:36:26
     return this.subject.asObservable();
   }
 
-  public setIdle(): void {
-    this.subject.next({
-      state: "idle",
-      error: null,
-      lastRunTime: this.current().lastRunTime,
-    });
-  }
+  public setIdle(): void {}
 
   public setRunning(message?: string, percentage?: number): void {
killedBy: ExecutionStatusStream Domain Model setzt den Status zurück auf 'idle' und behält den letzten Laufzeitstempel bei
statusReason: expected 'completed' to be 'idle' // Object.is equality

[Killed] BlockStatement
src/core/domain/execution-status.ts:44:66
     });
   }
 
-  public setRunning(message?: string, percentage?: number): void {
-    this.subject.next({
-      state: "running",
-      progress: { message, percentage },
-      error: null,
-      lastRunTime: this.current().lastRunTime,
-    });
-  }
+  public setRunning(message?: string, percentage?: number): void {}
 
   public setCompleted(message?: string): void {
killedBy: RunMutationTestsUseCase verhindert parallele Läufe, wenn bereits ein Lauf aktiv ist
statusReason: expected 'Cannot read properties of undefined (…' to be 'Ein Mutationstest-Lauf ist bereits ak…' // Object.is equality

[Killed] ObjectLiteral
src/core/domain/execution-status.ts:45:23
   }
 
   public setRunning(message?: string, percentage?: number): void {
-    this.subject.next({
-      state: "running",
-      progress: { message, percentage },
-      error: null,
-      lastRunTime: this.current().lastRunTime,
-    });
+    this.subject.next({});
   }
 
killedBy: RunMutationTestsUseCase verhindert parallele Läufe, wenn bereits ein Lauf aktiv ist
statusReason: expected 'Cannot read properties of undefined (…' to be 'Ein Mutationstest-Lauf ist bereits ak…' // Object.is equality

[Killed] BlockStatement
src/core/domain/execution-status.ts:53:47
     });
   }
 
-  public setCompleted(message?: string): void {
-    this.subject.next({
-      state: "completed",
-      progress: { percentage: 100, message },
-      lastRunTime: new Date().toISOString(),
-      error: null,
-    });
-  }
+  public setCompleted(message?: string): void {}
 
   public setFailed(errorMessage: string): void {
killedBy: RunMutationTestsUseCase führt Mutationstests erfolgreich aus, aktualisiert Status, publiziert Report und benachrichtigt Desktop
statusReason: expected 'running' to be 'completed' // Object.is equality

[Killed] ObjectLiteral
src/core/domain/execution-status.ts:56:17
   public setCompleted(message?: string): void {
     this.subject.next({
       state: "completed",
-      progress: { percentage: 100, message },
+      progress: {},
       lastRunTime: new Date().toISOString(),
       error: null,
killedBy: ExecutionStatusStream Domain Model aktualisiert den Status auf 'completed'
statusReason: expected undefined to be 'Lauf erfolgreich beendet' // Object.is equality

[Killed] BlockStatement
src/core/domain/execution-status.ts:62:48
     });
   }
 
-  public setFailed(errorMessage: string): void {
-    this.subject.next({
-      state: "failed",
-      error: errorMessage,
-      lastRunTime: new Date().toISOString(),
-    });
-  }
+  public setFailed(errorMessage: string): void {}
 }
 
killedBy: RunMutationTestsUseCase setzt den Status auf 'failed', gibt ein err-Result zurück und benachrichtigt Desktop bei Fehler
statusReason: expected 'running' to be 'failed' // Object.is equality
