[Killed] BlockStatement
src/core/domain/mutation-insight.ts:103:74
   commitHash?: string;
 }
 
-export function mapMutatorCategory(mutatorName: string): MutatorCategory {
-  const name = mutatorName.toLowerCase();
-  if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
-  if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
-  if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
-  if (name.includes("string") || name.includes("literal")) return "String & Literals";
-  if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
-  if (name.includes("block") || name.includes("statement")) return "Block & Structure";
-  if (name.includes("array") || name.includes("collection")) return "Array & Collection";
-  if (name.includes("async") || name.includes("promise") || name.includes("await")) return "Async & Promises";
-  return "Unknown Category";
-}
+export function mapMutatorCategory(mutatorName: string): MutatorCategory {}
 
 export function mapFileCategory(filePath: string): FileCategory {
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected undefined to be 'Arithmetic & Math' // Object.is equality

[Killed] MethodExpression
src/core/domain/mutation-insight.ts:104:16
 }
 
 export function mapMutatorCategory(mutatorName: string): MutatorCategory {
-  const name = mutatorName.toLowerCase();
+  const name = mutatorName.toUpperCase();
   if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Arithmetic & Math' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:105:7
 
 export function mapMutatorCategory(mutatorName: string): MutatorCategory {
   const name = mutatorName.toLowerCase();
-  if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
+  if (true) return "Arithmetic & Math";
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Arithmetic & Math' to be 'Equality & Logic' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:105:7
 
 export function mapMutatorCategory(mutatorName: string): MutatorCategory {
   const name = mutatorName.toLowerCase();
-  if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
+  if (false) return "Arithmetic & Math";
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Arithmetic & Math' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:106:7
 export function mapMutatorCategory(mutatorName: string): MutatorCategory {
   const name = mutatorName.toLowerCase();
   if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
-  if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
+  if (true) return "Equality & Logic";
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Equality & Logic' to be 'Control Flow & Conditionals' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:106:7
 export function mapMutatorCategory(mutatorName: string): MutatorCategory {
   const name = mutatorName.toLowerCase();
   if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
-  if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
+  if ((name.includes("equality") || name.includes("logical")) && name.includes("boolean")) return "Equality & Logic";
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Equality & Logic' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:107:7
   const name = mutatorName.toLowerCase();
   if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
-  if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
+  if (false || name.includes("switch")) return "Control Flow & Conditionals";
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Control Flow & Conditionals' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:107:7
   const name = mutatorName.toLowerCase();
   if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
-  if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
+  if (false) return "Control Flow & Conditionals";
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Control Flow & Conditionals' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:108:7
   if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
-  if (name.includes("string") || name.includes("literal")) return "String & Literals";
+  if (false) return "String & Literals";
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'String & Literals' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:108:7
   if (name.includes("arithmetic") || name.includes("math")) return "Arithmetic & Math";
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
-  if (name.includes("string") || name.includes("literal")) return "String & Literals";
+  if (name.includes("string") && name.includes("literal")) return "String & Literals";
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'String & Literals' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:109:7
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
-  if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
+  if (name.includes("exception") && name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
   if (name.includes("array") || name.includes("collection")) return "Array & Collection";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Exception & Error Handling' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:109:7
   if (name.includes("equality") || name.includes("logical") || name.includes("boolean")) return "Equality & Logic";
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
-  if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
+  if ((name.includes("exception") || name.includes("throw")) && name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
   if (name.includes("array") || name.includes("collection")) return "Array & Collection";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Exception & Error Handling' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:110:7
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
-  if (name.includes("block") || name.includes("statement")) return "Block & Structure";
+  if (false) return "Block & Structure";
   if (name.includes("array") || name.includes("collection")) return "Array & Collection";
   if (name.includes("async") || name.includes("promise") || name.includes("await")) return "Async & Promises";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Block & Structure' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:110:7
   if (name.includes("conditional") || name.includes("if") || name.includes("switch")) return "Control Flow & Conditionals";
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
-  if (name.includes("block") || name.includes("statement")) return "Block & Structure";
+  if (true) return "Block & Structure";
   if (name.includes("array") || name.includes("collection")) return "Array & Collection";
   if (name.includes("async") || name.includes("promise") || name.includes("await")) return "Async & Promises";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Block & Structure' to be 'Array & Collection' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:111:7
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
-  if (name.includes("array") || name.includes("collection")) return "Array & Collection";
+  if (true) return "Array & Collection";
   if (name.includes("async") || name.includes("promise") || name.includes("await")) return "Async & Promises";
   return "Unknown Category";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Array & Collection' to be 'Async & Promises' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:111:7
   if (name.includes("string") || name.includes("literal")) return "String & Literals";
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
-  if (name.includes("array") || name.includes("collection")) return "Array & Collection";
+  if (false) return "Array & Collection";
   if (name.includes("async") || name.includes("promise") || name.includes("await")) return "Async & Promises";
   return "Unknown Category";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Array & Collection' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:112:7
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
   if (name.includes("array") || name.includes("collection")) return "Array & Collection";
-  if (name.includes("async") || name.includes("promise") || name.includes("await")) return "Async & Promises";
+  if (true) return "Async & Promises";
   return "Unknown Category";
 }
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Async & Promises' to be 'Unknown Category' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:112:7
   if (name.includes("exception") || name.includes("throw") || name.includes("catch")) return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement")) return "Block & Structure";
   if (name.includes("array") || name.includes("collection")) return "Array & Collection";
-  if (name.includes("async") || name.includes("promise") || name.includes("await")) return "Async & Promises";
+  if (false || name.includes("await")) return "Async & Promises";
   return "Unknown Category";
 }
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Async & Promises' // Object.is equality

[Killed] BlockStatement
src/core/domain/mutation-insight.ts:116:65
   return "Unknown Category";
 }
 
-export function mapFileCategory(filePath: string): FileCategory {
-  const path = filePath.toLowerCase().replace(/\\/g, "/");
-  if (path.includes("/domain/")) return "Domain";
-  if (path.includes("/application/") || path.includes("use-case")) return "Application";
-  if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
-  if (path.includes("/ui/") || path.includes("/components/")) return "UI";
-  if (path.includes("/util") || path.includes("/helper")) return "Utility";
-  return "Unknown";
-}
+export function mapFileCategory(filePath: string): FileCategory {}
 
 export function buildMutationInsightEntity(input: RawMutantInsightInput): MutationInsightEntity {
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected undefined to be 'Domain' // Object.is equality

[Killed] MethodExpression
src/core/domain/mutation-insight.ts:117:16
 }
 
 export function mapFileCategory(filePath: string): FileCategory {
-  const path = filePath.toLowerCase().replace(/\\/g, "/");
+  const path = filePath.toUpperCase().replace(/\\/g, "/");
   if (path.includes("/domain/")) return "Domain";
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Domain' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:118:7
 
 export function mapFileCategory(filePath: string): FileCategory {
   const path = filePath.toLowerCase().replace(/\\/g, "/");
-  if (path.includes("/domain/")) return "Domain";
+  if (false) return "Domain";
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Domain' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:118:7
 
 export function mapFileCategory(filePath: string): FileCategory {
   const path = filePath.toLowerCase().replace(/\\/g, "/");
-  if (path.includes("/domain/")) return "Domain";
+  if (true) return "Domain";
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Domain' to be 'Application' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:119:7
 export function mapFileCategory(filePath: string): FileCategory {
   const path = filePath.toLowerCase().replace(/\\/g, "/");
   if (path.includes("/domain/")) return "Domain";
-  if (path.includes("/application/") || path.includes("use-case")) return "Application";
+  if (path.includes("/application/") && path.includes("use-case")) return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Application' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:119:7
 export function mapFileCategory(filePath: string): FileCategory {
   const path = filePath.toLowerCase().replace(/\\/g, "/");
   if (path.includes("/domain/")) return "Domain";
-  if (path.includes("/application/") || path.includes("use-case")) return "Application";
+  if (false) return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Application' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:120:7
   const path = filePath.toLowerCase().replace(/\\/g, "/");
   if (path.includes("/domain/")) return "Domain";
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
-  if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
+  if (true) return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
   if (path.includes("/util") || path.includes("/helper")) return "Utility";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Infrastructure' to be 'UI' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:120:7
   const path = filePath.toLowerCase().replace(/\\/g, "/");
   if (path.includes("/domain/")) return "Domain";
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
-  if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
+  if (path.includes("/infrastructure/") && path.includes("adapter")) return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
   if (path.includes("/util") || path.includes("/helper")) return "Utility";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Infrastructure' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:121:7
   if (path.includes("/domain/")) return "Domain";
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
-  if (path.includes("/ui/") || path.includes("/components/")) return "UI";
+  if (false) return "UI";
   if (path.includes("/util") || path.includes("/helper")) return "Utility";
   return "Unknown";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'UI' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:121:7
   if (path.includes("/domain/")) return "Domain";
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
-  if (path.includes("/ui/") || path.includes("/components/")) return "UI";
+  if (path.includes("/ui/") && path.includes("/components/")) return "UI";
   if (path.includes("/util") || path.includes("/helper")) return "Utility";
   return "Unknown";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'UI' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:122:7
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
-  if (path.includes("/util") || path.includes("/helper")) return "Utility";
+  if (false) return "Utility";
   return "Unknown";
 }
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Utility' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:122:7
   if (path.includes("/application/") || path.includes("use-case")) return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter")) return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
-  if (path.includes("/util") || path.includes("/helper")) return "Utility";
+  if (true) return "Utility";
   return "Unknown";
 }
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Utility' to be 'Unknown' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:132:5
   const testsRan = Array.isArray(input.testsRan) ? input.testsRan : [];
 
   const coverageState: TestCoverageState =
-    input.status === "NoCoverage" || testsRan.length === 0
+    true
       ? "NoTests"
       : "TestsRanButFailedToAssert";
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected 'NoTests' to be 'TestsRanButFailedToAssert' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:132:5
   const testsRan = Array.isArray(input.testsRan) ? input.testsRan : [];
 
   const coverageState: TestCoverageState =
-    input.status === "NoCoverage" || testsRan.length === 0
+    false
       ? "NoTests"
       : "TestsRanButFailedToAssert";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected 'TestsRanButFailedToAssert' to be 'NoTests' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:137:5
       : "TestsRanButFailedToAssert";
 
   const flawCategory =
-    coverageState === "NoTests"
+    true
       ? "Uncovered Execution Path"
       : "OverMocking / Weak Assertions";
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected 'Uncovered Execution Path' to be 'OverMocking / Weak Assertions' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:137:5
       : "TestsRanButFailedToAssert";
 
   const flawCategory =
-    coverageState === "NoTests"
+    false
       ? "Uncovered Execution Path"
       : "OverMocking / Weak Assertions";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected 'OverMocking / Weak Assertions' to be 'Uncovered Execution Path' // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-insight.ts:144:7
   let severity: SeverityLevel = "Medium";
   let riskScore = 50;
 
-  if (input.status === "NoCoverage") {
+  if (input.status !== "NoCoverage") {
     severity = "High";
     riskScore = 85;
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected 'High' to be 'Critical' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:144:7
   let severity: SeverityLevel = "Medium";
   let riskScore = 50;
 
-  if (input.status === "NoCoverage") {
+  if (true) {
     severity = "High";
     riskScore = 85;
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected 'High' to be 'Critical' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:147:14
   if (input.status === "NoCoverage") {
     severity = "High";
     riskScore = 85;
-  } else if (fileCategory === "Domain" && input.status === "Survived") {
+  } else if (false) {
     severity = "Critical";
     riskScore = 95;
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected 'Medium' to be 'Critical' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:147:14
   if (input.status === "NoCoverage") {
     severity = "High";
     riskScore = 85;
-  } else if (fileCategory === "Domain" && input.status === "Survived") {
+  } else if (fileCategory === "Domain" || input.status === "Survived") {
     severity = "Critical";
     riskScore = 95;
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected 'Critical' to be 'Medium' // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-insight.ts:150:14
   } else if (fileCategory === "Domain" && input.status === "Survived") {
     severity = "Critical";
     riskScore = 95;
-  } else if (mutatorCategory === "Exception & Error Handling") {
+  } else if (mutatorCategory !== "Exception & Error Handling") {
     severity = "High";
     riskScore = 80;
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected 'High' to be 'Medium' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:150:14
   } else if (fileCategory === "Domain" && input.status === "Survived") {
     severity = "Critical";
     riskScore = 95;
-  } else if (mutatorCategory === "Exception & Error Handling") {
+  } else if (true) {
     severity = "High";
     riskScore = 80;
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected 'High' to be 'Medium' // Object.is equality
