[Killed] EqualityOperator
src/core/domain/mutation-insight.ts:156:24
   }
 
   const primarySkillGap = `${mutatorCategory} Assertions`;
-  const originalCode = input.sourceCodeSnippet !== undefined && input.sourceCodeSnippet !== ""
+  const originalCode = input.sourceCodeSnippet === undefined && input.sourceCodeSnippet !== ""
     ? input.sourceCodeSnippet
     : "// Quellcode-Zeile nicht direkt verfügbar";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected undefined to be '// Quellcode-Zeile nicht direkt verfü…' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:156:24
   }
 
   const primarySkillGap = `${mutatorCategory} Assertions`;
-  const originalCode = input.sourceCodeSnippet !== undefined && input.sourceCodeSnippet !== ""
+  const originalCode = input.sourceCodeSnippet !== undefined || input.sourceCodeSnippet !== ""
     ? input.sourceCodeSnippet
     : "// Quellcode-Zeile nicht direkt verfügbar";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected undefined to be '// Quellcode-Zeile nicht direkt verfü…' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:161:22
     : "// Quellcode-Zeile nicht direkt verfügbar";
   const diff = `- ${originalCode}\n+ ${originalCode} [Mutated: ${input.replacement}]`;
 
-  const authorName = input.authorName !== undefined && input.authorName !== "" ? input.authorName : "Unknown";
+  const authorName = true && input.authorName !== "" ? input.authorName : "Unknown";
   const authorEmail = input.authorEmail !== undefined && input.authorEmail !== "" ? input.authorEmail : "unknown@example.com";
 
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Unknown <unknown@example.com>'

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:161:22
     : "// Quellcode-Zeile nicht direkt verfügbar";
   const diff = `- ${originalCode}\n+ ${originalCode} [Mutated: ${input.replacement}]`;
 
-  const authorName = input.authorName !== undefined && input.authorName !== "" ? input.authorName : "Unknown";
+  const authorName = true ? input.authorName : "Unknown";
   const authorEmail = input.authorEmail !== undefined && input.authorEmail !== "" ? input.authorEmail : "unknown@example.com";
 
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Unknown <unknown@example.com>'

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:162:23
   const diff = `- ${originalCode}\n+ ${originalCode} [Mutated: ${input.replacement}]`;
 
   const authorName = input.authorName !== undefined && input.authorName !== "" ? input.authorName : "Unknown";
-  const authorEmail = input.authorEmail !== undefined && input.authorEmail !== "" ? input.authorEmail : "unknown@example.com";
+  const authorEmail = true && input.authorEmail !== "" ? input.authorEmail : "unknown@example.com";
 
   const normalizedPath = input.filePath.replace(/\\/g, "/");
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Unknown <unknown@example.com>'

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:162:23
   const diff = `- ${originalCode}\n+ ${originalCode} [Mutated: ${input.replacement}]`;
 
   const authorName = input.authorName !== undefined && input.authorName !== "" ? input.authorName : "Unknown";
-  const authorEmail = input.authorEmail !== undefined && input.authorEmail !== "" ? input.authorEmail : "unknown@example.com";
+  const authorEmail = true ? input.authorEmail : "unknown@example.com";
 
   const normalizedPath = input.filePath.replace(/\\/g, "/");
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Unknown <unknown@example.com>'

[Survived] MethodExpression
src/core/domain/mutation-insight.ts:167:25
   const normalizedPath = input.filePath.replace(/\\/g, "/");
   const moduleName = normalizedPath.includes("/") ? normalizedPath.split("/").pop()! : normalizedPath;
 
-  const embeddingText = `
-[MUTANT INSIGHT RECORD]
-ID: ${input.mutantId}
-File: ${input.filePath} (Layer: ${fileCategory})
-Position: Line ${input.line}, Column ${input.column}
-Mutator: ${input.mutatorName} (Category: ${mutatorCategory})
-Status: ${input.status}
-Replacement: ${input.replacement}
-Original Code: ${originalCode}
-Tests Ran: ${testsRan.join(", ") || "None"}
-Coverage Flaw: ${flawCategory}
-Primary Skill Gap: ${primarySkillGap}
-Severity: ${severity} (Risk Score: ${riskScore})
-Author: ${authorName} <${authorEmail}>
-`.trim();
+  const embeddingText = `
+[MUTANT INSIGHT RECORD]
+ID: ${input.mutantId}
+File: ${input.filePath} (Layer: ${fileCategory})
+Position: Line ${input.line}, Column ${input.column}
+Mutator: ${input.mutatorName} (Category: ${mutatorCategory})
+Status: ${input.status}
+Replacement: ${input.replacement}
+Original Code: ${originalCode}
+Tests Ran: ${testsRan.join(", ") || "None"}
+Coverage Flaw: ${flawCategory}
+Primary Skill Gap: ${primarySkillGap}
+Severity: ${severity} (Risk Score: ${riskScore})
+Author: ${authorName} <${authorEmail}>
+`;
 
   return {

[Survived] ConditionalExpression
src/core/domain/mutation-insight.ts:176:14
 Status: ${input.status}
 Replacement: ${input.replacement}
 Original Code: ${originalCode}
-Tests Ran: ${testsRan.join(", ") || "None"}
+Tests Ran: ${true}
 Coverage Flaw: ${flawCategory}
 Primary Skill Gap: ${primarySkillGap}

[Survived] ConditionalExpression
src/core/domain/mutation-insight.ts:176:14
 Status: ${input.status}
 Replacement: ${input.replacement}
 Original Code: ${originalCode}
-Tests Ran: ${testsRan.join(", ") || "None"}
+Tests Ran: ${false}
 Coverage Flaw: ${flawCategory}
 Primary Skill Gap: ${primarySkillGap}

[Killed] ObjectLiteral
src/core/domain/mutation-insight.ts:185:13
 
   return {
     id: `insight-${input.mutantId}`,
-    mutant: {
-      id: input.mutantId,
-      mutatorName: input.mutatorName,
-      mutatorCategory,
-      replacement: input.replacement,
-      status: input.status,
-    },
+    mutant: {},
     codeContext: {
       filePath: input.filePath,
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected undefined to be 'Arithmetic & Math' // Object.is equality

[Survived] MethodExpression
src/core/domain/mutation-insight.ts:219:9
       severity,
       riskScore,
       learningTopicTags: [
-        mutatorCategory.toLowerCase().replace(/\s+/g, "-"),
+        mutatorCategory.toUpperCase().replace(/\s+/g, "-"),
         input.mutatorName.toLowerCase(),
         fileCategory.toLowerCase(),

[Survived] Regex
src/core/domain/mutation-insight.ts:219:47
       severity,
       riskScore,
       learningTopicTags: [
-        mutatorCategory.toLowerCase().replace(/\s+/g, "-"),
+        mutatorCategory.toLowerCase().replace(/\s/g, "-"),
         input.mutatorName.toLowerCase(),
         fileCategory.toLowerCase(),

[Survived] MethodExpression
src/core/domain/mutation-insight.ts:220:9
       riskScore,
       learningTopicTags: [
         mutatorCategory.toLowerCase().replace(/\s+/g, "-"),
-        input.mutatorName.toLowerCase(),
+        input.mutatorName.toUpperCase(),
         fileCategory.toLowerCase(),
         "tdd-testing",

[Survived] MethodExpression
src/core/domain/mutation-insight.ts:221:9
       learningTopicTags: [
         mutatorCategory.toLowerCase().replace(/\s+/g, "-"),
         input.mutatorName.toLowerCase(),
-        fileCategory.toLowerCase(),
+        fileCategory.toUpperCase(),
         "tdd-testing",
       ],
