[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:85:7
     mutationScore: 100,
   };
 
-  if (!report || !report.files) {
+  if (true) {
     return summary;
   }
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 8 // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:85:7
     mutationScore: 100,
   };
 
-  if (!report || !report.files) {
+  if (!report && !report.files) {
     return summary;
   }
killedBy: MutationReport Domain Model calculateMutationSummary gibt 100% Score zurück, wenn keine Mutanten vorhanden sind oder null/undefined report übergeben wird
statusReason: Cannot read properties of null (reading 'files')

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:90:9
   }
 
   for (const fileResult of Object.values(report.files)) {
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
+    if (true) {
       continue;
     }
killedBy: GetMutationSummaryUseCase berechnet die Zusammenfassung für den geladenen Report
statusReason: expected { totalMutants: +0, killed: +0, …(7) } to deeply equal { totalMutants: 2, killed: 1, …(7) }

[Killed] BooleanLiteral
src/core/domain/mutation-report.ts:90:24
   }
 
   for (const fileResult of Object.values(report.files)) {
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
+    if (!fileResult || Array.isArray(fileResult.mutants)) {
       continue;
     }
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 8 // Object.is equality

[Killed] UpdateOperator
src/core/domain/mutation-report.ts:95:7
     }
 
     for (const mutant of fileResult.mutants) {
-      summary.totalMutants++;
+      summary.totalMutants--;
       switch (mutant.status) {
         case "Killed":
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected -8 to be 8 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:97:9
     for (const mutant of fileResult.mutants) {
       summary.totalMutants++;
       switch (mutant.status) {
-        case "Killed":
-          summary.killed++;
-          break;
+        case "Killed":
         case "Survived":
           summary.survived++;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/domain/mutation-report.ts:98:11
       summary.totalMutants++;
       switch (mutant.status) {
         case "Killed":
-          summary.killed++;
+          summary.killed--;
           break;
         case "Survived":
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:100:9
         case "Killed":
           summary.killed++;
           break;
-        case "Survived":
-          summary.survived++;
-          break;
+        case "Survived":
         case "NoCoverage":
           summary.noCoverage++;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 2 // Object.is equality

[Killed] UpdateOperator
src/core/domain/mutation-report.ts:101:11
           summary.killed++;
           break;
         case "Survived":
-          summary.survived++;
+          summary.survived--;
           break;
         case "NoCoverage":
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected -2 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:103:9
         case "Survived":
           summary.survived++;
           break;
-        case "NoCoverage":
-          summary.noCoverage++;
-          break;
+        case "NoCoverage":
         case "Timeout":
           summary.timeout++;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/domain/mutation-report.ts:104:11
           summary.survived++;
           break;
         case "NoCoverage":
-          summary.noCoverage++;
+          summary.noCoverage--;
           break;
         case "Timeout":
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:106:9
         case "NoCoverage":
           summary.noCoverage++;
           break;
-        case "Timeout":
-          summary.timeout++;
-          break;
+        case "Timeout":
         case "CompileError":
           summary.compileError++;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/domain/mutation-report.ts:107:11
           summary.noCoverage++;
           break;
         case "Timeout":
-          summary.timeout++;
+          summary.timeout--;
           break;
         case "CompileError":
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:109:9
         case "Timeout":
           summary.timeout++;
           break;
-        case "CompileError":
-          summary.compileError++;
-          break;
+        case "CompileError":
         case "Ignored":
           summary.ignored++;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/domain/mutation-report.ts:110:11
           summary.timeout++;
           break;
         case "CompileError":
-          summary.compileError++;
+          summary.compileError--;
           break;
         case "Ignored":
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:112:9
         case "CompileError":
           summary.compileError++;
           break;
-        case "Ignored":
-          summary.ignored++;
-          break;
+        case "Ignored":
         case "RuntimeError":
           summary.runtimeError++;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/domain/mutation-report.ts:113:11
           summary.compileError++;
           break;
         case "Ignored":
-          summary.ignored++;
+          summary.ignored--;
           break;
         case "RuntimeError":
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:115:9
         case "Ignored":
           summary.ignored++;
           break;
-        case "RuntimeError":
-          summary.runtimeError++;
-          break;
+        case "RuntimeError":
       }
     }
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/domain/mutation-report.ts:116:11
           summary.ignored++;
           break;
         case "RuntimeError":
-          summary.runtimeError++;
+          summary.runtimeError--;
           break;
       }
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:122:20
     }
   }
 
-  const detected = summary.killed + summary.timeout;
+  const detected = summary.killed - summary.timeout;
   const validMutants = summary.killed + summary.survived + summary.noCoverage + summary.timeout;
 
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 40 // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:123:24
   }
 
   const detected = summary.killed + summary.timeout;
-  const validMutants = summary.killed + summary.survived + summary.noCoverage + summary.timeout;
+  const validMutants = summary.killed - summary.survived + summary.noCoverage + summary.timeout;
 
   if (validMutants > 0) {
killedBy: GetMutationSummaryUseCase berechnet die Zusammenfassung für den geladenen Report
statusReason: expected { totalMutants: 2, killed: 1, …(7) } to deeply equal { totalMutants: 2, killed: 1, …(7) }

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:123:24
   }
 
   const detected = summary.killed + summary.timeout;
-  const validMutants = summary.killed + summary.survived + summary.noCoverage + summary.timeout;
+  const validMutants = summary.killed + summary.survived + summary.noCoverage - summary.timeout;
 
   if (validMutants > 0) {
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected 66.67 to be 40 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:125:7
   const detected = summary.killed + summary.timeout;
   const validMutants = summary.killed + summary.survived + summary.noCoverage + summary.timeout;
 
-  if (validMutants > 0) {
+  if (true) {
     summary.mutationScore = Number(((detected / validMutants) * 100).toFixed(2));
   } else {
killedBy: MutationReport Domain Model calculateMutationSummary gibt 100% Score zurück, wenn keine Mutanten vorhanden sind oder null/undefined report übergeben wird
statusReason: expected NaN to be 100 // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-report.ts:125:7
   const detected = summary.killed + summary.timeout;
   const validMutants = summary.killed + summary.survived + summary.noCoverage + summary.timeout;
 
-  if (validMutants > 0) {
+  if (validMutants <= 0) {
     summary.mutationScore = Number(((detected / validMutants) * 100).toFixed(2));
   } else {
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected 100 to be 40 // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:126:38
   const validMutants = summary.killed + summary.survived + summary.noCoverage + summary.timeout;
 
   if (validMutants > 0) {
-    summary.mutationScore = Number(((detected / validMutants) * 100).toFixed(2));
+    summary.mutationScore = Number(((detected * validMutants) * 100).toFixed(2));
   } else {
     summary.mutationScore = 100;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected 1000 to be 40 // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:126:37
   const validMutants = summary.killed + summary.survived + summary.noCoverage + summary.timeout;
 
   if (validMutants > 0) {
-    summary.mutationScore = Number(((detected / validMutants) * 100).toFixed(2));
+    summary.mutationScore = Number((detected / validMutants / 100).toFixed(2));
   } else {
     summary.mutationScore = 100;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 40 // Object.is equality

[Survived] BlockStatement
src/core/domain/mutation-report.ts:127:10
 
   if (validMutants > 0) {
     summary.mutationScore = Number(((detected / validMutants) * 100).toFixed(2));
-  } else {
-    summary.mutationScore = 100;
-  }
+  } else {}
 
   return summary;

[Killed] BooleanLiteral
src/core/domain/mutation-report.ts:143:18
 ): MutantDetail[] {
   const result: MutantDetail[] = [];
 
-  if (!report || !report.files) {
+  if (!report || report.files) {
     return result;
   }
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/core/domain/mutation-report.ts:148:27
   }
 
   for (const [filePath, fileResult] of Object.entries(report.files)) {
-    if (filePathFilter && filePath !== filePathFilter && !filePath.endsWith(filePathFilter)) {
+    if (filePathFilter && filePath === filePathFilter && !filePath.endsWith(filePathFilter)) {
       continue;
     }
killedBy: MutationReport Domain Model extractSurvivedMutants filtert überlebende Mutanten nach spezifischem Dateipfad oder Suffix
statusReason: expected [ Array(2) ] to have a length of 1 but got 2

[Killed] MethodExpression
src/core/domain/mutation-report.ts:148:59
   }
 
   for (const [filePath, fileResult] of Object.entries(report.files)) {
-    if (filePathFilter && filePath !== filePathFilter && !filePath.endsWith(filePathFilter)) {
+    if (filePathFilter && filePath !== filePathFilter && !filePath.startsWith(filePathFilter)) {
       continue;
     }
killedBy: MutationReport Domain Model extractSurvivedMutants filtert überlebende Mutanten nach spezifischem Dateipfad oder Suffix
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/core/domain/mutation-report.ts:152:9
       continue;
     }
 
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
+    if (fileResult || !Array.isArray(fileResult.mutants)) {
       continue;
     }
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/core/domain/mutation-report.ts:152:60
       continue;
     }
 
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
-      continue;
-    }
+    if (!fileResult || !Array.isArray(fileResult.mutants)) {}
 
     for (const mutant of fileResult.mutants) {
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt null/undefined Reports oder fehlende mutants-Arrays sicher
statusReason: fileResult.mutants is not iterable

[Killed] BlockStatement
src/core/domain/mutation-report.ts:156:46
       continue;
     }
 
-    for (const mutant of fileResult.mutants) {
-      if (mutant.status === "Survived") {
-        const id = typeof mutant.id === "string" && mutant.id !== "" ? mutant.id : "unknown";
-        const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
-        const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
-
-        result.push({
-          id,
-          filePath,
-          mutatorName,
-          replacement: mutant.replacement ?? "",
-          line: mutant.location?.start?.line ?? 1,
-          column: mutant.location?.start?.column ?? 1,
-          status: "Survived",
-          testsRan,
-        });
-      }
-    }
+    for (const mutant of fileResult.mutants) {}
   }
 
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:157:11
     }
 
     for (const mutant of fileResult.mutants) {
-      if (mutant.status === "Survived") {
+      if (true) {
         const id = typeof mutant.id === "string" && mutant.id !== "" ? mutant.id : "unknown";
         const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [ { id: '1', …(7) }, …(7) ] to have a length of 2 but got 8

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:157:11
     }
 
     for (const mutant of fileResult.mutants) {
-      if (mutant.status === "Survived") {
+      if (false) {
         const id = typeof mutant.id === "string" && mutant.id !== "" ? mutant.id : "unknown";
         const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
killedBy: McpServerAdapter sollte MCP-Ressourcen korrekt verwalten
statusReason: expected '[]' to contain 'Arithmetic'

[Killed] EqualityOperator
src/core/domain/mutation-report.ts:158:53
 
     for (const mutant of fileResult.mutants) {
       if (mutant.status === "Survived") {
-        const id = typeof mutant.id === "string" && mutant.id !== "" ? mutant.id : "unknown";
+        const id = typeof mutant.id === "string" && mutant.id === "" ? mutant.id : "unknown";
         const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
         const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected 'unknown' to be '2' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:158:20
 
     for (const mutant of fileResult.mutants) {
       if (mutant.status === "Survived") {
-        const id = typeof mutant.id === "string" && mutant.id !== "" ? mutant.id : "unknown";
+        const id = false ? mutant.id : "unknown";
         const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
         const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected 'unknown' to be '2' // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-report.ts:159:29
     for (const mutant of fileResult.mutants) {
       if (mutant.status === "Survived") {
         const id = typeof mutant.id === "string" && mutant.id !== "" ? mutant.id : "unknown";
-        const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
+        const mutatorName = typeof mutant.mutatorName !== "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
         const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
 
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt fehlerhafte oder unvollständige Mutanten-Objekte gracefully
statusReason: expected undefined to be 'Unknown' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:159:29
     for (const mutant of fileResult.mutants) {
       if (mutant.status === "Survived") {
         const id = typeof mutant.id === "string" && mutant.id !== "" ? mutant.id : "unknown";
-        const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
+        const mutatorName = typeof mutant.mutatorName === "string" || mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
         const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
 
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt fehlerhafte oder unvollständige Mutanten-Objekte gracefully
statusReason: expected undefined to be 'Unknown' // Object.is equality

[Survived] ArrayDeclaration
src/core/domain/mutation-report.ts:160:77
       if (mutant.status === "Survived") {
         const id = typeof mutant.id === "string" && mutant.id !== "" ? mutant.id : "unknown";
         const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
-        const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
+        const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : ["Stryker was here"];
 
         result.push({

[Killed] ObjectLiteral
src/core/domain/mutation-report.ts:162:21
         const mutatorName = typeof mutant.mutatorName === "string" && mutant.mutatorName !== "" ? mutant.mutatorName : "Unknown";
         const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
 
-        result.push({
-          id,
-          filePath,
-          mutatorName,
-          replacement: mutant.replacement ?? "",
-          line: mutant.location?.start?.line ?? 1,
-          column: mutant.location?.start?.column ?? 1,
-          status: "Survived",
-          testsRan,
-        });
+        result.push({});
       }
     }
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected undefined to be '2' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:166:24
           id,
           filePath,
           mutatorName,
-          replacement: mutant.replacement ?? "",
+          replacement: mutant.replacement && "",
           line: mutant.location?.start?.line ?? 1,
           column: mutant.location?.start?.column ?? 1,
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt fehlerhafte oder unvollständige Mutanten-Objekte gracefully
statusReason: expected undefined to be '' // Object.is equality

[Killed] OptionalChaining
src/core/domain/mutation-report.ts:167:17
           filePath,
           mutatorName,
           replacement: mutant.replacement ?? "",
-          line: mutant.location?.start?.line ?? 1,
+          line: mutant.location.start?.line ?? 1,
           column: mutant.location?.start?.column ?? 1,
           status: "Survived",
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt mutant ohne ID fallback
statusReason: Cannot read properties of undefined (reading 'start')

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:167:17
           filePath,
           mutatorName,
           replacement: mutant.replacement ?? "",
-          line: mutant.location?.start?.line ?? 1,
+          line: mutant.location?.start?.line && 1,
           column: mutant.location?.start?.column ?? 1,
           status: "Survived",
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt mutant ohne ID fallback
statusReason: expected undefined to be 1 // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:168:19
           mutatorName,
           replacement: mutant.replacement ?? "",
           line: mutant.location?.start?.line ?? 1,
-          column: mutant.location?.start?.column ?? 1,
+          column: mutant.location?.start?.column && 1,
           status: "Survived",
           testsRan,
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt mutant ohne ID fallback
statusReason: expected undefined to be 1 // Object.is equality

[Killed] OptionalChaining
src/core/domain/mutation-report.ts:168:19
           mutatorName,
           replacement: mutant.replacement ?? "",
           line: mutant.location?.start?.line ?? 1,
-          column: mutant.location?.start?.column ?? 1,
+          column: mutant.location.start?.column ?? 1,
           status: "Survived",
           testsRan,
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt mutant ohne ID fallback
statusReason: Cannot read properties of undefined (reading 'start')
