[Killed] BlockStatement
src/core/domain/report-stream.ts:9:70
 export class ReportStream {
   private readonly subject = new BehaviorSubject<MutationReport | null>(null);
 
-  public subscribe(observer: (report: MutationReport) => void): void {
-    this.subject.subscribe((report) => {
-      if (report !== null) {
-        observer(report);
-      }
-    });
-  }
+  public subscribe(observer: (report: MutationReport) => void): void {}
 
   public publish(report: MutationReport): Result<void, Error> {
killedBy: ReportStream sollte Subscriber reaktiv benachrichtigen, wenn ein valider Report publiziert wird
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/core/domain/report-stream.ts:10:40
   private readonly subject = new BehaviorSubject<MutationReport | null>(null);
 
   public subscribe(observer: (report: MutationReport) => void): void {
-    this.subject.subscribe((report) => {
-      if (report !== null) {
-        observer(report);
-      }
-    });
+    this.subject.subscribe((report) => {});
   }
 
killedBy: ReportStream sollte Subscriber reaktiv benachrichtigen, wenn ein valider Report publiziert wird
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/core/domain/report-stream.ts:11:11
 
   public subscribe(observer: (report: MutationReport) => void): void {
     this.subject.subscribe((report) => {
-      if (report !== null) {
+      if (true) {
         observer(report);
       }
killedBy: ReportStream sollte Subscriber reaktiv benachrichtigen, wenn ein valider Report publiziert wird
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] EqualityOperator
src/core/domain/report-stream.ts:11:11
 
   public subscribe(observer: (report: MutationReport) => void): void {
     this.subject.subscribe((report) => {
-      if (report !== null) {
+      if (report === null) {
         observer(report);
       }
killedBy: ReportStream sollte Subscriber reaktiv benachrichtigen, wenn ein valider Report publiziert wird
statusReason: expected "spy" to be called with arguments: [ { files: {} } ]

Received: 

  1st spy call:

  Array [
-   Object {

[Killed] BlockStatement
src/core/domain/report-stream.ts:17:63
     });
   }
 
-  public publish(report: MutationReport): Result<void, Error> {
-    if (!report) {
-      return err(new Error("Cannot publish a null or undefined report."));
-    }
-
-    this.subject.next(report);
-    return ok(undefined);
-  }
+  public publish(report: MutationReport): Result<void, Error> {}
 
   public current(): MutationReport | null {
killedBy: RunMutationTestsUseCase führt Mutationstests erfolgreich aus, aktualisiert Status, publiziert Report und benachrichtigt Desktop
statusReason: expected null to deeply equal { files: { 'src/foo.ts': { …(1) } } }

[Killed] BooleanLiteral
src/core/domain/report-stream.ts:18:9
   }
 
   public publish(report: MutationReport): Result<void, Error> {
-    if (!report) {
+    if (report) {
       return err(new Error("Cannot publish a null or undefined report."));
     }
killedBy: GetMutationSummaryUseCase berechnet die Zusammenfassung für den geladenen Report
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/domain/report-stream.ts:18:18
   }
 
   public publish(report: MutationReport): Result<void, Error> {
-    if (!report) {
-      return err(new Error("Cannot publish a null or undefined report."));
-    }
+    if (!report) {}
 
     this.subject.next(report);
killedBy: ReportStream sollte einen expliziten Error zurückgeben, wenn ein leerer Report publiziert wird
statusReason: expected true to be falsy

[Killed] BlockStatement
src/core/domain/report-stream.ts:26:43
     return ok(undefined);
   }
 
-  public current(): MutationReport | null {
-    return this.subject.getValue();
-  }
+  public current(): MutationReport | null {}
 
   public asObservable(): Observable<MutationReport | null> {
killedBy: GetMutationSummaryUseCase berechnet die Zusammenfassung für den geladenen Report
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/domain/report-stream.ts:30:60
     return this.subject.getValue();
   }
 
-  public asObservable(): Observable<MutationReport | null> {
-    return this.subject.asObservable();
-  }
+  public asObservable(): Observable<MutationReport | null> {}
 }
 
killedBy: ReportStream sollte via asObservable den Stream für externe Consumer (z.B. Outbound-Adapter) bereitstellen
statusReason: Cannot read properties of undefined (reading 'subscribe')
