[Killed] BlockStatement
src/index.ts:26:95
 /**
  * Erstellt die komplette Objektgraphen-Instanz für den MCP-Server.
  */
-export function createMcpServerAdapter(logger: Logger, port: number = 3000): McpServerAdapter {
-  const reportStream = new ReportStream();
-  const statusStream = new ExecutionStatusStream();
-
-  const strykerRunner = new StrykerCliRunnerAdapter(logger);
-  const gitService = new GitCliAdapter(logger);
-  const notifierService = new DesktopNotifierAdapter(logger);
-
-  const runUseCase = new RunMutationTestsUseCase(reportStream, statusStream, strykerRunner, notifierService);
-  const runTargetedUseCase = new RunTargetedMutationTestsUseCase(gitService, runUseCase);
-  const getSurvivedUseCase = new GetSurvivedMutantsUseCase(reportStream);
-  const getSummaryUseCase = new GetMutationSummaryUseCase(reportStream);
-
-  return new McpServerAdapter(
-    logger,
-    reportStream,
-    statusStream,
-    runUseCase,
-    runTargetedUseCase,
-    getSurvivedUseCase,
-    getSummaryUseCase,
-    port,
-    notifierService,
-  );
-}
+export function createMcpServerAdapter(logger: Logger, port: number = 3000): McpServerAdapter {}
 
 /**
killedBy: Plugin Index (Composition Root) sollte eine McpServerAdapter-Instanz über die App-Factory erstellen
statusReason: expected undefined to be an instance of McpServerAdapter

[Killed] BlockStatement
src/index.ts:93:33
   logger: Logger,
   adapter?: McpServerAdapter,
   mode: "sse" | "stdio" = "sse",
-): Promise<Result<void, Error>> {
-  const server = adapter || createMcpServerAdapter(logger, 3000);
-  if (mode === "stdio") {
-    return server.startStdio();
-  }
-  return server.start();
-}
+): Promise<Result<void, Error>> {}
 
 export * from "./core/domain/mutation-report.js";
killedBy: Plugin Index (Composition Root) sollte den Standalone-Server mit Standard-Adapter erzeugen und starten können
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/index.ts:94:18
   adapter?: McpServerAdapter,
   mode: "sse" | "stdio" = "sse",
 ): Promise<Result<void, Error>> {
-  const server = adapter || createMcpServerAdapter(logger, 3000);
+  const server = true;
   if (mode === "stdio") {
     return server.startStdio();
killedBy: Plugin Index (Composition Root) sollte den Standalone-Server mit Standard-Adapter erzeugen und starten können
statusReason: server.start is not a function

[Killed] ConditionalExpression
src/index.ts:94:18
   adapter?: McpServerAdapter,
   mode: "sse" | "stdio" = "sse",
 ): Promise<Result<void, Error>> {
-  const server = adapter || createMcpServerAdapter(logger, 3000);
+  const server = false;
   if (mode === "stdio") {
     return server.startStdio();
killedBy: Plugin Index (Composition Root) sollte den Standalone-Server mit Standard-Adapter erzeugen und starten können
statusReason: server.start is not a function

[Killed] EqualityOperator
src/index.ts:95:7
   mode: "sse" | "stdio" = "sse",
 ): Promise<Result<void, Error>> {
   const server = adapter || createMcpServerAdapter(logger, 3000);
-  if (mode === "stdio") {
+  if (mode !== "stdio") {
     return server.startStdio();
   }
killedBy: Plugin Index (Composition Root) sollte den Standalone-Server mit Standard-Adapter erzeugen und starten können
statusReason: expected "start" to be called at least once

[Killed] BlockStatement
src/index.ts:95:25
   mode: "sse" | "stdio" = "sse",
 ): Promise<Result<void, Error>> {
   const server = adapter || createMcpServerAdapter(logger, 3000);
-  if (mode === "stdio") {
-    return server.startStdio();
-  }
+  if (mode === "stdio") {}
   return server.start();
 }
killedBy: Plugin Index (Composition Root) sollte den Standalone-Server im stdio Modus starten können
statusReason: expected "startStdio" to be called at least once
