[Survived] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:14:61
 export class GitCliAdapter implements GitServicePort {
   constructor(
     private readonly logger: Logger,
-    private readonly execFn: ExecCommandFn = async (cmd) => {
-      const { stdout } = await execAsync(cmd);
-      return stdout;
-    },
+    private readonly execFn: ExecCommandFn = async (cmd) => {},
   ) {}
 

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:20:78
     },
   ) {}
 
-  public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {
-    try {
-      const isDiff = typeof revisionOrBranch === "string" && revisionOrBranch.trim().length > 0;
-      const command = isDiff
-        ? `git diff --name-only ${revisionOrBranch}`
-        : "git status --porcelain";
-
-      const output = await this.execFn(command);
-      return this.parseGitOutput(output, isDiff);
-    } catch (error) {
-      this.logger.warn("Konnte geänderte Git-Dateien nicht ermitteln:", error as Error);
-      return [];
-    }
-  }
+  public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {}
 
   public async getChangedFilesBetween(fromRevision: string, toRevision: string): Promise<string[]> {
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "spy" to be called with arguments: [ 'git status --porcelain' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:21:9
   ) {}
 
   public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {
-    try {
-      const isDiff = typeof revisionOrBranch === "string" && revisionOrBranch.trim().length > 0;
-      const command = isDiff
-        ? `git diff --name-only ${revisionOrBranch}`
-        : "git status --porcelain";
-
-      const output = await this.execFn(command);
-      return this.parseGitOutput(output, isDiff);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.warn("Konnte geänderte Git-Dateien nicht ermitteln:", error as Error);
       return [];
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "spy" to be called with arguments: [ 'git status --porcelain' ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:22:22
 
   public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {
     try {
-      const isDiff = typeof revisionOrBranch === "string" && revisionOrBranch.trim().length > 0;
+      const isDiff = true;
       const command = isDiff
         ? `git diff --name-only ${revisionOrBranch}`
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "spy" to be called with arguments: [ 'git status --porcelain' ]

Received: 

  1st spy call:

  Array [
-   "git status --porcelain",

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:22:22
 
   public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {
     try {
-      const isDiff = typeof revisionOrBranch === "string" && revisionOrBranch.trim().length > 0;
+      const isDiff = true && revisionOrBranch.trim().length > 0;
       const command = isDiff
         ? `git diff --name-only ${revisionOrBranch}`
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "spy" to be called with arguments: [ 'git status --porcelain' ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:29:21
 
       const output = await this.execFn(command);
       return this.parseGitOutput(output, isDiff);
-    } catch (error) {
-      this.logger.warn("Konnte geänderte Git-Dateien nicht ermitteln:", error as Error);
-      return [];
-    }
+    } catch (error) {}
   }
 
killedBy: GitCliAdapter fängt Fehler in git Befehlen ab, loggt eine Warnung und gibt leeres Array zurück
statusReason: expected undefined to deeply equal []

[Killed] ArrayDeclaration
src/infrastructure/git/git-cli.adapter.ts:31:14
       return this.parseGitOutput(output, isDiff);
     } catch (error) {
       this.logger.warn("Konnte geänderte Git-Dateien nicht ermitteln:", error as Error);
-      return [];
+      return ["Stryker was here"];
     }
   }
killedBy: GitCliAdapter fängt Fehler in git Befehlen ab, loggt eine Warnung und gibt leeres Array zurück
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:35:100
     }
   }
 
-  public async getChangedFilesBetween(fromRevision: string, toRevision: string): Promise<string[]> {
-    try {
-      const command = `git diff --name-only ${fromRevision}..${toRevision}`;
-      const output = await this.execFn(command);
-      return this.parseGitOutput(output, true);
-    } catch (error) {
-      this.logger.warn(
-        `Konnte geänderte Git-Dateien zwischen ${fromRevision} und ${toRevision} nicht ermitteln:`,
-        error as Error,
-      );
-      return [];
-    }
-  }
+  public async getChangedFilesBetween(fromRevision: string, toRevision: string): Promise<string[]> {}
 
   public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {
killedBy: GitCliAdapter extrahiert geänderte Dateien zwischen zwei Revisionen via getChangedFilesBetween
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:36:9
   }
 
   public async getChangedFilesBetween(fromRevision: string, toRevision: string): Promise<string[]> {
-    try {
-      const command = `git diff --name-only ${fromRevision}..${toRevision}`;
-      const output = await this.execFn(command);
-      return this.parseGitOutput(output, true);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.warn(
         `Konnte geänderte Git-Dateien zwischen ${fromRevision} und ${toRevision} nicht ermitteln:`,
killedBy: GitCliAdapter extrahiert geänderte Dateien zwischen zwei Revisionen via getChangedFilesBetween
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Survived] BooleanLiteral
src/infrastructure/git/git-cli.adapter.ts:39:42
     try {
       const command = `git diff --name-only ${fromRevision}..${toRevision}`;
       const output = await this.execFn(command);
-      return this.parseGitOutput(output, true);
+      return this.parseGitOutput(output, false);
     } catch (error) {
       this.logger.warn(

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:40:21
       const command = `git diff --name-only ${fromRevision}..${toRevision}`;
       const output = await this.execFn(command);
       return this.parseGitOutput(output, true);
-    } catch (error) {
-      this.logger.warn(
-        `Konnte geänderte Git-Dateien zwischen ${fromRevision} und ${toRevision} nicht ermitteln:`,
-        error as Error,
-      );
-      return [];
-    }
+    } catch (error) {}
   }
 
killedBy: GitCliAdapter fängt Fehler in git Befehlen ab, loggt eine Warnung und gibt leeres Array zurück
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:49:79
     }
   }
 
-  public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {
-    try {
-      const command = `git diff-tree --no-commit-id --name-only -r ${commitSha}`;
-      const output = await this.execFn(command);
-      return this.parseGitOutput(output, true);
-    } catch (error) {
-      this.logger.warn(`Konnte geänderte Git-Dateien für Commit ${commitSha} nicht ermitteln:`, error as Error);
-      return [];
-    }
-  }
+  public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {}
 
   private parseGitOutput(output: string, isDiff: boolean): string[] {
killedBy: GitCliAdapter extrahiert geänderte Dateien eines spezifischen Commits via getChangedFilesForCommit
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:50:9
   }
 
   public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {
-    try {
-      const command = `git diff-tree --no-commit-id --name-only -r ${commitSha}`;
-      const output = await this.execFn(command);
-      return this.parseGitOutput(output, true);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.warn(`Konnte geänderte Git-Dateien für Commit ${commitSha} nicht ermitteln:`, error as Error);
       return [];
killedBy: GitCliAdapter extrahiert geänderte Dateien eines spezifischen Commits via getChangedFilesForCommit
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:54:21
       const command = `git diff-tree --no-commit-id --name-only -r ${commitSha}`;
       const output = await this.execFn(command);
       return this.parseGitOutput(output, true);
-    } catch (error) {
-      this.logger.warn(`Konnte geänderte Git-Dateien für Commit ${commitSha} nicht ermitteln:`, error as Error);
-      return [];
-    }
+    } catch (error) {}
   }
 
killedBy: GitCliAdapter fängt Fehler in git Befehlen ab, loggt eine Warnung und gibt leeres Array zurück
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:60:69
     }
   }
 
-  private parseGitOutput(output: string, isDiff: boolean): string[] {
-    const lines = output.split("\n").map((line) => line.trim()).filter((line) => line.length > 0);
-    const tsFiles: string[] = [];
-
-    for (const line of lines) {
-      let filePath = line;
-      if (!isDiff) {
-        // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
-        const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
-        filePath = statusMatch ? statusMatch[1].trim() : line;
-      }
-
-      const isTsFile = filePath.endsWith(".ts");
-      const isSpecFile = filePath.endsWith(".spec.ts");
-      const isDeclFile = filePath.endsWith(".d.ts");
-
-      if (isTsFile && !isSpecFile && !isDeclFile) {
-        tsFiles.push(filePath);
-      }
-    }
-
-    return tsFiles;
-  }
+  private parseGitOutput(output: string, isDiff: boolean): string[] {}
 }
 
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected undefined to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] EqualityOperator
src/infrastructure/git/git-cli.adapter.ts:61:82
   }
 
   private parseGitOutput(output: string, isDiff: boolean): string[] {
-    const lines = output.split("\n").map((line) => line.trim()).filter((line) => line.length > 0);
+    const lines = output.split("\n").map((line) => line.trim()).filter((line) => line.length <= 0);
     const tsFiles: string[] = [];
 
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] ArrowFunction
src/infrastructure/git/git-cli.adapter.ts:61:72
   }
 
   private parseGitOutput(output: string, isDiff: boolean): string[] {
-    const lines = output.split("\n").map((line) => line.trim()).filter((line) => line.length > 0);
+    const lines = output.split("\n").map((line) => line.trim()).filter(() => undefined);
     const tsFiles: string[] = [];
 
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:64:31
     const lines = output.split("\n").map((line) => line.trim()).filter((line) => line.length > 0);
     const tsFiles: string[] = [];
 
-    for (const line of lines) {
-      let filePath = line;
-      if (!isDiff) {
-        // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
-        const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
-        filePath = statusMatch ? statusMatch[1].trim() : line;
-      }
-
-      const isTsFile = filePath.endsWith(".ts");
-      const isSpecFile = filePath.endsWith(".spec.ts");
-      const isDeclFile = filePath.endsWith(".d.ts");
-
-      if (isTsFile && !isSpecFile && !isDeclFile) {
-        tsFiles.push(filePath);
-      }
-    }
+    for (const line of lines) {}
 
     return tsFiles;
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] BooleanLiteral
src/infrastructure/git/git-cli.adapter.ts:66:11
 
     for (const line of lines) {
       let filePath = line;
-      if (!isDiff) {
+      if (isDiff) {
         // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
         const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'M src/index.ts', …(2) ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:66:11
 
     for (const line of lines) {
       let filePath = line;
-      if (!isDiff) {
+      if (false) {
         // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
         const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'M src/index.ts', …(2) ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] Regex
src/infrastructure/git/git-cli.adapter.ts:68:40
       let filePath = line;
       if (!isDiff) {
         // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
-        const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
+        const statusMatch = line.match(/^[\s\S]{1,2}\S+(.+)$/);
         filePath = statusMatch ? statusMatch[1].trim() : line;
       }
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'src/app.ts' ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Survived] Regex
src/infrastructure/git/git-cli.adapter.ts:68:40
       let filePath = line;
       if (!isDiff) {
         // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
-        const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
+        const statusMatch = line.match(/^[\S\S]{1,2}\s+(.+)$/);
         filePath = statusMatch ? statusMatch[1].trim() : line;
       }

[Survived] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:69:34
       if (!isDiff) {
         // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
         const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
-        filePath = statusMatch ? statusMatch[1].trim() : line;
+        filePath = statusMatch ? statusMatch[1] : line;
       }
 

[Killed] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:72:24
         filePath = statusMatch ? statusMatch[1].trim() : line;
       }
 
-      const isTsFile = filePath.endsWith(".ts");
+      const isTsFile = filePath.startsWith(".ts");
       const isSpecFile = filePath.endsWith(".spec.ts");
       const isDeclFile = filePath.endsWith(".d.ts");
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:73:26
       }
 
       const isTsFile = filePath.endsWith(".ts");
-      const isSpecFile = filePath.endsWith(".spec.ts");
+      const isSpecFile = filePath.startsWith(".spec.ts");
       const isDeclFile = filePath.endsWith(".d.ts");
 
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'src/index.ts', 'src/app.ts', …(2) ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:74:26
 
       const isTsFile = filePath.endsWith(".ts");
       const isSpecFile = filePath.endsWith(".spec.ts");
-      const isDeclFile = filePath.endsWith(".d.ts");
+      const isDeclFile = filePath.startsWith(".d.ts");
 
       if (isTsFile && !isSpecFile && !isDeclFile) {
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'src/index.ts', 'src/app.ts', …(2) ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] BooleanLiteral
src/infrastructure/git/git-cli.adapter.ts:76:23
       const isSpecFile = filePath.endsWith(".spec.ts");
       const isDeclFile = filePath.endsWith(".d.ts");
 
-      if (isTsFile && !isSpecFile && !isDeclFile) {
+      if (isTsFile && isSpecFile && !isDeclFile) {
         tsFiles.push(filePath);
       }
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'src/index.spec.ts' ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:76:51
       const isSpecFile = filePath.endsWith(".spec.ts");
       const isDeclFile = filePath.endsWith(".d.ts");
 
-      if (isTsFile && !isSpecFile && !isDeclFile) {
-        tsFiles.push(filePath);
-      }
+      if (isTsFile && !isSpecFile && !isDeclFile) {}
     }
 
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]
