[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:17:18
   soundPath: string,
   platform: string = process.platform,
   execFn: (cmd: string, cb: (err: Error | null) => void) => void = exec as any,
-): Promise<void> {
-  return new Promise((resolve) => {
-    let command: string;
-    if (platform === "win32") {
-      const escapedPath = soundPath.replace(/'/g, "''");
-      command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (platform === "darwin") {
-      command = `afplay "${soundPath}"`;
-    } else {
-      command = `aplay "${soundPath}" || paplay "${soundPath}"`;
-    }
-
-    execFn(command, () => {
-      resolve();
-    });
-  });
-}
+): Promise<void> {}
 
 export class DesktopNotifierAdapter implements NotificationServicePort {
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:18:35
   platform: string = process.platform,
   execFn: (cmd: string, cb: (err: Error | null) => void) => void = exec as any,
 ): Promise<void> {
-  return new Promise((resolve) => {
-    let command: string;
-    if (platform === "win32") {
-      const escapedPath = soundPath.replace(/'/g, "''");
-      command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (platform === "darwin") {
-      command = `afplay "${soundPath}"`;
-    } else {
-      command = `aplay "${soundPath}" || paplay "${soundPath}"`;
-    }
-
-    execFn(command, () => {
-      resolve();
-    });
-  });
+  return new Promise((resolve) => {});
 }
 
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:20:9
 ): Promise<void> {
   return new Promise((resolve) => {
     let command: string;
-    if (platform === "win32") {
+    if (true) {
       const escapedPath = soundPath.replace(/'/g, "''");
       command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "spy" to be called with arguments: [ StringContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   StringContaining "afplay \"testpath.wav\"",

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:20:9
 ): Promise<void> {
   return new Promise((resolve) => {
     let command: string;
-    if (platform === "win32") {
+    if (false) {
       const escapedPath = soundPath.replace(/'/g, "''");
       command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   StringContaining "test''path.wav",

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:23:16
     if (platform === "win32") {
       const escapedPath = soundPath.replace(/'/g, "''");
       command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (platform === "darwin") {
+    } else if (true) {
       command = `afplay "${soundPath}"`;
     } else {
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "spy" to be called with arguments: [ StringContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   StringContaining "aplay \"testpath.wav\" || paplay \"testpath.wav\"",

[Killed] EqualityOperator
src/infrastructure/notification/desktop-notifier.adapter.ts:23:16
     if (platform === "win32") {
       const escapedPath = soundPath.replace(/'/g, "''");
       command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
-    } else if (platform === "darwin") {
+    } else if (platform !== "darwin") {
       command = `afplay "${soundPath}"`;
     } else {
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "spy" to be called with arguments: [ StringContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   StringContaining "afplay \"testpath.wav\"",

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:25:12
       command = `powershell -c "(New-Object System.Media.SoundPlayer '${escapedPath}').Play()"`;
     } else if (platform === "darwin") {
       command = `afplay "${soundPath}"`;
-    } else {
-      command = `aplay "${soundPath}" || paplay "${soundPath}"`;
-    }
+    } else {}
 
     execFn(command, () => {
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "spy" to be called with arguments: [ StringContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   StringContaining "aplay \"testpath.wav\" || paplay \"testpath.wav\"",

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:29:27
       command = `aplay "${soundPath}" || paplay "${soundPath}"`;
     }
 
-    execFn(command, () => {
-      resolve();
-    });
+    execFn(command, () => {});
   });
 }
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:36:42
 }
 
 export class DesktopNotifierAdapter implements NotificationServicePort {
-  private options: NotificationOptions = {
-    enabled: true,
-    sound: true,
-    persistentOverlay: true,
-  };
+  private options: NotificationOptions = {};
 
   constructor(
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:37:14
 
 export class DesktopNotifierAdapter implements NotificationServicePort {
   private options: NotificationOptions = {
-    enabled: true,
+    enabled: false,
     sound: true,
     persistentOverlay: true,
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:38:12
 export class DesktopNotifierAdapter implements NotificationServicePort {
   private options: NotificationOptions = {
     enabled: true,
-    sound: true,
+    sound: false,
     persistentOverlay: true,
   };
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:39:24
   private options: NotificationOptions = {
     enabled: true,
     sound: true,
-    persistentOverlay: true,
+    persistentOverlay: false,
   };
 
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:48:56
     private readonly audioPlayer: AudioPlayerFn = defaultAudioPlayer,
   ) {}
 
-  public configure(options: NotificationOptions): void {
-    this.options = { ...this.options, ...options };
-  }
+  public configure(options: NotificationOptions): void {}
 
   public async notifyStatus(message: string, title: string = "Stryker MCP Control Server"): Promise<void> {
killedBy: DesktopNotifierAdapter erlaubt Deaktivierung des persistenten Overlays
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:52:107
     this.options = { ...this.options, ...options };
   }
 
-  public async notifyStatus(message: string, title: string = "Stryker MCP Control Server"): Promise<void> {
-    if (!this.options.enabled) return;
-
-    await this.sendNotification({
-      title,
-      message,
-      sound: this.options.sound,
-      wait: false,
-    });
-  }
+  public async notifyStatus(message: string, title: string = "Stryker MCP Control Server"): Promise<void> {}
 
   public async notifyProgress(progressPercent: number, currentMutant?: string): Promise<void> {
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:53:9
   }
 
   public async notifyStatus(message: string, title: string = "Stryker MCP Control Server"): Promise<void> {
-    if (!this.options.enabled) return;
+    if (this.options.enabled) return;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:53:9
   }
 
   public async notifyStatus(message: string, title: string = "Stryker MCP Control Server"): Promise<void> {
-    if (!this.options.enabled) return;
+    if (false) return;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter blockiert Benachrichtigungen, wenn enabled false ist
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:59:13
       title,
       message,
       sound: this.options.sound,
-      wait: false,
+      wait: true,
     });
   }
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:63:95
     });
   }
 
-  public async notifyProgress(progressPercent: number, currentMutant?: string): Promise<void> {
-    if (!this.options.enabled) return;
-
-    const message = currentMutant
-      ? `Fortschritt: ${progressPercent}% | Mutieren: ${currentMutant}`
-      : `Fortschritt: ${progressPercent}% abgeschlossen`;
-
-    await this.sendNotification({
-      title: `⚡ Stryker Mutationstests (${progressPercent}%)`,
-      message,
-      sound: false,
-      wait: false,
-    });
-  }
+  public async notifyProgress(progressPercent: number, currentMutant?: string): Promise<void> {}
 
   public async notifyCompletion(score: number, killed: number, survived: number): Promise<void> {
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:64:9
   }
 
   public async notifyProgress(progressPercent: number, currentMutant?: string): Promise<void> {
-    if (!this.options.enabled) return;
+    if (false) return;
 
     const message = currentMutant
killedBy: DesktopNotifierAdapter blockiert Benachrichtigungen, wenn enabled false ist
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:64:9
   }
 
   public async notifyProgress(progressPercent: number, currentMutant?: string): Promise<void> {
-    if (!this.options.enabled) return;
+    if (true) return;
 
     const message = currentMutant
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:73:14
     await this.sendNotification({
       title: `⚡ Stryker Mutationstests (${progressPercent}%)`,
       message,
-      sound: false,
+      sound: true,
       wait: false,
     });
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Survived] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:74:13
       title: `⚡ Stryker Mutationstests (${progressPercent}%)`,
       message,
       sound: false,
-      wait: false,
+      wait: true,
     });
   }

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:78:97
     });
   }
 
-  public async notifyCompletion(score: number, killed: number, survived: number): Promise<void> {
-    if (!this.options.enabled) return;
-
-    const title = `🧬 Mutationstests Beendet (${score}% Score)`;
-    const message = `${killed} Mutanten getötet | ${survived} überlebt`;
-    const isPersistent = this.options.persistentOverlay !== false;
-
-    await this.sendNotification({
-      title,
-      message,
-      sound: this.options.sound,
-      wait: isPersistent,
-      timeout: isPersistent ? false : undefined,
-      sticky: isPersistent,
-    });
-  }
+  public async notifyCompletion(score: number, killed: number, survived: number): Promise<void> {}
 
   public async notifyError(errorMessage: string): Promise<void> {
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:79:9
   }
 
   public async notifyCompletion(score: number, killed: number, survived: number): Promise<void> {
-    if (!this.options.enabled) return;
+    if (this.options.enabled) return;
 
     const title = `🧬 Mutationstests Beendet (${score}% Score)`;
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:79:9
   }
 
   public async notifyCompletion(score: number, killed: number, survived: number): Promise<void> {
-    if (!this.options.enabled) return;
+    if (false) return;
 
     const title = `🧬 Mutationstests Beendet (${score}% Score)`;
killedBy: DesktopNotifierAdapter blockiert Benachrichtigungen, wenn enabled false ist
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:83:26
 
     const title = `🧬 Mutationstests Beendet (${score}% Score)`;
     const message = `${killed} Mutanten getötet | ${survived} überlebt`;
-    const isPersistent = this.options.persistentOverlay !== false;
+    const isPersistent = true;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter erlaubt Deaktivierung des persistenten Overlays
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] EqualityOperator
src/infrastructure/notification/desktop-notifier.adapter.ts:83:26
 
     const title = `🧬 Mutationstests Beendet (${score}% Score)`;
     const message = `${killed} Mutanten getötet | ${survived} überlebt`;
-    const isPersistent = this.options.persistentOverlay !== false;
+    const isPersistent = this.options.persistentOverlay === false;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] ObjectLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:85:33
     const message = `${killed} Mutanten getötet | ${survived} überlebt`;
     const isPersistent = this.options.persistentOverlay !== false;
 
-    await this.sendNotification({
-      title,
-      message,
-      sound: this.options.sound,
-      wait: isPersistent,
-      timeout: isPersistent ? false : undefined,
-      sticky: isPersistent,
-    });
+    await this.sendNotification({});
   }
 
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:90:31
       message,
       sound: this.options.sound,
       wait: isPersistent,
-      timeout: isPersistent ? false : undefined,
+      timeout: isPersistent ? true : undefined,
       sticky: isPersistent,
     });
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:95:65
     });
   }
 
-  public async notifyError(errorMessage: string): Promise<void> {
-    if (!this.options.enabled) return;
-
-    const isPersistent = this.options.persistentOverlay !== false;
-
-    await this.sendNotification({
-      title: "❌ Stryker Mutationstest Fehler",
-      message: errorMessage,
-      sound: this.options.sound,
-      wait: isPersistent,
-      timeout: isPersistent ? false : undefined,
-      sticky: isPersistent,
-    });
-  }
+  public async notifyError(errorMessage: string): Promise<void> {}
 
   private async sendNotification(params: {
killedBy: DesktopNotifierAdapter sendet Fehlerbenachrichtigung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:96:9
   }
 
   public async notifyError(errorMessage: string): Promise<void> {
-    if (!this.options.enabled) return;
+    if (false) return;
 
     const isPersistent = this.options.persistentOverlay !== false;
killedBy: DesktopNotifierAdapter blockiert Benachrichtigungen, wenn enabled false ist
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:96:9
   }
 
   public async notifyError(errorMessage: string): Promise<void> {
-    if (!this.options.enabled) return;
+    if (this.options.enabled) return;
 
     const isPersistent = this.options.persistentOverlay !== false;
killedBy: DesktopNotifierAdapter sendet Fehlerbenachrichtigung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:98:26
   public async notifyError(errorMessage: string): Promise<void> {
     if (!this.options.enabled) return;
 
-    const isPersistent = this.options.persistentOverlay !== false;
+    const isPersistent = false;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter sendet Fehlerbenachrichtigung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:98:61
   public async notifyError(errorMessage: string): Promise<void> {
     if (!this.options.enabled) return;
 
-    const isPersistent = this.options.persistentOverlay !== false;
+    const isPersistent = this.options.persistentOverlay !== true;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter sendet Fehlerbenachrichtigung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] ObjectLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:100:33
 
     const isPersistent = this.options.persistentOverlay !== false;
 
-    await this.sendNotification({
-      title: "❌ Stryker Mutationstest Fehler",
-      message: errorMessage,
-      sound: this.options.sound,
-      wait: isPersistent,
-      timeout: isPersistent ? false : undefined,
-      sticky: isPersistent,
-    });
+    await this.sendNotification({});
   }
 
killedBy: DesktopNotifierAdapter sendet Fehlerbenachrichtigung als persistenten Overlay mit Sound
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:121:20
     const playSound = Boolean(params.sound);
     const soundPath = this.getSoundPath();
 
-    if (playSound) {
-      try {
-        await this.audioPlayer(soundPath);
-      } catch (audioErr) {
-        this.logger.debug("Audio-Wiedergabe fehlgeschlagen:", audioErr as Error);
-      }
-    }
+    if (playSound) {}
 
     return new Promise((resolve) => {
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:121:9
     const playSound = Boolean(params.sound);
     const soundPath = this.getSoundPath();
 
-    if (playSound) {
+    if (false) {
       try {
         await this.audioPlayer(soundPath);
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:122:11
     const soundPath = this.getSoundPath();
 
     if (playSound) {
-      try {
-        await this.audioPlayer(soundPath);
-      } catch (audioErr) {
+      try {} catch (audioErr) {
         this.logger.debug("Audio-Wiedergabe fehlgeschlagen:", audioErr as Error);
       }
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:124:26
     if (playSound) {
       try {
         await this.audioPlayer(soundPath);
-      } catch (audioErr) {
-        this.logger.debug("Audio-Wiedergabe fehlgeschlagen:", audioErr as Error);
-      }
+      } catch (audioErr) {}
     }
 
killedBy: DesktopNotifierAdapter fängt Fehler bei der Audio-Wiedergabe sicher ab und loggt sie
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:129:37
       }
     }
 
-    return new Promise((resolve) => {
-      try {
-        const notificationPayload = {
-          ...params,
-          sound: playSound ? soundPath : false,
-        };
-
-        this.notifierService.notify(notificationPayload, (err: Error | null) => {
-          if (err) {
-            this.logger.debug("Desktop-Benachrichtigung konnte nicht gesendet werden:", err);
-          }
-          resolve();
-        });
-      } catch (err) {
-        this.logger.debug("Unerwarteter Fehler beim Senden der Benachrichtigung:", err as Error);
-        resolve();
-      }
-    });
+    return new Promise((resolve) => {});
   }
 
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:130:11
     }
 
     return new Promise((resolve) => {
-      try {
-        const notificationPayload = {
-          ...params,
-          sound: playSound ? soundPath : false,
-        };
-
-        this.notifierService.notify(notificationPayload, (err: Error | null) => {
-          if (err) {
-            this.logger.debug("Desktop-Benachrichtigung konnte nicht gesendet werden:", err);
-          }
-          resolve();
-        });
-      } catch (err) {
+      try {} catch (err) {
         this.logger.debug("Unerwarteter Fehler beim Senden der Benachrichtigung:", err as Error);
         resolve();
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:131:37
 
     return new Promise((resolve) => {
       try {
-        const notificationPayload = {
-          ...params,
-          sound: playSound ? soundPath : false,
-        };
+        const notificationPayload = {};
 
         this.notifierService.notify(notificationPayload, (err: Error | null) => {
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:133:42
       try {
         const notificationPayload = {
           ...params,
-          sound: playSound ? soundPath : false,
+          sound: playSound ? soundPath : true,
         };
 
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:136:81
           sound: playSound ? soundPath : false,
         };
 
-        this.notifierService.notify(notificationPayload, (err: Error | null) => {
-          if (err) {
-            this.logger.debug("Desktop-Benachrichtigung konnte nicht gesendet werden:", err);
-          }
-          resolve();
-        });
+        this.notifierService.notify(notificationPayload, (err: Error | null) => {});
       } catch (err) {
         this.logger.debug("Unerwarteter Fehler beim Senden der Benachrichtigung:", err as Error);
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:137:20
         };
 
         this.notifierService.notify(notificationPayload, (err: Error | null) => {
-          if (err) {
-            this.logger.debug("Desktop-Benachrichtigung konnte nicht gesendet werden:", err);
-          }
+          if (err) {}
           resolve();
         });
killedBy: DesktopNotifierAdapter fängt Fehler im Notifier Callback sicher ab und loggt sie
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0
