[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:137:15
         };
 
         this.notifierService.notify(notificationPayload, (err: Error | null) => {
-          if (err) {
+          if (false) {
             this.logger.debug("Desktop-Benachrichtigung konnte nicht gesendet werden:", err);
           }
killedBy: DesktopNotifierAdapter fängt Fehler im Notifier Callback sicher ab und loggt sie
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:142:21
           }
           resolve();
         });
-      } catch (err) {
-        this.logger.debug("Unerwarteter Fehler beim Senden der Benachrichtigung:", err as Error);
-        resolve();
-      }
+      } catch (err) {}
     });
   }
killedBy: DesktopNotifierAdapter fängt synchrone Fehler im Notifier.notify Aufruf ab und loggt sie
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:149:34
     });
   }
 
-  private getSoundPath(): string {
-    if (this.options.customSoundPath) {
-      return path.resolve(this.options.customSoundPath);
-    }
-    return path.resolve(process.cwd(), "assets", "sounds", "mutant_hunter.wav");
-  }
+  private getSoundPath(): string {}
 }
 
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   StringContaining "mutant_hunter.wav",

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:150:9
   }
 
   private getSoundPath(): string {
-    if (this.options.customSoundPath) {
+    if (true) {
       return path.resolve(this.options.customSoundPath);
     }
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: The "paths[0]" argument must be of type string. Received undefined

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:150:39
   }
 
   private getSoundPath(): string {
-    if (this.options.customSoundPath) {
-      return path.resolve(this.options.customSoundPath);
-    }
+    if (this.options.customSoundPath) {}
     return path.resolve(process.cwd(), "assets", "sounds", "mutant_hunter.wav");
   }
killedBy: DesktopNotifierAdapter unterstützt benutzerdefinierten Pfad für Mutant Hunter Sound
statusReason: expected "spy" to be called with arguments: [ StringContaining "custom" ]

Received: 

  1st spy call:

  Array [
-   StringContaining "custom",
