[Killed] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:22:30
 
     // 1. Report über die Domain-Grenze validieren und mappen
     const useCaseResult = this.publishUseCase.execute(report);
-    if (!useCaseResult.isOk) {
-      this.log.error(
-        `Fehler beim Verarbeiten des Reports: ${useCaseResult.error.message}`,
-      );
-      return;
-    }
+    if (!useCaseResult.isOk) {}
 
     // 2. Outbound-Adapter (Express/MCP) starten
killedBy: McpReporter sollte Fehler aus dem Use Case loggen und abbrechen
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:22:9
 
     // 1. Report über die Domain-Grenze validieren und mappen
     const useCaseResult = this.publishUseCase.execute(report);
-    if (!useCaseResult.isOk) {
+    if (true) {
       this.log.error(
         `Fehler beim Verarbeiten des Reports: ${useCaseResult.error.message}`,
killedBy: McpReporter sollte den Report verarbeiten, den Server starten und den Prozess offen halten
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/infrastructure/stryker/mcp-reporter.ts:31:9
 
     // 2. Outbound-Adapter (Express/MCP) starten
     const serverResult = await this.serverAdapter.start();
-    if (!serverResult.isOk) {
+    if (serverResult.isOk) {
       this.log.error(
         `MCP-Server konnte nicht gestartet werden: ${serverResult.error.message}`,
killedBy: McpReporter sollte den Report verarbeiten, den Server starten und den Prozess offen halten
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  Array [
-   "🚀 MCP Server läuft auf Port 3000! Warte auf KI-Verbindungen (Beenden mit Strg+C).",

[Killed] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:31:9
 
     // 2. Outbound-Adapter (Express/MCP) starten
     const serverResult = await this.serverAdapter.start();
-    if (!serverResult.isOk) {
+    if (false) {
       this.log.error(
         `MCP-Server konnte nicht gestartet werden: ${serverResult.error.message}`,
killedBy: McpReporter sollte Fehler beim Server-Start loggen und abbrechen (NoCoverage behoben)
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0
