[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:26:9
 
     const strykerConfig: PartialStrykerOptions = {};
 
-    if (options?.mutate && options.mutate.length > 0) {
+    if (false) {
       strykerConfig.mutate = options.mutate;
     }
killedBy: StrykerCliRunnerAdapter führt Stryker programmatisch aus und gibt das ok-Result mit dem Report zurück
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] OptionalChaining
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:26:9
 
     const strykerConfig: PartialStrykerOptions = {};
 
-    if (options?.mutate && options.mutate.length > 0) {
+    if (options.mutate && options.mutate.length > 0) {
       strykerConfig.mutate = options.mutate;
     }
killedBy: StrykerCliRunnerAdapter handhabt null rawResult und erzeugt ein valides MutationReport-Objekt mit files
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:29:9
     if (options?.mutate && options.mutate.length > 0) {
       strykerConfig.mutate = options.mutate;
     }
-    if (typeof options?.concurrency === "number" && options.concurrency > 0) {
+    if (false) {
       strykerConfig.concurrency = options.concurrency;
     }
killedBy: StrykerCliRunnerAdapter reicht alle Optionen (concurrency, reporters, testRunner, configFile) an Stryker weiter
statusReason: expected "spy" to be called with arguments: [ { mutate: [ 'src/app.ts' ], …(4) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] EqualityOperator
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:29:9
     if (options?.mutate && options.mutate.length > 0) {
       strykerConfig.mutate = options.mutate;
     }
-    if (typeof options?.concurrency === "number" && options.concurrency > 0) {
+    if (typeof options?.concurrency !== "number" && options.concurrency > 0) {
       strykerConfig.concurrency = options.concurrency;
     }
killedBy: StrykerCliRunnerAdapter reicht alle Optionen (concurrency, reporters, testRunner, configFile) an Stryker weiter
statusReason: expected "spy" to be called with arguments: [ { mutate: [ 'src/app.ts' ], …(4) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] EqualityOperator
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:32:31
     if (typeof options?.concurrency === "number" && options.concurrency > 0) {
       strykerConfig.concurrency = options.concurrency;
     }
-    if (options?.reporters && options.reporters.length > 0) {
+    if (options?.reporters && options.reporters.length <= 0) {
       strykerConfig.reporters = options.reporters;
     }
killedBy: StrykerCliRunnerAdapter reicht alle Optionen (concurrency, reporters, testRunner, configFile) an Stryker weiter
statusReason: expected "spy" to be called with arguments: [ { mutate: [ 'src/app.ts' ], …(4) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] OptionalChaining
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:32:9
     if (typeof options?.concurrency === "number" && options.concurrency > 0) {
       strykerConfig.concurrency = options.concurrency;
     }
-    if (options?.reporters && options.reporters.length > 0) {
+    if (options.reporters && options.reporters.length > 0) {
       strykerConfig.reporters = options.reporters;
     }
killedBy: StrykerCliRunnerAdapter handhabt null rawResult und erzeugt ein valides MutationReport-Objekt mit files
statusReason: Cannot read properties of undefined (reading 'reporters')

[Killed] OptionalChaining
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:35:9
     if (options?.reporters && options.reporters.length > 0) {
       strykerConfig.reporters = options.reporters;
     }
-    if (options?.testRunner) {
+    if (options.testRunner) {
       strykerConfig.testRunner = options.testRunner;
     }
killedBy: StrykerCliRunnerAdapter handhabt null rawResult und erzeugt ein valides MutationReport-Objekt mit files
statusReason: Cannot read properties of undefined (reading 'testRunner')

[Killed] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:35:30
     if (options?.reporters && options.reporters.length > 0) {
       strykerConfig.reporters = options.reporters;
     }
-    if (options?.testRunner) {
-      strykerConfig.testRunner = options.testRunner;
-    }
+    if (options?.testRunner) {}
     if (options?.configFile) {
       strykerConfig.configFile = options.configFile;
killedBy: StrykerCliRunnerAdapter reicht alle Optionen (concurrency, reporters, testRunner, configFile) an Stryker weiter
statusReason: expected "spy" to be called with arguments: [ { mutate: [ 'src/app.ts' ], …(4) } ]

Received: 

  1st spy call:

  Array [
    Object {

[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:38:9
     if (options?.testRunner) {
       strykerConfig.testRunner = options.testRunner;
     }
-    if (options?.configFile) {
+    if (true) {
       strykerConfig.configFile = options.configFile;
     }
killedBy: StrykerCliRunnerAdapter handhabt null rawResult und erzeugt ein valides MutationReport-Objekt mit files
statusReason: Cannot read properties of undefined (reading 'configFile')

[Killed] OptionalChaining
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:38:9
     if (options?.testRunner) {
       strykerConfig.testRunner = options.testRunner;
     }
-    if (options?.configFile) {
+    if (options.configFile) {
       strykerConfig.configFile = options.configFile;
     }
killedBy: StrykerCliRunnerAdapter handhabt null rawResult und erzeugt ein valides MutationReport-Objekt mit files
statusReason: Cannot read properties of undefined (reading 'configFile')

[Killed] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:42:9
       strykerConfig.configFile = options.configFile;
     }
 
-    try {
-      let strykerInstance: StrykerInstance;
-
-      if (this.strykerFactory) {
-        strykerInstance = this.strykerFactory(strykerConfig);
-      } else {
-        const { Stryker } = await import("@stryker-mutator/core");
-        strykerInstance = new (Stryker as any)(strykerConfig);
-      }
-
-      const rawResult = await strykerInstance.runMutationTest();
-
-      this.logger.info("Programmatischer Stryker Mutationstest-Lauf erfolgreich abgeschlossen.");
-
-      const report: MutationReport = (rawResult as MutationReport) || { files: {} };
-      return ok(report);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error("Fehler bei der Ausführung von Stryker Mutationstests:", error as Error);
       const errorMessage = error instanceof Error ? error.message : String(error);
killedBy: StrykerCliRunnerAdapter führt Stryker programmatisch aus und gibt das ok-Result mit dem Report zurück
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:45:11
     try {
       let strykerInstance: StrykerInstance;
 
-      if (this.strykerFactory) {
+      if (false) {
         strykerInstance = this.strykerFactory(strykerConfig);
       } else {
killedBy: StrykerCliRunnerAdapter führt Stryker programmatisch aus und gibt das ok-Result mit dem Report zurück
statusReason: expected { files: {} } to deeply equal { files: { 'src/app.ts': { …(1) } } }

[Killed] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:45:32
     try {
       let strykerInstance: StrykerInstance;
 
-      if (this.strykerFactory) {
-        strykerInstance = this.strykerFactory(strykerConfig);
-      } else {
+      if (this.strykerFactory) {} else {
         const { Stryker } = await import("@stryker-mutator/core");
         strykerInstance = new (Stryker as any)(strykerConfig);
killedBy: StrykerCliRunnerAdapter führt Stryker programmatisch aus und gibt das ok-Result mit dem Report zurück
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:47:14
 
       if (this.strykerFactory) {
         strykerInstance = this.strykerFactory(strykerConfig);
-      } else {
-        const { Stryker } = await import("@stryker-mutator/core");
-        strykerInstance = new (Stryker as any)(strykerConfig);
-      }
+      } else {}
 
       const rawResult = await strykerInstance.runMutationTest();
killedBy: StrykerCliRunnerAdapter nutzt den dynamischen Import von @stryker-mutator/core wenn keine Factory übergeben wird
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:56:38
 
       this.logger.info("Programmatischer Stryker Mutationstest-Lauf erfolgreich abgeschlossen.");
 
-      const report: MutationReport = (rawResult as MutationReport) || { files: {} };
+      const report: MutationReport = true;
       return ok(report);
     } catch (error) {
killedBy: StrykerCliRunnerAdapter führt Stryker programmatisch aus und gibt das ok-Result mit dem Report zurück
statusReason: expected true to deeply equal { files: { 'src/app.ts': { …(1) } } }

[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:56:38
 
       this.logger.info("Programmatischer Stryker Mutationstest-Lauf erfolgreich abgeschlossen.");
 
-      const report: MutationReport = (rawResult as MutationReport) || { files: {} };
+      const report: MutationReport = false;
       return ok(report);
     } catch (error) {
killedBy: StrykerCliRunnerAdapter führt Stryker programmatisch aus und gibt das ok-Result mit dem Report zurück
statusReason: expected false to deeply equal { files: { 'src/app.ts': { …(1) } } }

[Killed] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:58:21
 
       const report: MutationReport = (rawResult as MutationReport) || { files: {} };
       return ok(report);
-    } catch (error) {
-      this.logger.error("Fehler bei der Ausführung von Stryker Mutationstests:", error as Error);
-      const errorMessage = error instanceof Error ? error.message : String(error);
-      return err(new Error(errorMessage));
-    }
+    } catch (error) {}
   }
 }
killedBy: StrykerCliRunnerAdapter fängt Fehler bei der Stryker-Ausführung ab und gibt ein err-Result zurück
statusReason: Cannot read properties of undefined (reading 'isOk')
