[Killed] ArrowFunction
src/core/domain/result.ts:5:19
   | { readonly isOk: true; readonly value: T; readonly error?: never }
   | { readonly isOk: false; readonly value?: never; readonly error: E };
 
-export const ok = <T>(value: T): Result<T, never> => ({ isOk: true, value });
+export const ok = () => undefined;
 export const err = <E>(error: E): Result<never, E> => ({ isOk: false, error });
 
killedBy: McpServerAdapter sollte den Server erfolgreich starten und ein ok-Result zurückgeben
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/core/domain/result.ts:5:63
   | { readonly isOk: true; readonly value: T; readonly error?: never }
   | { readonly isOk: false; readonly value?: never; readonly error: E };
 
-export const ok = <T>(value: T): Result<T, never> => ({ isOk: true, value });
+export const ok = <T>(value: T): Result<T, never> => ({ isOk: false, value });
 export const err = <E>(error: E): Result<never, E> => ({ isOk: false, error });
 
killedBy: StrykerCliRunnerAdapter führt Stryker programmatisch aus und gibt das ok-Result mit dem Report zurück
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/domain/result.ts:6:64
   | { readonly isOk: false; readonly value?: never; readonly error: E };
 
 export const ok = <T>(value: T): Result<T, never> => ({ isOk: true, value });
-export const err = <E>(error: E): Result<never, E> => ({ isOk: false, error });
+export const err = <E>(error: E): Result<never, E> => ({ isOk: true, error });
 
killedBy: StrykerCliRunnerAdapter fängt Fehler bei der Stryker-Ausführung ab und gibt ein err-Result zurück
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/core/domain/result.ts:6:20
   | { readonly isOk: false; readonly value?: never; readonly error: E };
 
 export const ok = <T>(value: T): Result<T, never> => ({ isOk: true, value });
-export const err = <E>(error: E): Result<never, E> => ({ isOk: false, error });
+export const err = () => undefined;
 
killedBy: McpReporter sollte Fehler aus dem Use Case loggen und abbrechen
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0
