[Killed] BlockStatement
src/core/application/detect-equivalent-mutants.use-case.ts:14:72
 }
 
 export class DetectEquivalentMutantsUseCase {
-  public execute(mutants: MutantDetail[]): EquivalentMutantDetection[] {
-    const survivedMutants = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
-    );
-
-    return survivedMutants.map((mutant) => this.analyzeMutant(mutant));
-  }
+  public execute(mutants: MutantDetail[]): EquivalentMutantDetection[] {}
 
   private analyzeMutant(mutant: MutantDetail): EquivalentMutantDetection {
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: Target cannot be null or undefined.

[Killed] MethodExpression
src/core/application/detect-equivalent-mutants.use-case.ts:15:29
 
 export class DetectEquivalentMutantsUseCase {
   public execute(mutants: MutantDetail[]): EquivalentMutantDetection[] {
-    const survivedMutants = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
-    );
+    const survivedMutants = mutants;
 
     return survivedMutants.map((mutant) => this.analyzeMutant(mutant));
killedBy: DetectEquivalentMutantsUseCase should only analyze Survived and NoCoverage mutants
statusReason: expected [ { mutantId: '1', …(6) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/core/application/detect-equivalent-mutants.use-case.ts:16:41
 export class DetectEquivalentMutantsUseCase {
   public execute(mutants: MutantDetail[]): EquivalentMutantDetection[] {
     const survivedMutants = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
+      (m) => m.status === "Survived" || false,
     );
 
killedBy: DetectEquivalentMutantsUseCase should only analyze Survived and NoCoverage mutants
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/core/application/detect-equivalent-mutants.use-case.ts:16:14
 export class DetectEquivalentMutantsUseCase {
   public execute(mutants: MutantDetail[]): EquivalentMutantDetection[] {
     const survivedMutants = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
+      (m) => m.status !== "Survived" || m.status === "NoCoverage",
     );
 
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/core/application/detect-equivalent-mutants.use-case.ts:19:32
       (m) => m.status === "Survived" || m.status === "NoCoverage",
     );
 
-    return survivedMutants.map((mutant) => this.analyzeMutant(mutant));
+    return survivedMutants.map(() => undefined);
   }
 
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: Cannot read properties of undefined (reading 'isLikelyEquivalent')

[Killed] LogicalOperator
src/core/application/detect-equivalent-mutants.use-case.ts:23:25
   }
 
   private analyzeMutant(mutant: MutantDetail): EquivalentMutantDetection {
-    const mutatorName = mutant.mutatorName || "Unknown";
+    const mutatorName = mutant.mutatorName && "Unknown";
     const replacement = mutant.replacement || "";
 
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/detect-equivalent-mutants.use-case.ts:23:25
   }
 
   private analyzeMutant(mutant: MutantDetail): EquivalentMutantDetection {
-    const mutatorName = mutant.mutatorName || "Unknown";
+    const mutatorName = false;
     const replacement = mutant.replacement || "";
 
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/application/detect-equivalent-mutants.use-case.ts:24:25
 
   private analyzeMutant(mutant: MutantDetail): EquivalentMutantDetection {
     const mutatorName = mutant.mutatorName || "Unknown";
-    const replacement = mutant.replacement || "";
+    const replacement = mutant.replacement && "";
 
     let isLikelyEquivalent = false;
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/detect-equivalent-mutants.use-case.ts:24:25
 
   private analyzeMutant(mutant: MutantDetail): EquivalentMutantDetection {
     const mutatorName = mutant.mutatorName || "Unknown";
-    const replacement = mutant.replacement || "";
+    const replacement = true;
 
     let isLikelyEquivalent = false;
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/application/detect-equivalent-mutants.use-case.ts:26:30
     const mutatorName = mutant.mutatorName || "Unknown";
     const replacement = mutant.replacement || "";
 
-    let isLikelyEquivalent = false;
+    let isLikelyEquivalent = true;
     let reason: string | undefined = undefined;
     let suggestedSuppressionComment: string | undefined = undefined;
killedBy: DetectEquivalentMutantsUseCase should not flag other mutators as equivalent by default
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/application/detect-equivalent-mutants.use-case.ts:30:47
     let reason: string | undefined = undefined;
     let suggestedSuppressionComment: string | undefined = undefined;
 
-    if (mutatorName === "EqualityOperator" && replacement === "==") {
+    if (mutatorName === "EqualityOperator" && replacement !== "==") {
       isLikelyEquivalent = true;
       reason = "Loose equality (==) is often functionally equivalent to strict equality (===) when the operands are type-checked by TypeScript.";
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/detect-equivalent-mutants.use-case.ts:30:69
     let reason: string | undefined = undefined;
     let suggestedSuppressionComment: string | undefined = undefined;
 
-    if (mutatorName === "EqualityOperator" && replacement === "==") {
-      isLikelyEquivalent = true;
-      reason = "Loose equality (==) is often functionally equivalent to strict equality (===) when the operands are type-checked by TypeScript.";
-      suggestedSuppressionComment = "// @stryker-disable-next-line EqualityOperator: TypeScript already enforces type safety here, so == is equivalent to ===";
-    }
+    if (mutatorName === "EqualityOperator" && replacement === "==") {}
 
     // Update Operator (i++ to ++i)
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/application/detect-equivalent-mutants.use-case.ts:31:28
     let suggestedSuppressionComment: string | undefined = undefined;
 
     if (mutatorName === "EqualityOperator" && replacement === "==") {
-      isLikelyEquivalent = true;
+      isLikelyEquivalent = false;
       reason = "Loose equality (==) is often functionally equivalent to strict equality (===) when the operands are type-checked by TypeScript.";
       suggestedSuppressionComment = "// @stryker-disable-next-line EqualityOperator: TypeScript already enforces type safety here, so == is equivalent to ===";
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/detect-equivalent-mutants.use-case.ts:37:95
     }
 
     // Update Operator (i++ to ++i)
-    if (mutatorName === "UpdateOperator" && (replacement === "++x" || replacement === "--x")) {
-      isLikelyEquivalent = true;
-      reason = "Pre-increment/decrement is often equivalent to post-increment/decrement if the return value of the expression is not used.";
-      suggestedSuppressionComment = "// @stryker-disable-next-line UpdateOperator: The return value of this update operation is unused, making pre/post equivalent";
-    }
+    if (mutatorName === "UpdateOperator" && (replacement === "++x" || replacement === "--x")) {}
 
     return {
killedBy: DetectEquivalentMutantsUseCase should flag UpdateOperator mutated to ++x as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/application/detect-equivalent-mutants.use-case.ts:37:46
     }
 
     // Update Operator (i++ to ++i)
-    if (mutatorName === "UpdateOperator" && (replacement === "++x" || replacement === "--x")) {
+    if (mutatorName === "UpdateOperator" && (replacement !== "++x" || replacement === "--x")) {
       isLikelyEquivalent = true;
       reason = "Pre-increment/decrement is often equivalent to post-increment/decrement if the return value of the expression is not used.";
killedBy: DetectEquivalentMutantsUseCase should flag UpdateOperator mutated to ++x as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/application/detect-equivalent-mutants.use-case.ts:38:28
 
     // Update Operator (i++ to ++i)
     if (mutatorName === "UpdateOperator" && (replacement === "++x" || replacement === "--x")) {
-      isLikelyEquivalent = true;
+      isLikelyEquivalent = false;
       reason = "Pre-increment/decrement is often equivalent to post-increment/decrement if the return value of the expression is not used.";
       suggestedSuppressionComment = "// @stryker-disable-next-line UpdateOperator: The return value of this update operation is unused, making pre/post equivalent";
killedBy: DetectEquivalentMutantsUseCase should flag UpdateOperator mutated to ++x as likely equivalent
statusReason: expected false to be true // Object.is equality
