[Killed] BlockStatement
src/core/application/execute-mutant-kill.use-case.ts:13:87
 }
 
 export class ExecuteMutantKillUseCase {
-  public execute(report: MutationReport, mutantId: string): MutantKillScaffold | null {
-    if (!report.files) {
-      return null;
-    }
-
-    for (const [filePath, fileResult] of Object.entries(report.files)) {
-      if (!fileResult.mutants) continue;
-
-      const mutant = fileResult.mutants.find((m) => m.id === mutantId);
-      if (mutant) {
-        return this.generateScaffold(filePath, fileResult.source, mutant);
-      }
-    }
-
-    return null;
-  }
+  public execute(report: MutationReport, mutantId: string): MutantKillScaffold | null {}
 
   private generateScaffold(
killedBy: ExecuteMutantKillUseCase should return null if report files are undefined
statusReason: expected undefined to be null

[Killed] BooleanLiteral
src/core/application/execute-mutant-kill.use-case.ts:14:9
 
 export class ExecuteMutantKillUseCase {
   public execute(report: MutationReport, mutantId: string): MutantKillScaffold | null {
-    if (!report.files) {
+    if (report.files) {
       return null;
     }
killedBy: ExecuteMutantKillUseCase should return null if report files are undefined
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:14:9
 
 export class ExecuteMutantKillUseCase {
   public execute(report: MutationReport, mutantId: string): MutantKillScaffold | null {
-    if (!report.files) {
+    if (true) {
       return null;
     }
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected null not to be null

[Killed] BlockStatement
src/core/application/execute-mutant-kill.use-case.ts:18:72
       return null;
     }
 
-    for (const [filePath, fileResult] of Object.entries(report.files)) {
-      if (!fileResult.mutants) continue;
-
-      const mutant = fileResult.mutants.find((m) => m.id === mutantId);
-      if (mutant) {
-        return this.generateScaffold(filePath, fileResult.source, mutant);
-      }
-    }
+    for (const [filePath, fileResult] of Object.entries(report.files)) {}
 
     return null;
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:19:11
     }
 
     for (const [filePath, fileResult] of Object.entries(report.files)) {
-      if (!fileResult.mutants) continue;
+      if (true) continue;
 
       const mutant = fileResult.mutants.find((m) => m.id === mutantId);
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:19:11
     }
 
     for (const [filePath, fileResult] of Object.entries(report.files)) {
-      if (!fileResult.mutants) continue;
+      if (false) continue;
 
       const mutant = fileResult.mutants.find((m) => m.id === mutantId);
killedBy: ExecuteMutantKillUseCase should handle files with no mutants
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:21:53
     for (const [filePath, fileResult] of Object.entries(report.files)) {
       if (!fileResult.mutants) continue;
 
-      const mutant = fileResult.mutants.find((m) => m.id === mutantId);
+      const mutant = fileResult.mutants.find((m) => true);
       if (mutant) {
         return this.generateScaffold(filePath, fileResult.source, mutant);
killedBy: ExecuteMutantKillUseCase should return null if mutant is not found
statusReason: expected { mutantId: '2', …(5) } to be null

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:21:53
     for (const [filePath, fileResult] of Object.entries(report.files)) {
       if (!fileResult.mutants) continue;
 
-      const mutant = fileResult.mutants.find((m) => m.id === mutantId);
+      const mutant = fileResult.mutants.find((m) => false);
       if (mutant) {
         return this.generateScaffold(filePath, fileResult.source, mutant);
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected null not to be null

[Killed] BlockStatement
src/core/application/execute-mutant-kill.use-case.ts:22:19
       if (!fileResult.mutants) continue;
 
       const mutant = fileResult.mutants.find((m) => m.id === mutantId);
-      if (mutant) {
-        return this.generateScaffold(filePath, fileResult.source, mutant);
-      }
+      if (mutant) {}
     }
 
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:22:11
       if (!fileResult.mutants) continue;
 
       const mutant = fileResult.mutants.find((m) => m.id === mutantId);
-      if (mutant) {
+      if (true) {
         return this.generateScaffold(filePath, fileResult.source, mutant);
       }
killedBy: ExecuteMutantKillUseCase should return null if mutant is not found
statusReason: Cannot read properties of undefined (reading 'location')

[Killed] OptionalChaining
src/core/application/execute-mutant-kill.use-case.ts:35:51
     source: string,
     mutant: MutantDetail
   ): MutantKillScaffold {
-    const originalCode = this.extractLine(source, mutant.location?.start.line);
+    const originalCode = this.extractLine(source, mutant.location.start.line);
     const mutatedCode = mutant.replacement || "/* unknown */";
     
killedBy: ExecuteMutantKillUseCase should handle missing location, replacement, and mutatorName
statusReason: Cannot read properties of undefined (reading 'start')

[Killed] LogicalOperator
src/core/application/execute-mutant-kill.use-case.ts:36:25
     mutant: MutantDetail
   ): MutantKillScaffold {
     const originalCode = this.extractLine(source, mutant.location?.start.line);
-    const mutatedCode = mutant.replacement || "/* unknown */";
+    const mutatedCode = mutant.replacement && "/* unknown */";
     
     // Very simple heuristic to generate a test stub
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected '/* unknown */' to be '-' // Object.is equality

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:36:25
     mutant: MutantDetail
   ): MutantKillScaffold {
     const originalCode = this.extractLine(source, mutant.location?.start.line);
-    const mutatedCode = mutant.replacement || "/* unknown */";
+    const mutatedCode = true;
     
     // Very simple heuristic to generate a test stub
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: mutatedCode.trim is not a function

[Killed] Regex
src/core/application/execute-mutant-kill.use-case.ts:39:44
     const mutatedCode = mutant.replacement || "/* unknown */";
     
     // Very simple heuristic to generate a test stub
-    const moduleNameMatch = filePath.match(/([a-zA-Z0-9_-]+)\.ts$/);
+    const moduleNameMatch = filePath.match(/([^a-zA-Z0-9_-]+)\.ts$/);
     const moduleName = moduleNameMatch ? moduleNameMatch[1] : "UnknownModule";
 
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected 'import { describe, it, expect } from …' to contain 'describe("app Mutant Kill"'

[Survived] MethodExpression
src/core/application/execute-mutant-kill.use-case.ts:42:35
     const moduleNameMatch = filePath.match(/([a-zA-Z0-9_-]+)\.ts$/);
     const moduleName = moduleNameMatch ? moduleNameMatch[1] : "UnknownModule";
 
-    const suggestedTestScaffold = `
-import { describe, it, expect } from "vitest";
-
-// Scaffold to kill mutant ${mutant.id} in ${filePath}
-// Original: ${originalCode.trim()}
-// Mutated:  ${mutatedCode.trim()}
-describe("${moduleName} Mutant Kill", () => {
-  it("should kill mutant ${mutant.id} by failing when ${mutant.mutatorName} is applied", () => {
-    // 1. Arrange: Set up the state to trigger the specific branch/logic.
-    // 2. Act: Call the function or method.
-    // 3. Assert: Verify the outcome is strictly tied to the original code, 
-    //    so the mutant (${mutatedCode.trim()}) produces a test failure.
-    expect(true).toBe(false); // TODO: implement
-  });
-});
-`.trim();
+    const suggestedTestScaffold = `
+import { describe, it, expect } from "vitest";
+
+// Scaffold to kill mutant ${mutant.id} in ${filePath}
+// Original: ${originalCode.trim()}
+// Mutated:  ${mutatedCode.trim()}
+describe("${moduleName} Mutant Kill", () => {
+  it("should kill mutant ${mutant.id} by failing when ${mutant.mutatorName} is applied", () => {
+    // 1. Arrange: Set up the state to trigger the specific branch/logic.
+    // 2. Act: Call the function or method.
+    // 3. Assert: Verify the outcome is strictly tied to the original code, 
+    //    so the mutant (${mutatedCode.trim()}) produces a test failure.
+    expect(true).toBe(false); // TODO: implement
+  });
+});
+`;
 
     return {

[Survived] MethodExpression
src/core/application/execute-mutant-kill.use-case.ts:46:16
 import { describe, it, expect } from "vitest";
 
 // Scaffold to kill mutant ${mutant.id} in ${filePath}
-// Original: ${originalCode.trim()}
+// Original: ${originalCode}
 // Mutated:  ${mutatedCode.trim()}
 describe("${moduleName} Mutant Kill", () => {

[Survived] MethodExpression
src/core/application/execute-mutant-kill.use-case.ts:47:16
 
 // Scaffold to kill mutant ${mutant.id} in ${filePath}
 // Original: ${originalCode.trim()}
-// Mutated:  ${mutatedCode.trim()}
+// Mutated:  ${mutatedCode}
 describe("${moduleName} Mutant Kill", () => {
   it("should kill mutant ${mutant.id} by failing when ${mutant.mutatorName} is applied", () => {

[Survived] MethodExpression
src/core/application/execute-mutant-kill.use-case.ts:53:28
     // 1. Arrange: Set up the state to trigger the specific branch/logic.
     // 2. Act: Call the function or method.
     // 3. Assert: Verify the outcome is strictly tied to the original code, 
-    //    so the mutant (${mutatedCode.trim()}) produces a test failure.
+    //    so the mutant (${mutatedCode}) produces a test failure.
     expect(true).toBe(false); // TODO: implement
   });

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:62:20
     return {
       mutantId: mutant.id,
       filePath,
-      mutatorName: mutant.mutatorName || "Unknown",
+      mutatorName: true,
       originalCode,
       mutatedCode,
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected true to be 'ArithmeticOperator' // Object.is equality

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:62:20
     return {
       mutantId: mutant.id,
       filePath,
-      mutatorName: mutant.mutatorName || "Unknown",
+      mutatorName: false,
       originalCode,
       mutatedCode,
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected false to be 'ArithmeticOperator' // Object.is equality

[Killed] BlockStatement
src/core/application/execute-mutant-kill.use-case.ts:69:68
     };
   }
 
-  private extractLine(source: string, lineNumber?: number): string {
-    if (lineNumber === undefined) return "/* line unknown */";
-    const lines = source.split("\n");
-    if (lineNumber < 1 || lineNumber > lines.length) return "/* line out of bounds */";
-    return lines[lineNumber - 1];
-  }
+  private extractLine(source: string, lineNumber?: number): string {}
 }
 
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/core/application/execute-mutant-kill.use-case.ts:70:9
   }
 
   private extractLine(source: string, lineNumber?: number): string {
-    if (lineNumber === undefined) return "/* line unknown */";
+    if (false) return "/* line unknown */";
     const lines = source.split("\n");
     if (lineNumber < 1 || lineNumber > lines.length) return "/* line out of bounds */";
killedBy: ExecuteMutantKillUseCase should handle missing location, replacement, and mutatorName
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
src/core/application/execute-mutant-kill.use-case.ts:70:9
   }
 
   private extractLine(source: string, lineNumber?: number): string {
-    if (lineNumber === undefined) return "/* line unknown */";
+    if (lineNumber !== undefined) return "/* line unknown */";
     const lines = source.split("\n");
     if (lineNumber < 1 || lineNumber > lines.length) return "/* line out of bounds */";
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected '/* line unknown */' to be 'const y = 2;' // Object.is equality

[Killed] EqualityOperator
src/core/application/execute-mutant-kill.use-case.ts:72:9
   private extractLine(source: string, lineNumber?: number): string {
     if (lineNumber === undefined) return "/* line unknown */";
     const lines = source.split("\n");
-    if (lineNumber < 1 || lineNumber > lines.length) return "/* line out of bounds */";
+    if (lineNumber >= 1 || lineNumber > lines.length) return "/* line out of bounds */";
     return lines[lineNumber - 1];
   }
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected '/* line out of bounds */' to be 'const y = 2;' // Object.is equality

[Killed] EqualityOperator
src/core/application/execute-mutant-kill.use-case.ts:72:27
   private extractLine(source: string, lineNumber?: number): string {
     if (lineNumber === undefined) return "/* line unknown */";
     const lines = source.split("\n");
-    if (lineNumber < 1 || lineNumber > lines.length) return "/* line out of bounds */";
+    if (lineNumber < 1 || lineNumber >= lines.length) return "/* line out of bounds */";
     return lines[lineNumber - 1];
   }
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: expected '/* line out of bounds */' to be 'const y = 2;' // Object.is equality

[Killed] ArithmeticOperator
src/core/application/execute-mutant-kill.use-case.ts:73:18
     if (lineNumber === undefined) return "/* line unknown */";
     const lines = source.split("\n");
     if (lineNumber < 1 || lineNumber > lines.length) return "/* line out of bounds */";
-    return lines[lineNumber - 1];
+    return lines[lineNumber + 1];
   }
 }
killedBy: ExecuteMutantKillUseCase should generate a scaffold for a valid mutant
statusReason: Cannot read properties of undefined (reading 'trim')
