[Killed] LogicalOperator
src/core/application/predict-mutation-impact.use-case.ts:17:9
       let reason = "Routine file change.";
 
       if (
-        file.includes("use-case") ||
-        file.includes("domain") ||
+        file.includes("use-case") && file.includes("domain") ||
         file.includes("adapter")
       ) {
killedBy: PredictMutationImpactUseCase should categorize core domain, use-case, and adapter files as HIGH risk
statusReason: expected 'LOW' to be 'HIGH' // Object.is equality

[Killed] LogicalOperator
src/core/application/predict-mutation-impact.use-case.ts:17:9
       let reason = "Routine file change.";
 
       if (
-        file.includes("use-case") ||
-        file.includes("domain") ||
-        file.includes("adapter")
+        (file.includes("use-case") || file.includes("domain")) && file.includes("adapter")
       ) {
         riskLevel = "HIGH";
killedBy: PredictMutationImpactUseCase should categorize core domain, use-case, and adapter files as HIGH risk
statusReason: expected 'LOW' to be 'HIGH' // Object.is equality

[Killed] BlockStatement
src/core/application/predict-mutation-impact.use-case.ts:20:9
         file.includes("use-case") ||
         file.includes("domain") ||
         file.includes("adapter")
-      ) {
-        riskLevel = "HIGH";
-        estimatedMutantCount = 25;
-        reason =
-          "Core business or adapter logic contains complex branching and assertions.";
-      } else if (
+      ) {} else if (
         file.includes("config") ||
         file.includes("util") ||
killedBy: PredictMutationImpactUseCase should categorize core domain, use-case, and adapter files as HIGH risk
statusReason: expected 'LOW' to be 'HIGH' // Object.is equality

[Killed] ConditionalExpression
src/core/application/predict-mutation-impact.use-case.ts:26:9
         reason =
           "Core business or adapter logic contains complex branching and assertions.";
       } else if (
-        file.includes("config") ||
-        file.includes("util") ||
-        file.includes("helper")
+        true
       ) {
         riskLevel = "MEDIUM";
killedBy: PredictMutationImpactUseCase should categorize generic files as LOW risk
statusReason: expected 'MEDIUM' to be 'LOW' // Object.is equality

[Killed] LogicalOperator
src/core/application/predict-mutation-impact.use-case.ts:26:9
         reason =
           "Core business or adapter logic contains complex branching and assertions.";
       } else if (
-        file.includes("config") ||
-        file.includes("util") ||
+        file.includes("config") && file.includes("util") ||
         file.includes("helper")
       ) {
killedBy: PredictMutationImpactUseCase should categorize helper, config, and util files as MEDIUM risk
statusReason: expected 'LOW' to be 'MEDIUM' // Object.is equality

[Killed] BlockStatement
src/core/application/predict-mutation-impact.use-case.ts:29:9
         file.includes("config") ||
         file.includes("util") ||
         file.includes("helper")
-      ) {
-        riskLevel = "MEDIUM";
-        estimatedMutantCount = 12;
-        reason =
-          "Utility functions and configurations require boundary condition assertions.";
-      }
+      ) {}
 
       return {
killedBy: PredictMutationImpactUseCase should categorize helper, config, and util files as MEDIUM risk
statusReason: expected 'LOW' to be 'MEDIUM' // Object.is equality

[Killed] ObjectLiteral
src/core/application/predict-mutation-impact.use-case.ts:36:14
           "Utility functions and configurations require boundary condition assertions.";
       }
 
-      return {
-        filePath: file,
-        riskLevel,
-        estimatedMutantCount,
-        reason,
-      };
+      return {};
     });
   }
killedBy: PredictMutationImpactUseCase should categorize core domain, use-case, and adapter files as HIGH risk
statusReason: expected undefined to be 'HIGH' // Object.is equality
