[Killed] ArrayDeclaration
src/core/domain/risk-score-calculator.ts:19:48
 }
 
 export class RiskScoreCalculator {
-  private static readonly HIGH_RISK_KEYWORDS = [
-    "auth",
-    "security",
-    "crypto",
-    "validator",
-    "guard",
-    "token",
-    "password",
-  ];
+  private static readonly HIGH_RISK_KEYWORDS = [];
   private static readonly MEDIUM_RISK_KEYWORDS = [
     "service",
killedBy: RiskScoreCalculator should determine MEDIUM level correctly (score 5-19)
statusReason: expected 10 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:36:9
   ];
 
   public calculate(report: MutationReport): RiskAnalysis {
-    if (!report.files) {
+    if (true) {
       return {
         score: 0,
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected +0 to be 4 // Object.is equality

[Killed] BlockStatement
src/core/domain/risk-score-calculator.ts:36:24
   ];
 
   public calculate(report: MutationReport): RiskAnalysis {
-    if (!report.files) {
-      return {
-        score: 0,
-        level: RiskLevel.LOW,
-        highRiskFiles: [],
-        survivingMutants: 0,
-        criticalFilesCount: 0,
-      };
-    }
+    if (!report.files) {}
 
     let totalScore = 0;
killedBy: RiskScoreCalculator should return score 0 and LOW risk for undefined files
statusReason: Cannot convert undefined or null to object

[Killed] ObjectLiteral
src/core/domain/risk-score-calculator.ts:37:14
 
   public calculate(report: MutationReport): RiskAnalysis {
     if (!report.files) {
-      return {
-        score: 0,
-        level: RiskLevel.LOW,
-        highRiskFiles: [],
-        survivingMutants: 0,
-        criticalFilesCount: 0,
-      };
+      return {};
     }
 
killedBy: RiskScoreCalculator should return score 0 and LOW risk for undefined files
statusReason: expected undefined to be +0 // Object.is equality

[Survived] ArrayDeclaration
src/core/domain/risk-score-calculator.ts:40:24
       return {
         score: 0,
         level: RiskLevel.LOW,
-        highRiskFiles: [],
+        highRiskFiles: ["Stryker was here"],
         survivingMutants: 0,
         criticalFilesCount: 0,

[Killed] BlockStatement
src/core/domain/risk-score-calculator.ts:50:72
     let totalSurviving = 0;
     const highRiskFiles = new Set<string>();
 
-    for (const [filePath, fileResult] of Object.entries(report.files)) {
-      if (!fileResult.mutants) continue;
-
-      const survivedMutants = fileResult.mutants.filter(
-        (m) => m.status === "Survived",
-      );
-      if (survivedMutants.length === 0) continue;
-
-      totalSurviving += survivedMutants.length;
-      const fileWeight = this.getFileWeight(filePath);
-      const fileRiskScore = survivedMutants.length * fileWeight;
-
-      totalScore += fileRiskScore;
-
-      if (fileWeight >= 5) {
-        highRiskFiles.add(filePath);
-      }
-    }
+    for (const [filePath, fileResult] of Object.entries(report.files)) {}
 
     return {
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected +0 to be 4 // Object.is equality

[Killed] BooleanLiteral
src/core/domain/risk-score-calculator.ts:51:11
     const highRiskFiles = new Set<string>();
 
     for (const [filePath, fileResult] of Object.entries(report.files)) {
-      if (!fileResult.mutants) continue;
+      if (fileResult.mutants) continue;
 
       const survivedMutants = fileResult.mutants.filter(
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected +0 to be 4 // Object.is equality

[Killed] MethodExpression
src/core/domain/risk-score-calculator.ts:53:31
     for (const [filePath, fileResult] of Object.entries(report.files)) {
       if (!fileResult.mutants) continue;
 
-      const survivedMutants = fileResult.mutants.filter(
-        (m) => m.status === "Survived",
-      );
+      const survivedMutants = fileResult.mutants;
       if (survivedMutants.length === 0) continue;
 
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 5 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:54:16
       if (!fileResult.mutants) continue;
 
       const survivedMutants = fileResult.mutants.filter(
-        (m) => m.status === "Survived",
+        (m) => true,
       );
       if (survivedMutants.length === 0) continue;
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 5 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:54:16
       if (!fileResult.mutants) continue;
 
       const survivedMutants = fileResult.mutants.filter(
-        (m) => m.status === "Survived",
+        (m) => false,
       );
       if (survivedMutants.length === 0) continue;
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected +0 to be 4 // Object.is equality

[Killed] EqualityOperator
src/core/domain/risk-score-calculator.ts:56:11
       const survivedMutants = fileResult.mutants.filter(
         (m) => m.status === "Survived",
       );
-      if (survivedMutants.length === 0) continue;
+      if (survivedMutants.length !== 0) continue;
 
       totalSurviving += survivedMutants.length;
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected +0 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:56:11
       const survivedMutants = fileResult.mutants.filter(
         (m) => m.status === "Survived",
       );
-      if (survivedMutants.length === 0) continue;
+      if (true) continue;
 
       totalSurviving += survivedMutants.length;
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected +0 to be 4 // Object.is equality

[Survived] AssignmentOperator
src/core/domain/risk-score-calculator.ts:58:7
       );
       if (survivedMutants.length === 0) continue;
 
-      totalSurviving += survivedMutants.length;
+      totalSurviving -= survivedMutants.length;
       const fileWeight = this.getFileWeight(filePath);
       const fileRiskScore = survivedMutants.length * fileWeight;

[Killed] ArithmeticOperator
src/core/domain/risk-score-calculator.ts:60:29
 
       totalSurviving += survivedMutants.length;
       const fileWeight = this.getFileWeight(filePath);
-      const fileRiskScore = survivedMutants.length * fileWeight;
+      const fileRiskScore = survivedMutants.length / fileWeight;
 
       totalScore += fileRiskScore;
killedBy: RiskScoreCalculator should determine MEDIUM level correctly (score 5-19)
statusReason: expected 0.30000000000000004 to be 15 // Object.is equality

[Killed] AssignmentOperator
src/core/domain/risk-score-calculator.ts:62:7
       const fileWeight = this.getFileWeight(filePath);
       const fileRiskScore = survivedMutants.length * fileWeight;
 
-      totalScore += fileRiskScore;
+      totalScore -= fileRiskScore;
 
       if (fileWeight >= 5) {
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected -4 to be 4 // Object.is equality

[Survived] EqualityOperator
src/core/domain/risk-score-calculator.ts:64:11
 
       totalScore += fileRiskScore;
 
-      if (fileWeight >= 5) {
+      if (fileWeight > 5) {
         highRiskFiles.add(filePath);
       }

[Survived] ConditionalExpression
src/core/domain/risk-score-calculator.ts:64:11
 
       totalScore += fileRiskScore;
 
-      if (fileWeight >= 5) {
+      if (true) {
         highRiskFiles.add(filePath);
       }

[Killed] ObjectLiteral
src/core/domain/risk-score-calculator.ts:69:12
       }
     }
 
-    return {
-      score: totalScore,
-      level: this.determineLevel(totalScore),
-      highRiskFiles: Array.from(highRiskFiles),
-      survivingMutants: totalSurviving,
-      criticalFilesCount: highRiskFiles.size,
-    };
+    return {};
   }
 
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
src/core/domain/risk-score-calculator.ts:78:51
     };
   }
 
-  private getFileWeight(filePath: string): number {
-    const lowerPath = filePath.toLowerCase();
-
-    for (const keyword of RiskScoreCalculator.HIGH_RISK_KEYWORDS) {
-      if (lowerPath.includes(keyword)) {
-        return 10;
-      }
-    }
-
-    for (const keyword of RiskScoreCalculator.MEDIUM_RISK_KEYWORDS) {
-      if (lowerPath.includes(keyword)) {
-        return 5;
-      }
-    }
-
-    return 1;
-  }
+  private getFileWeight(filePath: string): number {}
 
   private determineLevel(score: number): RiskLevel {
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected NaN to be 4 // Object.is equality

[Killed] MethodExpression
src/core/domain/risk-score-calculator.ts:79:23
   }
 
   private getFileWeight(filePath: string): number {
-    const lowerPath = filePath.toLowerCase();
+    const lowerPath = filePath.toUpperCase();
 
     for (const keyword of RiskScoreCalculator.HIGH_RISK_KEYWORDS) {
killedBy: RiskScoreCalculator should determine MEDIUM level correctly (score 5-19)
statusReason: expected 2 to be 15 // Object.is equality

[Killed] BlockStatement
src/core/domain/risk-score-calculator.ts:81:67
   private getFileWeight(filePath: string): number {
     const lowerPath = filePath.toLowerCase();
 
-    for (const keyword of RiskScoreCalculator.HIGH_RISK_KEYWORDS) {
-      if (lowerPath.includes(keyword)) {
-        return 10;
-      }
-    }
+    for (const keyword of RiskScoreCalculator.HIGH_RISK_KEYWORDS) {}
 
     for (const keyword of RiskScoreCalculator.MEDIUM_RISK_KEYWORDS) {
killedBy: RiskScoreCalculator should determine MEDIUM level correctly (score 5-19)
statusReason: expected 10 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:82:11
     const lowerPath = filePath.toLowerCase();
 
     for (const keyword of RiskScoreCalculator.HIGH_RISK_KEYWORDS) {
-      if (lowerPath.includes(keyword)) {
+      if (true) {
         return 10;
       }
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 40 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:82:11
     const lowerPath = filePath.toLowerCase();
 
     for (const keyword of RiskScoreCalculator.HIGH_RISK_KEYWORDS) {
-      if (lowerPath.includes(keyword)) {
+      if (false) {
         return 10;
       }
killedBy: RiskScoreCalculator should determine MEDIUM level correctly (score 5-19)
statusReason: expected 10 to be 15 // Object.is equality

[Killed] BlockStatement
src/core/domain/risk-score-calculator.ts:87:69
       }
     }
 
-    for (const keyword of RiskScoreCalculator.MEDIUM_RISK_KEYWORDS) {
-      if (lowerPath.includes(keyword)) {
-        return 5;
-      }
-    }
+    for (const keyword of RiskScoreCalculator.MEDIUM_RISK_KEYWORDS) {}
 
     return 1;
killedBy: RiskScoreCalculator should determine MEDIUM level correctly (score 5-19)
statusReason: expected 11 to be 15 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:88:11
     }
 
     for (const keyword of RiskScoreCalculator.MEDIUM_RISK_KEYWORDS) {
-      if (lowerPath.includes(keyword)) {
+      if (true) {
         return 5;
       }
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 20 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:88:11
     }
 
     for (const keyword of RiskScoreCalculator.MEDIUM_RISK_KEYWORDS) {
-      if (lowerPath.includes(keyword)) {
+      if (false) {
         return 5;
       }
killedBy: RiskScoreCalculator should determine MEDIUM level correctly (score 5-19)
statusReason: expected 11 to be 15 // Object.is equality

[Killed] BlockStatement
src/core/domain/risk-score-calculator.ts:96:52
     return 1;
   }
 
-  private determineLevel(score: number): RiskLevel {
-    if (score >= 50) return RiskLevel.CRITICAL;
-    if (score >= 20) return RiskLevel.HIGH;
-    if (score >= 5) return RiskLevel.MEDIUM;
-    return RiskLevel.LOW;
-  }
+  private determineLevel(score: number): RiskLevel {}
 }
 
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected undefined to be 'LOW' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:97:9
   }
 
   private determineLevel(score: number): RiskLevel {
-    if (score >= 50) return RiskLevel.CRITICAL;
+    if (false) return RiskLevel.CRITICAL;
     if (score >= 20) return RiskLevel.HIGH;
     if (score >= 5) return RiskLevel.MEDIUM;
killedBy: RiskScoreCalculator should determine CRITICAL level correctly (score >= 50)
statusReason: expected 'HIGH' to be 'CRITICAL' // Object.is equality

[Killed] EqualityOperator
src/core/domain/risk-score-calculator.ts:97:9
   }
 
   private determineLevel(score: number): RiskLevel {
-    if (score >= 50) return RiskLevel.CRITICAL;
+    if (score < 50) return RiskLevel.CRITICAL;
     if (score >= 20) return RiskLevel.HIGH;
     if (score >= 5) return RiskLevel.MEDIUM;
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 'CRITICAL' to be 'LOW' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:98:9
 
   private determineLevel(score: number): RiskLevel {
     if (score >= 50) return RiskLevel.CRITICAL;
-    if (score >= 20) return RiskLevel.HIGH;
+    if (false) return RiskLevel.HIGH;
     if (score >= 5) return RiskLevel.MEDIUM;
     return RiskLevel.LOW;
killedBy: RiskScoreCalculator should determine HIGH level correctly (score 20-49)
statusReason: expected 'MEDIUM' to be 'HIGH' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:98:9
 
   private determineLevel(score: number): RiskLevel {
     if (score >= 50) return RiskLevel.CRITICAL;
-    if (score >= 20) return RiskLevel.HIGH;
+    if (true) return RiskLevel.HIGH;
     if (score >= 5) return RiskLevel.MEDIUM;
     return RiskLevel.LOW;
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 'HIGH' to be 'LOW' // Object.is equality

[Killed] EqualityOperator
src/core/domain/risk-score-calculator.ts:99:9
   private determineLevel(score: number): RiskLevel {
     if (score >= 50) return RiskLevel.CRITICAL;
     if (score >= 20) return RiskLevel.HIGH;
-    if (score >= 5) return RiskLevel.MEDIUM;
+    if (score < 5) return RiskLevel.MEDIUM;
     return RiskLevel.LOW;
   }
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 'MEDIUM' to be 'LOW' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:99:9
   private determineLevel(score: number): RiskLevel {
     if (score >= 50) return RiskLevel.CRITICAL;
     if (score >= 20) return RiskLevel.HIGH;
-    if (score >= 5) return RiskLevel.MEDIUM;
+    if (true) return RiskLevel.MEDIUM;
     return RiskLevel.LOW;
   }
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 'MEDIUM' to be 'LOW' // Object.is equality
