[Killed] BooleanLiteral
src/core/application/analyze-coverage-gap.use-case.ts:16:20
 
   public execute(): Result<GapAnalysisResult[], Error> {
     const report = this.reportStream.current();
-    if (!report || !report.files) {
+    if (!report || report.files) {
       return err(new Error("No report available"));
     }
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/analyze-coverage-gap.use-case.ts:16:35
 
   public execute(): Result<GapAnalysisResult[], Error> {
     const report = this.reportStream.current();
-    if (!report || !report.files) {
-      return err(new Error("No report available"));
-    }
+    if (!report || !report.files) {}
 
     const gaps: GapAnalysisResult[] = [];
killedBy: AnalyzeCoverageGapUseCase should return error if no report
statusReason: Cannot read properties of null (reading 'files')

[Killed] ArrayDeclaration
src/core/application/analyze-coverage-gap.use-case.ts:20:39
       return err(new Error("No report available"));
     }
 
-    const gaps: GapAnalysisResult[] = [];
+    const gaps: GapAnalysisResult[] = ["Stryker was here"];
 
     for (const [filePath, fileResult] of Object.entries(report.files)) {
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/application/analyze-coverage-gap.use-case.ts:23:11
     const gaps: GapAnalysisResult[] = [];
 
     for (const [filePath, fileResult] of Object.entries(report.files)) {
-      if (!fileResult.mutants || fileResult.mutants.length === 0) continue;
+      if (true) continue;
 
       let totalMutants = 0;
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/core/application/analyze-coverage-gap.use-case.ts:23:11
     const gaps: GapAnalysisResult[] = [];
 
     for (const [filePath, fileResult] of Object.entries(report.files)) {
-      if (!fileResult.mutants || fileResult.mutants.length === 0) continue;
+      if (fileResult.mutants || fileResult.mutants.length === 0) continue;
 
       let totalMutants = 0;
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/application/analyze-coverage-gap.use-case.ts:29:48
       let survived = 0;
       let coveredMutants = 0;
 
-      for (const mutant of fileResult.mutants) {
-        totalMutants++;
-        
-        const hasCoverage = mutant.testsRan && mutant.testsRan.length > 0;
-        if (hasCoverage || mutant.status === "Killed" || mutant.status === "Survived") {
-           coveredMutants++;
-        }
-
-        if (mutant.status === "Survived") {
-          survived++;
-        }
-      }
+      for (const mutant of fileResult.mutants) {}
 
       if (totalMutants === 0) continue;
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/application/analyze-coverage-gap.use-case.ts:30:9
       let coveredMutants = 0;
 
       for (const mutant of fileResult.mutants) {
-        totalMutants++;
+        totalMutants--;
         
         const hasCoverage = mutant.testsRan && mutant.testsRan.length > 0;
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected -0.5 to be 0.5 // Object.is equality

[Survived] EqualityOperator
src/core/application/analyze-coverage-gap.use-case.ts:32:48
       for (const mutant of fileResult.mutants) {
         totalMutants++;
         
-        const hasCoverage = mutant.testsRan && mutant.testsRan.length > 0;
+        const hasCoverage = mutant.testsRan && mutant.testsRan.length >= 0;
         if (hasCoverage || mutant.status === "Killed" || mutant.status === "Survived") {
            coveredMutants++;

[Survived] LogicalOperator
src/core/application/analyze-coverage-gap.use-case.ts:32:29
       for (const mutant of fileResult.mutants) {
         totalMutants++;
         
-        const hasCoverage = mutant.testsRan && mutant.testsRan.length > 0;
+        const hasCoverage = mutant.testsRan || mutant.testsRan.length > 0;
         if (hasCoverage || mutant.status === "Killed" || mutant.status === "Survived") {
            coveredMutants++;

[Killed] ConditionalExpression
src/core/application/analyze-coverage-gap.use-case.ts:33:13
         totalMutants++;
         
         const hasCoverage = mutant.testsRan && mutant.testsRan.length > 0;
-        if (hasCoverage || mutant.status === "Killed" || mutant.status === "Survived") {
+        if (false) {
            coveredMutants++;
         }
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/application/analyze-coverage-gap.use-case.ts:33:88
         totalMutants++;
         
         const hasCoverage = mutant.testsRan && mutant.testsRan.length > 0;
-        if (hasCoverage || mutant.status === "Killed" || mutant.status === "Survived") {
-           coveredMutants++;
-        }
+        if (hasCoverage || mutant.status === "Killed" || mutant.status === "Survived") {}
 
         if (mutant.status === "Survived") {
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/core/application/analyze-coverage-gap.use-case.ts:34:12
         
         const hasCoverage = mutant.testsRan && mutant.testsRan.length > 0;
         if (hasCoverage || mutant.status === "Killed" || mutant.status === "Survived") {
-           coveredMutants++;
+           coveredMutants--;
         }
 
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/application/analyze-coverage-gap.use-case.ts:37:43
            coveredMutants++;
         }
 
-        if (mutant.status === "Survived") {
-          survived++;
-        }
+        if (mutant.status === "Survived") {}
       }
 
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/application/analyze-coverage-gap.use-case.ts:37:13
            coveredMutants++;
         }
 
-        if (mutant.status === "Survived") {
+        if (true) {
           survived++;
         }
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected 1 to be 0.5 // Object.is equality

[Killed] UpdateOperator
src/core/application/analyze-coverage-gap.use-case.ts:38:11
         }
 
         if (mutant.status === "Survived") {
-          survived++;
+          survived--;
         }
       }
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/core/application/analyze-coverage-gap.use-case.ts:42:11
         }
       }
 
-      if (totalMutants === 0) continue;
+      if (totalMutants !== 0) continue;
 
       const survivalRate = survived / totalMutants;
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/application/analyze-coverage-gap.use-case.ts:42:11
         }
       }
 
-      if (totalMutants === 0) continue;
+      if (true) continue;
 
       const survivalRate = survived / totalMutants;
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/core/application/analyze-coverage-gap.use-case.ts:44:28
 
       if (totalMutants === 0) continue;
 
-      const survivalRate = survived / totalMutants;
+      const survivalRate = survived * totalMutants;
       const coverageRate = coveredMutants / totalMutants;
 
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected 2 to be 0.5 // Object.is equality

[Survived] ArithmeticOperator
src/core/application/analyze-coverage-gap.use-case.ts:45:28
       if (totalMutants === 0) continue;
 
       const survivalRate = survived / totalMutants;
-      const coverageRate = coveredMutants / totalMutants;
+      const coverageRate = coveredMutants * totalMutants;
 
       // High coverage but high survival rate = Gap

[Survived] ArithmeticOperator
src/core/application/analyze-coverage-gap.use-case.ts:48:24
       const coverageRate = coveredMutants / totalMutants;
 
       // High coverage but high survival rate = Gap
-      const gapScore = coverageRate * survivalRate;
+      const gapScore = coverageRate / survivalRate;
 
       if (gapScore > 0) {

[Killed] ConditionalExpression
src/core/application/analyze-coverage-gap.use-case.ts:50:11
       // High coverage but high survival rate = Gap
       const gapScore = coverageRate * survivalRate;
 
-      if (gapScore > 0) {
+      if (false) {
         gaps.push({
           filePath,
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/core/application/analyze-coverage-gap.use-case.ts:50:11
       // High coverage but high survival rate = Gap
       const gapScore = coverageRate * survivalRate;
 
-      if (gapScore > 0) {
+      if (gapScore <= 0) {
         gaps.push({
           filePath,
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/core/application/analyze-coverage-gap.use-case.ts:51:19
       const gapScore = coverageRate * survivalRate;
 
       if (gapScore > 0) {
-        gaps.push({
-          filePath,
-          survivalRate,
-          coverageDetails: { coverageRate },
-          gapScore,
-        });
+        gaps.push({});
       }
     }
killedBy: AnalyzeCoverageGapUseCase should analyze gap correctly
statusReason: expected undefined to be 'file1.ts' // Object.is equality

[NoCoverage] ArithmeticOperator
src/core/application/analyze-coverage-gap.use-case.ts:61:25
     }
 
     // Sort by gapScore descending
-    gaps.sort((a, b) => b.gapScore - a.gapScore);
+    gaps.sort((a, b) => b.gapScore + a.gapScore);
 
     return ok(gaps);

[Survived] MethodExpression
src/core/application/analyze-coverage-gap.use-case.ts:61:5
     }
 
     // Sort by gapScore descending
-    gaps.sort((a, b) => b.gapScore - a.gapScore);
+    gaps;
 
     return ok(gaps);
