[Killed] BlockStatement
src/core/application/check-mutant-cache.use-case.ts:8:131
 export class CheckMutantCacheUseCase {
   constructor(private readonly db: DatabaseAdapter) {}
 
-  public execute(mutantContent: string, filePath: string): Result<{ cached: boolean; status?: string; mutantId?: string }, Error> {
-    try {
-      // Create a hash of the mutant content (representing AST/file hash)
-      const hash = crypto.createHash("sha256").update(`${filePath}:${mutantContent}`).digest("hex");
-      
-      const cached = this.db.getFromMutantCache(hash);
-      
-      if (cached) {
-        return ok({
-          cached: true,
-          status: cached.status,
-          mutantId: cached.mutant_id
-        });
-      }
-
-      return ok({ cached: false });
-    } catch (error) {
-      return err(error instanceof Error ? error : new Error(String(error)));
-    }
-  }
+  public execute(mutantContent: string, filePath: string): Result<{ cached: boolean; status?: string; mutantId?: string }, Error> {}
 
   public save(mutantContent: string, filePath: string, mutantId: string, status: string): void {
killedBy: CheckMutantCacheUseCase should return cached result if it exists
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/core/application/check-mutant-cache.use-case.ts:9:9
   constructor(private readonly db: DatabaseAdapter) {}
 
   public execute(mutantContent: string, filePath: string): Result<{ cached: boolean; status?: string; mutantId?: string }, Error> {
-    try {
-      // Create a hash of the mutant content (representing AST/file hash)
-      const hash = crypto.createHash("sha256").update(`${filePath}:${mutantContent}`).digest("hex");
-      
-      const cached = this.db.getFromMutantCache(hash);
-      
-      if (cached) {
-        return ok({
-          cached: true,
-          status: cached.status,
-          mutantId: cached.mutant_id
-        });
-      }
-
-      return ok({ cached: false });
-    } catch (error) {
+    try {} catch (error) {
       return err(error instanceof Error ? error : new Error(String(error)));
     }
killedBy: CheckMutantCacheUseCase should return cached result if it exists
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/core/application/check-mutant-cache.use-case.ts:15:11
       
       const cached = this.db.getFromMutantCache(hash);
       
-      if (cached) {
+      if (false) {
         return ok({
           cached: true,
killedBy: CheckMutantCacheUseCase should return cached result if it exists
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/check-mutant-cache.use-case.ts:15:11
       
       const cached = this.db.getFromMutantCache(hash);
       
-      if (cached) {
+      if (true) {
         return ok({
           cached: true,
killedBy: CheckMutantCacheUseCase should return not cached if it does not exist
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/application/check-mutant-cache.use-case.ts:17:19
       
       if (cached) {
         return ok({
-          cached: true,
+          cached: false,
           status: cached.status,
           mutantId: cached.mutant_id
killedBy: CheckMutantCacheUseCase should return cached result if it exists
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/application/check-mutant-cache.use-case.ts:23:27
         });
       }
 
-      return ok({ cached: false });
+      return ok({ cached: true });
     } catch (error) {
       return err(error instanceof Error ? error : new Error(String(error)));
killedBy: CheckMutantCacheUseCase should return not cached if it does not exist
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/core/application/check-mutant-cache.use-case.ts:23:17
         });
       }
 
-      return ok({ cached: false });
+      return ok({});
     } catch (error) {
       return err(error instanceof Error ? error : new Error(String(error)));
killedBy: CheckMutantCacheUseCase should return not cached if it does not exist
statusReason: expected undefined to be false // Object.is equality

[NoCoverage] BlockStatement
src/core/application/check-mutant-cache.use-case.ts:24:21
       }
 
       return ok({ cached: false });
-    } catch (error) {
-      return err(error instanceof Error ? error : new Error(String(error)));
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/core/application/check-mutant-cache.use-case.ts:29:96
     }
   }
 
-  public save(mutantContent: string, filePath: string, mutantId: string, status: string): void {
-    const hash = crypto.createHash("sha256").update(`${filePath}:${mutantContent}`).digest("hex");
-    this.db.saveToMutantCache(hash, mutantId, filePath, status);
-  }
+  public save(mutantContent: string, filePath: string, mutantId: string, status: string): void {}
 }
 
killedBy: CheckMutantCacheUseCase should save to cache
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
src/core/application/check-mutant-cache.use-case.ts:30:92
   }
 
   public save(mutantContent: string, filePath: string, mutantId: string, status: string): void {
-    const hash = crypto.createHash("sha256").update(`${filePath}:${mutantContent}`).digest("hex");
+    const hash = crypto.createHash("sha256").update(`${filePath}:${mutantContent}`).digest("");
     this.db.saveToMutantCache(hash, mutantId, filePath, status);
   }

[Survived] StringLiteral
src/core/application/check-mutant-cache.use-case.ts:30:53
   }
 
   public save(mutantContent: string, filePath: string, mutantId: string, status: string): void {
-    const hash = crypto.createHash("sha256").update(`${filePath}:${mutantContent}`).digest("hex");
+    const hash = crypto.createHash("sha256").update(``).digest("hex");
     this.db.saveToMutantCache(hash, mutantId, filePath, status);
   }
