[NoCoverage] ConditionalExpression
src/core/application/detect-equivalent-mutants.use-case.ts:32:44
 
     // Heuristic 1: ObjectLiteral mutates to empty object {}
     // If it's a DTO or data class, often {} is functionally equivalent if the properties are optional
-    if (mutatorName === "ObjectLiteral" && replacement === "{}") {
+    if (mutatorName === "ObjectLiteral" && true) {
       // Very weak heuristic, so we don't flag as strictly equivalent, but maybe?
       // Actually let's look for more concrete ones.

[Survived] ConditionalExpression
src/core/application/detect-equivalent-mutants.use-case.ts:32:9
 
     // Heuristic 1: ObjectLiteral mutates to empty object {}
     // If it's a DTO or data class, often {} is functionally equivalent if the properties are optional
-    if (mutatorName === "ObjectLiteral" && replacement === "{}") {
+    if (false) {
       // Very weak heuristic, so we don't flag as strictly equivalent, but maybe?
       // Actually let's look for more concrete ones.

[Killed] BlockStatement
src/core/application/detect-equivalent-mutants.use-case.ts:44:69
     
     // Let's rely on standard equivalents:
     // e.g. x === y mutated to x == y (EqualityOperator)
-    if (mutatorName === "EqualityOperator" && replacement === "==") {
-      isLikelyEquivalent = true;
-      reason = "Loose equality (==) is often functionally equivalent to strict equality (===) when the operands are type-checked by TypeScript.";
-      suggestedSuppressionComment = "// @stryker-disable-next-line EqualityOperator: TypeScript already enforces type safety here, so == is equivalent to ===";
-    }
+    if (mutatorName === "EqualityOperator" && replacement === "==") {}
 
     // Unary plus
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/application/detect-equivalent-mutants.use-case.ts:44:47
     
     // Let's rely on standard equivalents:
     // e.g. x === y mutated to x == y (EqualityOperator)
-    if (mutatorName === "EqualityOperator" && replacement === "==") {
+    if (mutatorName === "EqualityOperator" && replacement !== "==") {
       isLikelyEquivalent = true;
       reason = "Loose equality (==) is often functionally equivalent to strict equality (===) when the operands are type-checked by TypeScript.";
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/core/application/detect-equivalent-mutants.use-case.ts:46:16
     // e.g. x === y mutated to x == y (EqualityOperator)
     if (mutatorName === "EqualityOperator" && replacement === "==") {
       isLikelyEquivalent = true;
-      reason = "Loose equality (==) is often functionally equivalent to strict equality (===) when the operands are type-checked by TypeScript.";
+      reason = "";
       suggestedSuppressionComment = "// @stryker-disable-next-line EqualityOperator: TypeScript already enforces type safety here, so == is equivalent to ===";
     }
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected '' to contain 'Loose equality'

[Survived] ConditionalExpression
src/core/application/detect-equivalent-mutants.use-case.ts:51:9
     }
 
     // Unary plus
-    if (mutatorName === "UnaryOperator" && replacement === "-") {
+    if (true) {
       // Not necessarily equivalent
     }

[Survived] ConditionalExpression
src/core/application/detect-equivalent-mutants.use-case.ts:51:9
     }
 
     // Unary plus
-    if (mutatorName === "UnaryOperator" && replacement === "-") {
+    if (true && replacement === "-") {
       // Not necessarily equivalent
     }

[Survived] EqualityOperator
src/core/application/detect-equivalent-mutants.use-case.ts:56:9
     }
 
     // Math/Arithmetic
-    if (mutatorName === "ArithmeticOperator" && (replacement === "-" || replacement === "+")) {
+    if (mutatorName !== "ArithmeticOperator" && (replacement === "-" || replacement === "+")) {
       // i++ / i-- ?
     }

[NoCoverage] EqualityOperator
src/core/application/detect-equivalent-mutants.use-case.ts:56:73
     }
 
     // Math/Arithmetic
-    if (mutatorName === "ArithmeticOperator" && (replacement === "-" || replacement === "+")) {
+    if (mutatorName === "ArithmeticOperator" && (replacement === "-" || replacement !== "+")) {
       // i++ / i-- ?
     }

[NoCoverage] EqualityOperator
src/core/application/detect-equivalent-mutants.use-case.ts:62:45
     
     // BlockStatement mutating to {}
     // Often happens in void functions
-    if (mutatorName === "BlockStatement" && replacement === "{}") {
+    if (mutatorName === "BlockStatement" && replacement !== "{}") {
         // Not automatically equivalent, usually means a void function is emptied.
     }

[Survived] ConditionalExpression
src/core/application/detect-equivalent-mutants.use-case.ts:62:9
     
     // BlockStatement mutating to {}
     // Often happens in void functions
-    if (mutatorName === "BlockStatement" && replacement === "{}") {
+    if (false) {
         // Not automatically equivalent, usually means a void function is emptied.
     }

[Killed] ObjectLiteral
src/core/application/detect-equivalent-mutants.use-case.ts:68:12
 
     // Try to flag Performance equivalents: Array.map(() => ...) mutated?
     
-    return {
-      mutantId: mutant.id,
-      filePath: mutant.filePath,
-      line: mutant.line,
-      mutatorName,
-      isLikelyEquivalent,
-      reason,
-      suggestedSuppressionComment,
-    };
+    return {};
   }
 }
killedBy: DetectEquivalentMutantsUseCase should flag EqualityOperator mutated to == as likely equivalent
statusReason: expected undefined to be true // Object.is equality
