[Killed] BooleanLiteral
src/core/application/get-mutant-context.use-case.ts:29:9
   public execute(mutantId: string): Result<MutantContext, Error> {
     const report = this.reportStream.current();
 
-    if (!report || !report.files) {
+    if (report || !report.files) {
       return err(new Error("Kein Mutationsbericht gefunden."));
     }
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:37:16
       if (!fileResult.mutants) continue;
 
       const mutant = fileResult.mutants.find(
-        (m) => m.id === mutantId || m.id === String(mutantId),
+        (m) => false,
       );
 
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/core/application/get-mutant-context.use-case.ts:37:9
       if (!fileResult.mutants) continue;
 
       const mutant = fileResult.mutants.find(
-        (m) => m.id === mutantId || m.id === String(mutantId),
+        () => undefined,
       );
 
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:40:11
         (m) => m.id === mutantId || m.id === String(mutantId),
       );
 
-      if (mutant) {
+      if (true) {
         if (!fileResult.source) {
           return err(
killedBy: GetMutantContextUseCase sollte einen Fehler zurückgeben, wenn Mutant nicht gefunden
statusReason: expected 'Quellcode für Datei src/test.ts nicht…' to contain 'nicht gefunden'

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:40:11
         (m) => m.id === mutantId || m.id === String(mutantId),
       );
 
-      if (mutant) {
+      if (false) {
         if (!fileResult.source) {
           return err(
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/application/get-mutant-context.use-case.ts:41:13
       );
 
       if (mutant) {
-        if (!fileResult.source) {
+        if (fileResult.source) {
           return err(
             new Error(
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:41:13
       );
 
       if (mutant) {
-        if (!fileResult.source) {
+        if (true) {
           return err(
             new Error(
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected false to be true // Object.is equality

[NoCoverage] StringLiteral
src/core/application/get-mutant-context.use-case.ts:44:15
         if (!fileResult.source) {
           return err(
             new Error(
-              `Quellcode für Datei ${filePath} nicht im Bericht enthalten.`,
+              ``,
             ),
           );

[Killed] StringLiteral
src/core/application/get-mutant-context.use-case.ts:49:47
           );
         }
 
-        const lines = fileResult.source.split("\n");
+        const lines = fileResult.source.split("");
         const startLine = mutant.location?.start.line ?? 1;
         const endLine = mutant.location?.end.line ?? startLine;
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected 'f\nu\nn\nc\nt\ni\no\nn\n \na\nd\nd' to contain 'return a + b;'

[Survived] OptionalChaining
src/core/application/get-mutant-context.use-case.ts:50:27
         }
 
         const lines = fileResult.source.split("\n");
-        const startLine = mutant.location?.start.line ?? 1;
+        const startLine = mutant.location.start.line ?? 1;
         const endLine = mutant.location?.end.line ?? startLine;
 

[Survived] LogicalOperator
src/core/application/get-mutant-context.use-case.ts:50:27
         }
 
         const lines = fileResult.source.split("\n");
-        const startLine = mutant.location?.start.line ?? 1;
+        const startLine = mutant.location?.start.line && 1;
         const endLine = mutant.location?.end.line ?? startLine;
 

[Survived] OptionalChaining
src/core/application/get-mutant-context.use-case.ts:51:25
 
         const lines = fileResult.source.split("\n");
         const startLine = mutant.location?.start.line ?? 1;
-        const endLine = mutant.location?.end.line ?? startLine;
+        const endLine = mutant.location.end.line ?? startLine;
 
         // Context lines (10 lines before, 10 lines after)

[Survived] LogicalOperator
src/core/application/get-mutant-context.use-case.ts:51:25
 
         const lines = fileResult.source.split("\n");
         const startLine = mutant.location?.start.line ?? 1;
-        const endLine = mutant.location?.end.line ?? startLine;
+        const endLine = mutant.location?.end.line && startLine;
 
         // Context lines (10 lines before, 10 lines after)

[Killed] MethodExpression
src/core/application/get-mutant-context.use-case.ts:55:30
 
         // Context lines (10 lines before, 10 lines after)
         const CONTEXT_SIZE = 10;
-        const contextStart = Math.max(0, startLine - 1 - CONTEXT_SIZE);
+        const contextStart = Math.min(0, startLine - 1 - CONTEXT_SIZE);
         const contextEnd = Math.min(lines.length, endLine + CONTEXT_SIZE);
 
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected 'function add(a, b) {\n  return a + b;…' to contain 'return a - b;'

[Killed] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:55:42
 
         // Context lines (10 lines before, 10 lines after)
         const CONTEXT_SIZE = 10;
-        const contextStart = Math.max(0, startLine - 1 - CONTEXT_SIZE);
+        const contextStart = Math.max(0, startLine - 1 + CONTEXT_SIZE);
         const contextEnd = Math.min(lines.length, endLine + CONTEXT_SIZE);
 
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected '' to contain 'return a + b;'

[Killed] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:56:51
         // Context lines (10 lines before, 10 lines after)
         const CONTEXT_SIZE = 10;
         const contextStart = Math.max(0, startLine - 1 - CONTEXT_SIZE);
-        const contextEnd = Math.min(lines.length, endLine + CONTEXT_SIZE);
+        const contextEnd = Math.min(lines.length, endLine - CONTEXT_SIZE);
 
         const originalCodeLines = lines.slice(contextStart, contextEnd);
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected '' to contain 'return a + b;'

[Survived] MethodExpression
src/core/application/get-mutant-context.use-case.ts:56:28
         // Context lines (10 lines before, 10 lines after)
         const CONTEXT_SIZE = 10;
         const contextStart = Math.max(0, startLine - 1 - CONTEXT_SIZE);
-        const contextEnd = Math.min(lines.length, endLine + CONTEXT_SIZE);
+        const contextEnd = Math.max(lines.length, endLine + CONTEXT_SIZE);
 
         const originalCodeLines = lines.slice(contextStart, contextEnd);

[Survived] MethodExpression
src/core/application/get-mutant-context.use-case.ts:58:35
         const contextStart = Math.max(0, startLine - 1 - CONTEXT_SIZE);
         const contextEnd = Math.min(lines.length, endLine + CONTEXT_SIZE);
 
-        const originalCodeLines = lines.slice(contextStart, contextEnd);
+        const originalCodeLines = lines;
 
         // Create mutated code snippet by replacing the specific lines

[Killed] ArrayDeclaration
src/core/application/get-mutant-context.use-case.ts:61:34
         const originalCodeLines = lines.slice(contextStart, contextEnd);
 
         // Create mutated code snippet by replacing the specific lines
-        const mutatedCodeLines = [...originalCodeLines];
+        const mutatedCodeLines = [];
         const localStartIdx = startLine - 1 - contextStart;
         const localEndIdx = endLine - 1 - contextStart;
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected '' to contain 'return a - b;'

[Survived] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:62:31
 
         // Create mutated code snippet by replacing the specific lines
         const mutatedCodeLines = [...originalCodeLines];
-        const localStartIdx = startLine - 1 - contextStart;
+        const localStartIdx = startLine + 1 - contextStart;
         const localEndIdx = endLine - 1 - contextStart;
 

[Survived] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:62:31
 
         // Create mutated code snippet by replacing the specific lines
         const mutatedCodeLines = [...originalCodeLines];
-        const localStartIdx = startLine - 1 - contextStart;
+        const localStartIdx = startLine - 1 + contextStart;
         const localEndIdx = endLine - 1 - contextStart;
 

[Survived] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:63:29
         // Create mutated code snippet by replacing the specific lines
         const mutatedCodeLines = [...originalCodeLines];
         const localStartIdx = startLine - 1 - contextStart;
-        const localEndIdx = endLine - 1 - contextStart;
+        const localEndIdx = endLine - 1 + contextStart;
 
         if (localStartIdx >= 0 && localStartIdx < mutatedCodeLines.length) {

[Survived] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:63:29
         // Create mutated code snippet by replacing the specific lines
         const mutatedCodeLines = [...originalCodeLines];
         const localStartIdx = startLine - 1 - contextStart;
-        const localEndIdx = endLine - 1 - contextStart;
+        const localEndIdx = endLine + 1 - contextStart;
 
         if (localStartIdx >= 0 && localStartIdx < mutatedCodeLines.length) {

[Killed] EqualityOperator
src/core/application/get-mutant-context.use-case.ts:65:35
         const localStartIdx = startLine - 1 - contextStart;
         const localEndIdx = endLine - 1 - contextStart;
 
-        if (localStartIdx >= 0 && localStartIdx < mutatedCodeLines.length) {
+        if (localStartIdx >= 0 && localStartIdx >= mutatedCodeLines.length) {
           mutatedCodeLines.splice(
             localStartIdx,
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected 'function add(a, b) {\n  return a + b;…' to contain 'return a - b;'

[Killed] EqualityOperator
src/core/application/get-mutant-context.use-case.ts:65:13
         const localStartIdx = startLine - 1 - contextStart;
         const localEndIdx = endLine - 1 - contextStart;
 
-        if (localStartIdx >= 0 && localStartIdx < mutatedCodeLines.length) {
+        if (localStartIdx < 0 && localStartIdx < mutatedCodeLines.length) {
           mutatedCodeLines.splice(
             localStartIdx,
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected 'function add(a, b) {\n  return a + b;…' to contain 'return a - b;'

[Survived] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:68:13
         if (localStartIdx >= 0 && localStartIdx < mutatedCodeLines.length) {
           mutatedCodeLines.splice(
             localStartIdx,
-            localEndIdx - localStartIdx + 1,
+            localEndIdx + localStartIdx + 1,
             `// --- MUTATED CODE (${mutant.mutatorName}) ---`,
             mutant.replacement ?? "",

[Survived] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:68:13
         if (localStartIdx >= 0 && localStartIdx < mutatedCodeLines.length) {
           mutatedCodeLines.splice(
             localStartIdx,
-            localEndIdx - localStartIdx + 1,
+            localEndIdx - localStartIdx - 1,
             `// --- MUTATED CODE (${mutant.mutatorName}) ---`,
             mutant.replacement ?? "",

[Killed] LogicalOperator
src/core/application/get-mutant-context.use-case.ts:70:13
             localStartIdx,
             localEndIdx - localStartIdx + 1,
             `// --- MUTATED CODE (${mutant.mutatorName}) ---`,
-            mutant.replacement ?? "",
+            mutant.replacement && "",
             "// -------------------",
           );
killedBy: GetMutantContextUseCase sollte den Code-Kontext für einen Mutanten zurückgeben
statusReason: expected 'function add(a, b) {\n// --- MUTATED …' to contain 'return a - b;'

[NoCoverage] StringLiteral
src/core/application/get-mutant-context.use-case.ts:70:35
             localStartIdx,
             localEndIdx - localStartIdx + 1,
             `// --- MUTATED CODE (${mutant.mutatorName}) ---`,
-            mutant.replacement ?? "",
+            mutant.replacement ?? "Stryker was here!",
             "// -------------------",
           );

[Survived] StringLiteral
src/core/application/get-mutant-context.use-case.ts:71:13
             localEndIdx - localStartIdx + 1,
             `// --- MUTATED CODE (${mutant.mutatorName}) ---`,
             mutant.replacement ?? "",
-            "// -------------------",
+            "",
           );
         }

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:76:11
         }
 
         const testFileContexts = this.getTestContexts(
-          mutant.coveredBy || mutant.testsRan || [],
+          false,
           report.testFiles,
         );
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: testIds is not iterable

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:76:11
         }
 
         const testFileContexts = this.getTestContexts(
-          mutant.coveredBy || mutant.testsRan || [],
+          false || [],
           report.testFiles,
         );
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined

[Survived] LogicalOperator
src/core/application/get-mutant-context.use-case.ts:82:24
 
         return ok({
           id: mutant.id,
-          mutatorName: mutant.mutatorName ?? "Unknown",
+          mutatorName: mutant.mutatorName && "Unknown",
           status: mutant.status,
           originalCodeSnippet: originalCodeLines.join("\n"),

[NoCoverage] StringLiteral
src/core/application/get-mutant-context.use-case.ts:82:46
 
         return ok({
           id: mutant.id,
-          mutatorName: mutant.mutatorName ?? "Unknown",
+          mutatorName: mutant.mutatorName ?? "",
           status: mutant.status,
           originalCodeSnippet: originalCodeLines.join("\n"),

[Survived] StringLiteral
src/core/application/get-mutant-context.use-case.ts:85:53
           mutatorName: mutant.mutatorName ?? "Unknown",
           status: mutant.status,
           originalCodeSnippet: originalCodeLines.join("\n"),
-          mutatedCodeSnippet: mutatedCodeLines.join("\n"),
+          mutatedCodeSnippet: mutatedCodeLines.join(""),
           startLine: startLine,
           endLine: endLine,

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:101:9
     testIds: string[],
     testFiles?: Record<string, TestFile>,
   ) {
-    if (!testFiles || testIds.length === 0) return undefined;
+    if (true) return undefined;
 
     const contexts = [];
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/core/application/get-mutant-context.use-case.ts:101:23
     testIds: string[],
     testFiles?: Record<string, TestFile>,
   ) {
-    if (!testFiles || testIds.length === 0) return undefined;
+    if (!testFiles || testIds.length !== 0) return undefined;
 
     const contexts = [];
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined

[Killed] ArrayDeclaration
src/core/application/get-mutant-context.use-case.ts:103:22
   ) {
     if (!testFiles || testIds.length === 0) return undefined;
 
-    const contexts = [];
+    const contexts = ["Stryker was here"];
     for (const testId of testIds) {
       for (const [testFilePath, testFile] of Object.entries(testFiles)) {
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected [ 'Stryker was here', …(1) ] to have a length of 1 but got 2

[Survived] OptionalChaining
src/core/application/get-mutant-context.use-case.ts:106:27
     const contexts = [];
     for (const testId of testIds) {
       for (const [testFilePath, testFile] of Object.entries(testFiles)) {
-        const foundTest = testFile.tests?.find(
+        const foundTest = testFile.tests.find(
           (t) => t.id === testId || t.id === String(testId),
         );

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:107:18
     for (const testId of testIds) {
       for (const [testFilePath, testFile] of Object.entries(testFiles)) {
         const foundTest = testFile.tests?.find(
-          (t) => t.id === testId || t.id === String(testId),
+          (t) => false,
         );
         if (foundTest) {
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined

[Killed] ArrowFunction
src/core/application/get-mutant-context.use-case.ts:107:11
     for (const testId of testIds) {
       for (const [testFilePath, testFile] of Object.entries(testFiles)) {
         const foundTest = testFile.tests?.find(
-          (t) => t.id === testId || t.id === String(testId),
+          () => undefined,
         );
         if (foundTest) {
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/core/application/get-mutant-context.use-case.ts:109:24
         const foundTest = testFile.tests?.find(
           (t) => t.id === testId || t.id === String(testId),
         );
-        if (foundTest) {
-          let sourceSnippet = undefined;
-          if (testFile.source && foundTest.location) {
-            const tLines = testFile.source.split("\n");
-            const tStart = foundTest.location.start.line ?? 1;
-            // 5 lines before and after test
-            const tContextStart = Math.max(0, tStart - 1 - 5);
-            const tContextEnd = Math.min(
-              tLines.length,
-              (foundTest.location.end?.line ?? tStart) + 5,
-            );
-            sourceSnippet = tLines.slice(tContextStart, tContextEnd).join("\n");
-          }
-
-          contexts.push({
-            testId,
-            testName: foundTest.name,
-            filePath: testFilePath,
-            sourceSnippet,
-          });
-          break; // Stop looking for this testId in other files
-        }
+        if (foundTest) {}
       }
     }
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:109:13
         const foundTest = testFile.tests?.find(
           (t) => t.id === testId || t.id === String(testId),
         );
-        if (foundTest) {
+        if (false) {
           let sourceSnippet = undefined;
           if (testFile.source && foundTest.location) {
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:111:15
         );
         if (foundTest) {
           let sourceSnippet = undefined;
-          if (testFile.source && foundTest.location) {
+          if (false) {
             const tLines = testFile.source.split("\n");
             const tStart = foundTest.location.start.line ?? 1;
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/core/application/get-mutant-context.use-case.ts:111:54
         );
         if (foundTest) {
           let sourceSnippet = undefined;
-          if (testFile.source && foundTest.location) {
-            const tLines = testFile.source.split("\n");
-            const tStart = foundTest.location.start.line ?? 1;
-            // 5 lines before and after test
-            const tContextStart = Math.max(0, tStart - 1 - 5);
-            const tContextEnd = Math.min(
-              tLines.length,
-              (foundTest.location.end?.line ?? tStart) + 5,
-            );
-            sourceSnippet = tLines.slice(tContextStart, tContextEnd).join("\n");
-          }
+          if (testFile.source && foundTest.location) {}
 
           contexts.push({
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] LogicalOperator
src/core/application/get-mutant-context.use-case.ts:113:28
           let sourceSnippet = undefined;
           if (testFile.source && foundTest.location) {
             const tLines = testFile.source.split("\n");
-            const tStart = foundTest.location.start.line ?? 1;
+            const tStart = foundTest.location.start.line && 1;
             // 5 lines before and after test
             const tContextStart = Math.max(0, tStart - 1 - 5);

[Killed] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:115:47
             const tLines = testFile.source.split("\n");
             const tStart = foundTest.location.start.line ?? 1;
             // 5 lines before and after test
-            const tContextStart = Math.max(0, tStart - 1 - 5);
+            const tContextStart = Math.max(0, tStart - 1 + 5);
             const tContextEnd = Math.min(
               tLines.length,
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected '' to contain 'expect(add(1, 2)).toBe(3)'

[Survived] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:115:47
             const tLines = testFile.source.split("\n");
             const tStart = foundTest.location.start.line ?? 1;
             // 5 lines before and after test
-            const tContextStart = Math.max(0, tStart - 1 - 5);
+            const tContextStart = Math.max(0, tStart + 1 - 5);
             const tContextEnd = Math.min(
               tLines.length,

[Survived] MethodExpression
src/core/application/get-mutant-context.use-case.ts:116:33
             const tStart = foundTest.location.start.line ?? 1;
             // 5 lines before and after test
             const tContextStart = Math.max(0, tStart - 1 - 5);
-            const tContextEnd = Math.min(
-              tLines.length,
-              (foundTest.location.end?.line ?? tStart) + 5,
-            );
+            const tContextEnd = Math.max(tLines.length, (foundTest.location.end?.line ?? tStart) + 5);
             sourceSnippet = tLines.slice(tContextStart, tContextEnd).join("\n");
           }

[Killed] ArithmeticOperator
src/core/application/get-mutant-context.use-case.ts:118:15
             const tContextStart = Math.max(0, tStart - 1 - 5);
             const tContextEnd = Math.min(
               tLines.length,
-              (foundTest.location.end?.line ?? tStart) + 5,
+              (foundTest.location.end?.line ?? tStart) - 5,
             );
             sourceSnippet = tLines.slice(tContextStart, tContextEnd).join("\n");
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected '' to contain 'expect(add(1, 2)).toBe(3)'

[Survived] LogicalOperator
src/core/application/get-mutant-context.use-case.ts:118:16
             const tContextStart = Math.max(0, tStart - 1 - 5);
             const tContextEnd = Math.min(
               tLines.length,
-              (foundTest.location.end?.line ?? tStart) + 5,
+              (foundTest.location.end?.line && tStart) + 5,
             );
             sourceSnippet = tLines.slice(tContextStart, tContextEnd).join("\n");

[Survived] MethodExpression
src/core/application/get-mutant-context.use-case.ts:120:29
               tLines.length,
               (foundTest.location.end?.line ?? tStart) + 5,
             );
-            sourceSnippet = tLines.slice(tContextStart, tContextEnd).join("\n");
+            sourceSnippet = tLines.join("\n");
           }
 

[Killed] ConditionalExpression
src/core/application/get-mutant-context.use-case.ts:133:12
         }
       }
     }
-    return contexts.length > 0 ? contexts : undefined;
+    return false ? contexts : undefined;
   }
 }
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/core/application/get-mutant-context.use-case.ts:133:12
         }
       }
     }
-    return contexts.length > 0 ? contexts : undefined;
+    return contexts.length <= 0 ? contexts : undefined;
   }
 }
killedBy: GetMutantContextUseCase sollte Test-Datei-Kontext extrahieren, wenn testFiles vorhanden
statusReason: expected undefined to be defined
