[Killed] BlockStatement
src/core/application/get-survived-mutants.use-case.ts:17:89
     private readonly gitService?: GitServicePort
   ) {}
 
-  public async execute(filePathFilter?: string): Promise<Result<MutantDetail[], Error>> {
-    const report = this.reportStream.current();
-    if (!report) {
-      return err(new Error("Kein Mutation-Testing-Report verfügbar."));
-    }
-
-    const survived = extractSurvivedMutants(report, filePathFilter);
-    
-    if (this.gitService && this.gitService.getBlameForLine) {
-      for (const mutant of survived) {
-        try {
-          const blame = await this.gitService.getBlameForLine(mutant.filePath, mutant.line);
-          if (blame) {
-            mutant.gitBlame = blame;
-          }
-        } catch (error) {
-          // Ignore blame fetch errors per file to not block the report
-        }
-      }
-    }
-
-    return ok(survived);
-  }
+  public async execute(filePathFilter?: string): Promise<Result<MutantDetail[], Error>> {}
 }
 
killedBy: GetSurvivedMutantsUseCase gibt ein err-Result zurück, wenn kein Report im Stream liegt
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/core/application/get-survived-mutants.use-case.ts:19:9
 
   public async execute(filePathFilter?: string): Promise<Result<MutantDetail[], Error>> {
     const report = this.reportStream.current();
-    if (!report) {
+    if (false) {
       return err(new Error("Kein Mutation-Testing-Report verfügbar."));
     }
killedBy: GetSurvivedMutantsUseCase gibt ein err-Result zurück, wenn kein Report im Stream liegt
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/core/application/get-survived-mutants.use-case.ts:25:9
 
     const survived = extractSurvivedMutants(report, filePathFilter);
     
-    if (this.gitService && this.gitService.getBlameForLine) {
+    if (this.gitService || this.gitService.getBlameForLine) {
       for (const mutant of survived) {
         try {
killedBy: GetSurvivedMutantsUseCase extrahiert alle überlebenden Mutanten aus dem aktuellen Report
statusReason: Cannot read properties of undefined (reading 'getBlameForLine')

[Survived] ConditionalExpression
src/core/application/get-survived-mutants.use-case.ts:25:9
 
     const survived = extractSurvivedMutants(report, filePathFilter);
     
-    if (this.gitService && this.gitService.getBlameForLine) {
+    if (true) {
       for (const mutant of survived) {
         try {

[NoCoverage] BlockStatement
src/core/application/get-survived-mutants.use-case.ts:26:38
     const survived = extractSurvivedMutants(report, filePathFilter);
     
     if (this.gitService && this.gitService.getBlameForLine) {
-      for (const mutant of survived) {
-        try {
-          const blame = await this.gitService.getBlameForLine(mutant.filePath, mutant.line);
-          if (blame) {
-            mutant.gitBlame = blame;
-          }
-        } catch (error) {
-          // Ignore blame fetch errors per file to not block the report
-        }
-      }
+      for (const mutant of survived) {}
     }
 

[NoCoverage] BlockStatement
src/core/application/get-survived-mutants.use-case.ts:27:13
     
     if (this.gitService && this.gitService.getBlameForLine) {
       for (const mutant of survived) {
-        try {
-          const blame = await this.gitService.getBlameForLine(mutant.filePath, mutant.line);
-          if (blame) {
-            mutant.gitBlame = blame;
-          }
-        } catch (error) {
+        try {} catch (error) {
           // Ignore blame fetch errors per file to not block the report
         }

[NoCoverage] BlockStatement
src/core/application/get-survived-mutants.use-case.ts:29:22
       for (const mutant of survived) {
         try {
           const blame = await this.gitService.getBlameForLine(mutant.filePath, mutant.line);
-          if (blame) {
-            mutant.gitBlame = blame;
-          }
+          if (blame) {}
         } catch (error) {
           // Ignore blame fetch errors per file to not block the report

[NoCoverage] ConditionalExpression
src/core/application/get-survived-mutants.use-case.ts:29:15
       for (const mutant of survived) {
         try {
           const blame = await this.gitService.getBlameForLine(mutant.filePath, mutant.line);
-          if (blame) {
+          if (false) {
             mutant.gitBlame = blame;
           }
