[Killed] EqualityOperator
src/core/application/track-test-flakiness.use-case.ts:10:9
     const flakyMutants: any[] = [];
     const previousRuns = this.db.getRuns();
     
-    if (previousRuns.length === 0) {
+    if (previousRuns.length !== 0) {
       return flakyMutants;
     }
killedBy: TrackTestFlakinessUseCase should execute track-test-flakiness successfully
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/core/application/track-test-flakiness.use-case.ts:10:9
     const flakyMutants: any[] = [];
     const previousRuns = this.db.getRuns();
     
-    if (previousRuns.length === 0) {
+    if (false) {
       return flakyMutants;
     }
killedBy: TrackTestFlakinessUseCase should execute track-test-flakiness successfully
statusReason: Cannot read properties of undefined (reading 'id')

[NoCoverage] ArrowFunction
src/core/application/track-test-flakiness.use-case.ts:16:59
 
     const lastRun = previousRuns[0];
     const previousMutants = this.db.getMutantsForRun(lastRun.id);
-    const previousMutantMap = new Map(previousMutants.map(m => [m.id, m]));
+    const previousMutantMap = new Map(previousMutants.map(() => undefined));
 
     for (const current of currentMutants) {

[NoCoverage] BlockStatement
src/core/application/track-test-flakiness.use-case.ts:18:43
     const previousMutants = this.db.getMutantsForRun(lastRun.id);
     const previousMutantMap = new Map(previousMutants.map(m => [m.id, m]));
 
-    for (const current of currentMutants) {
-      const prev = previousMutantMap.get(current.id);
-      if (prev && prev.status !== current.status) {
-        if ((prev.status === 'Killed' && current.status === 'Survived') ||
-            (prev.status === 'Survived' && current.status === 'Killed')) {
-          
-          const flaky = {
-            mutant_id: current.id,
-            file_path: current.filePath,
-            status: `Flipped from ${prev.status} to ${current.status}`,
-          };
-          
-          flakyMutants.push(flaky);
-          
-          try {
-            this.db.saveFlakyMutant(flaky.mutant_id, flaky.file_path, flaky.status);
-          } catch (e) {
-            // Ignore if error
-          }
-        }
-      }
-    }
+    for (const current of currentMutants) {}
 
     return flakyMutants;

[NoCoverage] ConditionalExpression
src/core/application/track-test-flakiness.use-case.ts:20:11
 
     for (const current of currentMutants) {
       const prev = previousMutantMap.get(current.id);
-      if (prev && prev.status !== current.status) {
+      if (false) {
         if ((prev.status === 'Killed' && current.status === 'Survived') ||
             (prev.status === 'Survived' && current.status === 'Killed')) {

[NoCoverage] BlockStatement
src/core/application/track-test-flakiness.use-case.ts:20:51
 
     for (const current of currentMutants) {
       const prev = previousMutantMap.get(current.id);
-      if (prev && prev.status !== current.status) {
-        if ((prev.status === 'Killed' && current.status === 'Survived') ||
-            (prev.status === 'Survived' && current.status === 'Killed')) {
-          
-          const flaky = {
-            mutant_id: current.id,
-            file_path: current.filePath,
-            status: `Flipped from ${prev.status} to ${current.status}`,
-          };
-          
-          flakyMutants.push(flaky);
-          
-          try {
-            this.db.saveFlakyMutant(flaky.mutant_id, flaky.file_path, flaky.status);
-          } catch (e) {
-            // Ignore if error
-          }
-        }
-      }
+      if (prev && prev.status !== current.status) {}
     }
 

[NoCoverage] ConditionalExpression
src/core/application/track-test-flakiness.use-case.ts:21:14
     for (const current of currentMutants) {
       const prev = previousMutantMap.get(current.id);
       if (prev && prev.status !== current.status) {
-        if ((prev.status === 'Killed' && current.status === 'Survived') ||
+        if ((false) ||
             (prev.status === 'Survived' && current.status === 'Killed')) {
           

[NoCoverage] EqualityOperator
src/core/application/track-test-flakiness.use-case.ts:21:42
     for (const current of currentMutants) {
       const prev = previousMutantMap.get(current.id);
       if (prev && prev.status !== current.status) {
-        if ((prev.status === 'Killed' && current.status === 'Survived') ||
+        if ((prev.status === 'Killed' && current.status !== 'Survived') ||
             (prev.status === 'Survived' && current.status === 'Killed')) {
           

[NoCoverage] ConditionalExpression
src/core/application/track-test-flakiness.use-case.ts:22:14
       const prev = previousMutantMap.get(current.id);
       if (prev && prev.status !== current.status) {
         if ((prev.status === 'Killed' && current.status === 'Survived') ||
-            (prev.status === 'Survived' && current.status === 'Killed')) {
+            (true && current.status === 'Killed')) {
           
           const flaky = {

[NoCoverage] EqualityOperator
src/core/application/track-test-flakiness.use-case.ts:22:14
       const prev = previousMutantMap.get(current.id);
       if (prev && prev.status !== current.status) {
         if ((prev.status === 'Killed' && current.status === 'Survived') ||
-            (prev.status === 'Survived' && current.status === 'Killed')) {
+            (prev.status !== 'Survived' && current.status === 'Killed')) {
           
           const flaky = {

[NoCoverage] StringLiteral
src/core/application/track-test-flakiness.use-case.ts:27:21
           const flaky = {
             mutant_id: current.id,
             file_path: current.filePath,
-            status: `Flipped from ${prev.status} to ${current.status}`,
+            status: ``,
           };
           

[NoCoverage] BlockStatement
src/core/application/track-test-flakiness.use-case.ts:32:15
           
           flakyMutants.push(flaky);
           
-          try {
-            this.db.saveFlakyMutant(flaky.mutant_id, flaky.file_path, flaky.status);
-          } catch (e) {
+          try {} catch (e) {
             // Ignore if error
           }
