[NoCoverage] StringLiteral
src/core/domain/events.ts:24:26
 }
 
 export class AdrGeneratedEvent implements DomainEvent {
-  public readonly type = "AdrGenerated";
+  public readonly type = "";
   public readonly timestamp = new Date();
   
