[Killed] BlockStatement
src/core/domain/mutation-report.ts:113:60
   }
 
   for (const fileResult of Object.values(report.files)) {
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
-      continue;
-    }
+    if (!fileResult || !Array.isArray(fileResult.mutants)) {}
 
     for (const mutant of fileResult.mutants) {
killedBy: MutationReport Domain Model calculateMutationSummary gibt 100% Score zurück, wenn keine Mutanten vorhanden sind oder null/undefined report übergeben wird
statusReason: fileResult.mutants is not iterable

[Killed] BooleanLiteral
src/core/domain/mutation-report.ts:113:9
   }
 
   for (const fileResult of Object.values(report.files)) {
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
+    if (fileResult || !Array.isArray(fileResult.mutants)) {
       continue;
     }
killedBy: GetMutationSummaryUseCase berechnet die Zusammenfassung für den geladenen Report
statusReason: expected { totalMutants: +0, killed: +0, …(7) } to deeply equal { totalMutants: 2, killed: 1, …(7) }

[Killed] StringLiteral
src/core/domain/mutation-report.ts:120:14
     for (const mutant of fileResult.mutants) {
       summary.totalMutants++;
       switch (mutant.status) {
-        case "Killed":
+        case "":
           summary.killed++;
           break;
killedBy: GetMutationSummaryUseCase berechnet die Zusammenfassung für den geladenen Report
statusReason: expected { totalMutants: 2, killed: +0, …(7) } to deeply equal { totalMutants: 2, killed: 1, …(7) }

[Killed] StringLiteral
src/core/domain/mutation-report.ts:129:14
         case "NoCoverage":
           summary.noCoverage++;
           break;
-        case "Timeout":
+        case "":
           summary.timeout++;
           break;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-report.ts:132:14
         case "Timeout":
           summary.timeout++;
           break;
-        case "CompileError":
+        case "":
           summary.compileError++;
           break;
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:147:5
 
   const detected = summary.killed + summary.timeout;
   const validMutants =
-    summary.killed + summary.survived + summary.noCoverage + summary.timeout;
+    summary.killed - summary.survived + summary.noCoverage + summary.timeout;
 
   if (validMutants > 0) {
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected 200 to be 40 // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:147:5
 
   const detected = summary.killed + summary.timeout;
   const validMutants =
-    summary.killed + summary.survived + summary.noCoverage + summary.timeout;
+    summary.killed + summary.survived - summary.noCoverage + summary.timeout;
 
   if (validMutants > 0) {
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected 66.67 to be 40 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:149:7
   const validMutants =
     summary.killed + summary.survived + summary.noCoverage + summary.timeout;
 
-  if (validMutants > 0) {
+  if (false) {
     summary.mutationScore = Number(
       ((detected / validMutants) * 100).toFixed(2),
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected 100 to be 40 // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:151:8
 
   if (validMutants > 0) {
     summary.mutationScore = Number(
-      ((detected / validMutants) * 100).toFixed(2),
+      (detected / validMutants / 100).toFixed(2),
     );
   } else {
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected +0 to be 40 // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-report.ts:151:9
 
   if (validMutants > 0) {
     summary.mutationScore = Number(
-      ((detected / validMutants) * 100).toFixed(2),
+      ((detected * validMutants) * 100).toFixed(2),
     );
   } else {
killedBy: MutationReport Domain Model calculateMutationSummary berechnet die Mutationsstatistiken und den Score korrekt für alle Statusfälle
statusReason: expected 1000 to be 40 // Object.is equality

[Survived] BlockStatement
src/core/domain/mutation-report.ts:153:10
     summary.mutationScore = Number(
       ((detected / validMutants) * 100).toFixed(2),
     );
-  } else {
-    summary.mutationScore = 100;
-  }
+  } else {}
 
   return summary;

[Killed] ArrayDeclaration
src/core/domain/mutation-report.ts:167:34
   report: MutationReport,
   filePathFilter?: string,
 ): MutantDetail[] {
-  const result: MutantDetail[] = [];
+  const result: MutantDetail[] = ["Stryker was here"];
 
   if (!report || !report.files) {
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [ 'Stryker was here', …(2) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:169:7
 ): MutantDetail[] {
   const result: MutantDetail[] = [];
 
-  if (!report || !report.files) {
+  if (false) {
     return result;
   }
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt null/undefined Reports oder fehlende mutants-Arrays sicher
statusReason: Cannot read properties of null (reading 'files')

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:175:7
 
   for (const [filePath, fileResult] of Object.entries(report.files)) {
     if (
-      filePathFilter &&
-      filePath !== filePathFilter &&
-      !filePath.endsWith(filePathFilter)
+      true
     ) {
       continue;
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:175:7
 
   for (const [filePath, fileResult] of Object.entries(report.files)) {
     if (
-      filePathFilter &&
-      filePath !== filePathFilter &&
+      true &&
       !filePath.endsWith(filePathFilter)
     ) {
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/core/domain/mutation-report.ts:176:7
   for (const [filePath, fileResult] of Object.entries(report.files)) {
     if (
       filePathFilter &&
-      filePath !== filePathFilter &&
+      filePath === filePathFilter &&
       !filePath.endsWith(filePathFilter)
     ) {
killedBy: MutationReport Domain Model extractSurvivedMutants filtert überlebende Mutanten nach spezifischem Dateipfad oder Suffix
statusReason: expected [ Array(2) ] to have a length of 1 but got 2

[Survived] ConditionalExpression
src/core/domain/mutation-report.ts:176:7
   for (const [filePath, fileResult] of Object.entries(report.files)) {
     if (
       filePathFilter &&
-      filePath !== filePathFilter &&
+      true &&
       !filePath.endsWith(filePathFilter)
     ) {

[Killed] MethodExpression
src/core/domain/mutation-report.ts:177:8
     if (
       filePathFilter &&
       filePath !== filePathFilter &&
-      !filePath.endsWith(filePathFilter)
+      !filePath.startsWith(filePathFilter)
     ) {
       continue;
killedBy: MutationReport Domain Model extractSurvivedMutants filtert überlebende Mutanten nach spezifischem Dateipfad oder Suffix
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/core/domain/mutation-report.ts:177:7
     if (
       filePathFilter &&
       filePath !== filePathFilter &&
-      !filePath.endsWith(filePathFilter)
+      filePath.endsWith(filePathFilter)
     ) {
       continue;
killedBy: GetSurvivedMutantsUseCase unterstützt das Filtern nach Dateipfad
statusReason: expected [ { id: '1', …(9) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/core/domain/mutation-report.ts:178:7
       filePathFilter &&
       filePath !== filePathFilter &&
       !filePath.endsWith(filePathFilter)
-    ) {
-      continue;
-    }
+    ) {}
 
     if (!fileResult || !Array.isArray(fileResult.mutants)) {
killedBy: MutationReport Domain Model extractSurvivedMutants filtert überlebende Mutanten nach spezifischem Dateipfad oder Suffix
statusReason: expected [ Array(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:182:9
       continue;
     }
 
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
+    if (false) {
       continue;
     }
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt null/undefined Reports oder fehlende mutants-Arrays sicher
statusReason: fileResult.mutants is not iterable

[Killed] BooleanLiteral
src/core/domain/mutation-report.ts:182:24
       continue;
     }
 
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
+    if (!fileResult || Array.isArray(fileResult.mutants)) {
       continue;
     }
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/core/domain/mutation-report.ts:187:11
     }
 
     for (const mutant of fileResult.mutants) {
-      if (mutant.status === "Survived") {
+      if (mutant.status !== "Survived") {
         const id =
           typeof mutant.id === "string" && mutant.id !== ""
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected [ { id: '1', …(9) }, …(5) ] to have a length of 2 but got 6

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:189:11
     for (const mutant of fileResult.mutants) {
       if (mutant.status === "Survived") {
         const id =
-          typeof mutant.id === "string" && mutant.id !== ""
+          false
             ? mutant.id
             : "unknown";
killedBy: MutationReport Domain Model extractSurvivedMutants extrahiert alle überlebenden Mutanten aus allen Dateien
statusReason: expected 'unknown' to be '2' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:189:11
     for (const mutant of fileResult.mutants) {
       if (mutant.status === "Survived") {
         const id =
-          typeof mutant.id === "string" && mutant.id !== ""
+          typeof mutant.id === "string" || mutant.id !== ""
             ? mutant.id
             : "unknown";
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt mutant ohne ID fallback
statusReason: expected undefined to be 'unknown' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:193:11
             ? mutant.id
             : "unknown";
         const mutatorName =
-          typeof mutant.mutatorName === "string" && mutant.mutatorName !== ""
+          typeof mutant.mutatorName === "string" || mutant.mutatorName !== ""
             ? mutant.mutatorName
             : "Unknown";
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt fehlerhafte oder unvollständige Mutanten-Objekte gracefully
statusReason: expected undefined to be 'Unknown' // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-report.ts:193:53
             ? mutant.id
             : "unknown";
         const mutatorName =
-          typeof mutant.mutatorName === "string" && mutant.mutatorName !== ""
+          typeof mutant.mutatorName === "string" && mutant.mutatorName === ""
             ? mutant.mutatorName
             : "Unknown";
killedBy: GetSurvivedMutantsUseCase extrahiert alle überlebenden Mutanten aus dem aktuellen Report
statusReason: expected 'Unknown' to be 'Arithmetic' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-report.ts:195:15
         const mutatorName =
           typeof mutant.mutatorName === "string" && mutant.mutatorName !== ""
             ? mutant.mutatorName
-            : "Unknown";
+            : "";
         const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
 
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt fehlerhafte oder unvollständige Mutanten-Objekte gracefully
statusReason: expected '' to be 'Unknown' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-report.ts:202:46
           id,
           filePath,
           mutatorName,
-          replacement: mutant.replacement ?? "",
+          replacement: mutant.replacement ?? "Stryker was here!",
           line: mutant.location?.start?.line ?? 1,
           column: mutant.location?.start?.column ?? 1,
killedBy: MutationReport Domain Model extractSurvivedMutants handhabt fehlerhafte oder unvollständige Mutanten-Objekte gracefully
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:232:7
 
   for (const [filePath, fileResult] of Object.entries(report.files)) {
     if (
-      filePathFilter &&
-      filePath !== filePathFilter &&
+      filePathFilter || filePath !== filePathFilter &&
       !filePath.endsWith(filePathFilter)
     ) {
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-report.ts:232:7
 
   for (const [filePath, fileResult] of Object.entries(report.files)) {
     if (
-      filePathFilter &&
-      filePath !== filePathFilter &&
-      !filePath.endsWith(filePathFilter)
+      filePathFilter && filePath !== filePathFilter || !filePath.endsWith(filePathFilter)
     ) {
       continue;
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:239:9
       continue;
     }
 
-    if (!fileResult || !Array.isArray(fileResult.mutants)) {
+    if (true) {
       continue;
     }
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/domain/mutation-report.ts:244:39
     }
 
     for (const mutant of fileResult.mutants) {
-      if (mutant.status === "Killed") {
-        const id =
-          typeof mutant.id === "string" && mutant.id !== ""
-            ? mutant.id
-            : "unknown";
-        const mutatorName =
-          typeof mutant.mutatorName === "string" && mutant.mutatorName !== ""
-            ? mutant.mutatorName
-            : "Unknown";
-        const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
-
-        result.push({
-          id,
-          filePath,
-          mutatorName,
-          replacement: mutant.replacement ?? "",
-          line: mutant.location?.start?.line ?? 1,
-          column: mutant.location?.start?.column ?? 1,
-          status: "Killed",
-          coveredBy: mutant.coveredBy,
-          killedBy: mutant.killedBy,
-          testsRan,
-        });
-      }
+      if (mutant.status === "Killed") {}
     }
   }
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-report.ts:244:11
     }
 
     for (const mutant of fileResult.mutants) {
-      if (mutant.status === "Killed") {
+      if (true) {
         const id =
           typeof mutant.id === "string" && mutant.id !== ""
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-report.ts:246:11
     for (const mutant of fileResult.mutants) {
       if (mutant.status === "Killed") {
         const id =
-          typeof mutant.id === "string" && mutant.id !== ""
+          typeof mutant.id !== "string" && mutant.id !== ""
             ? mutant.id
             : "unknown";
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected 'unknown' to be '1' // Object.is equality

[Survived] ConditionalExpression
src/core/domain/mutation-report.ts:250:53
             ? mutant.id
             : "unknown";
         const mutatorName =
-          typeof mutant.mutatorName === "string" && mutant.mutatorName !== ""
+          typeof mutant.mutatorName === "string" && true
             ? mutant.mutatorName
             : "Unknown";

[Killed] ObjectLiteral
src/core/domain/mutation-report.ts:255:21
             : "Unknown";
         const testsRan = Array.isArray(mutant.testsRan) ? mutant.testsRan : [];
 
-        result.push({
-          id,
-          filePath,
-          mutatorName,
-          replacement: mutant.replacement ?? "",
-          line: mutant.location?.start?.line ?? 1,
-          column: mutant.location?.start?.column ?? 1,
-          status: "Killed",
-          coveredBy: mutant.coveredBy,
-          killedBy: mutant.killedBy,
-          testsRan,
-        });
+        result.push({});
       }
     }
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected undefined to be '1' // Object.is equality

[Survived] OptionalChaining
src/core/domain/mutation-report.ts:261:19
           mutatorName,
           replacement: mutant.replacement ?? "",
           line: mutant.location?.start?.line ?? 1,
-          column: mutant.location?.start?.column ?? 1,
+          column: mutant.location?.start.column ?? 1,
           status: "Killed",
           coveredBy: mutant.coveredBy,

[Killed] StringLiteral
src/core/domain/mutation-report.ts:262:19
           replacement: mutant.replacement ?? "",
           line: mutant.location?.start?.line ?? 1,
           column: mutant.location?.start?.column ?? 1,
-          status: "Killed",
+          status: "",
           coveredBy: mutant.coveredBy,
           killedBy: mutant.killedBy,
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected '' to be 'Killed' // Object.is equality
