[Killed] ConditionalExpression
src/core/domain/mutation-trend-tracker.ts:30:9
     isImproving: boolean;
     latestScore: number;
   } {
-    if (this.history.length === 0) {
+    if (false) {
       return { scoreDelta: 0, isImproving: true, latestScore: 0 };
     }
killedBy: McpResourceController ReadResource should not record trend but still read trends when summary Error
statusReason: Cannot read properties of undefined (reading 'mutationScore')

[Killed] ConditionalExpression
src/core/domain/mutation-trend-tracker.ts:30:9
     isImproving: boolean;
     latestScore: number;
   } {
-    if (this.history.length === 0) {
+    if (true) {
       return { scoreDelta: 0, isImproving: true, latestScore: 0 };
     }
killedBy: McpResourceController ReadResource should record trend and read trends when summary Ok
statusReason: expected '{\n  "scoreDelta": 0,\n  "isImproving…' to contain '"latestScore": 90'

[Killed] BlockStatement
src/core/domain/mutation-trend-tracker.ts:35:36
     }
 
     const latest = this.history[this.history.length - 1];
-    if (this.history.length === 1) {
-      return {
-        scoreDelta: 0,
-        isImproving: true,
-        latestScore: latest.mutationScore,
-      };
-    }
+    if (this.history.length === 1) {}
 
     const previous = this.history[this.history.length - 2];
killedBy: McpResourceController ReadResource should record trend and read trends when summary Ok
statusReason: Cannot read properties of undefined (reading 'mutationScore')

[Killed] ObjectLiteral
src/core/domain/mutation-trend-tracker.ts:36:14
 
     const latest = this.history[this.history.length - 1];
     if (this.history.length === 1) {
-      return {
-        scoreDelta: 0,
-        isImproving: true,
-        latestScore: latest.mutationScore,
-      };
+      return {};
     }
 
killedBy: MutationTrendTracker should handle single run gracefully
statusReason: expected undefined to be 100 // Object.is equality

[Killed] BooleanLiteral
src/core/domain/mutation-trend-tracker.ts:38:22
     if (this.history.length === 1) {
       return {
         scoreDelta: 0,
-        isImproving: true,
+        isImproving: false,
         latestScore: latest.mutationScore,
       };
killedBy: MutationTrendTracker should handle single run gracefully
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/core/domain/mutation-trend-tracker.ts:45:8
 
     const previous = this.history[this.history.length - 2];
     const scoreDelta = Number(
-      (latest.mutationScore - previous.mutationScore).toFixed(2),
+      (latest.mutationScore + previous.mutationScore).toFixed(2),
     );
     const isImproving = scoreDelta >= 0;
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected 177.5 to be 7.5 // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-trend-tracker.ts:47:25
     const scoreDelta = Number(
       (latest.mutationScore - previous.mutationScore).toFixed(2),
     );
-    const isImproving = scoreDelta >= 0;
+    const isImproving = scoreDelta < 0;
 
     return {
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-trend-tracker.ts:47:25
     const scoreDelta = Number(
       (latest.mutationScore - previous.mutationScore).toFixed(2),
     );
-    const isImproving = scoreDelta >= 0;
+    const isImproving = false;
 
     return {
killedBy: MutationTrendTracker should calculate score delta and trend direction accurately
statusReason: expected false to be true // Object.is equality
