[Killed] StringLiteral
src/core/domain/risk-score-calculator.ts:25:5
     "crypto",
     "validator",
     "guard",
-    "token",
+    "",
     "password",
   ];
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 20 to be 2 // Object.is equality

[Killed] StringLiteral
src/core/domain/risk-score-calculator.ts:30:5
   ];
   private static readonly MEDIUM_RISK_KEYWORDS = [
     "service",
-    "controller",
+    "",
     "use-case",
     "handler",
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 10 to be 2 // Object.is equality

[Killed] StringLiteral
src/core/domain/risk-score-calculator.ts:32:5
     "service",
     "controller",
     "use-case",
-    "handler",
+    "",
   ];
 
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected 10 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/core/domain/risk-score-calculator.ts:36:9
   ];
 
   public calculate(report: MutationReport): RiskAnalysis {
-    if (!report.files) {
+    if (report.files) {
       return {
         score: 0,
killedBy: RiskScoreCalculator should calculate score correctly for normal files
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/core/domain/risk-score-calculator.ts:64:11
 
       totalScore += fileRiskScore;
 
-      if (fileWeight >= 5) {
+      if (false) {
         highRiskFiles.add(filePath);
       }
killedBy: RiskScoreCalculator should give higher weight to files with keywords
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/core/domain/risk-score-calculator.ts:98:9
 
   private determineLevel(score: number): RiskLevel {
     if (score >= 50) return RiskLevel.CRITICAL;
-    if (score >= 20) return RiskLevel.HIGH;
+    if (score < 20) return RiskLevel.HIGH;
     if (score >= 5) return RiskLevel.MEDIUM;
     return RiskLevel.LOW;
killedBy: RiskScoreCalculator should return score 0 and LOW risk for empty report
statusReason: expected 'HIGH' to be 'LOW' // Object.is equality
