[Killed] BlockStatement
src/core/domain/token-validator.ts:6:15
     alg: string;
     expiresAt: number;
     payload: string;
-  }): boolean {
-    if (token.expiresAt < Date.now()) {
-      return false; // Token expired
-    }
-
-    // Security check: Algorithmus "none" darf nicht erlaubt sein!
-    if (token.alg === "none") {
-      return false;
-    }
-
-    return true;
-  }
+  }): boolean {}
 }
 
killedBy: TokenValidator should return true for a valid token
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/core/domain/token-validator.ts:7:9
     expiresAt: number;
     payload: string;
   }): boolean {
-    if (token.expiresAt < Date.now()) {
+    if (false) {
       return false; // Token expired
     }
killedBy: TokenValidator should return false if the token is expired
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/domain/token-validator.ts:7:9
     expiresAt: number;
     payload: string;
   }): boolean {
-    if (token.expiresAt < Date.now()) {
+    if (true) {
       return false; // Token expired
     }
killedBy: TokenValidator should return true for a valid token
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/domain/token-validator.ts:8:14
     payload: string;
   }): boolean {
     if (token.expiresAt < Date.now()) {
-      return false; // Token expired
+      return true; // Token expired
     }
 
killedBy: TokenValidator should return false if the token is expired
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/domain/token-validator.ts:12:9
     }
 
     // Security check: Algorithmus "none" darf nicht erlaubt sein!
-    if (token.alg === "none") {
+    if (token.alg !== "none") {
       return false;
     }
killedBy: TokenValidator should return true for a valid token
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/domain/token-validator.ts:12:9
     }
 
     // Security check: Algorithmus "none" darf nicht erlaubt sein!
-    if (token.alg === "none") {
+    if (true) {
       return false;
     }
killedBy: TokenValidator should return true for a valid token
statusReason: expected false to be true // Object.is equality

[NoCoverage] BooleanLiteral
src/core/domain/token-validator.ts:13:14
 
     // Security check: Algorithmus "none" darf nicht erlaubt sein!
     if (token.alg === "none") {
-      return false;
+      return true;
     }
 
