[Survived] BlockStatement
src/infrastructure/db/database.adapter.ts:12:9
 
   constructor() {
     const dbDir = path.resolve(process.cwd(), "reports", "mutation");
-    try {
-      fs.statSync(dbDir);
-    } catch (err) {
+    try {} catch (err) {
       fs.mkdirSync(dbDir, { recursive: true });
     }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:14:19
     const dbDir = path.resolve(process.cwd(), "reports", "mutation");
     try {
       fs.statSync(dbDir);
-    } catch (err) {
-      fs.mkdirSync(dbDir, { recursive: true });
-    }
+    } catch (err) {}
     const dbPath = path.join(dbDir, "stryker.db");
     this.db = new Database(dbPath);

[NoCoverage] BooleanLiteral
src/infrastructure/db/database.adapter.ts:15:40
     try {
       fs.statSync(dbDir);
     } catch (err) {
-      fs.mkdirSync(dbDir, { recursive: true });
+      fs.mkdirSync(dbDir, { recursive: false });
     }
     const dbPath = path.join(dbDir, "stryker.db");

[Survived] ConditionalExpression
src/infrastructure/db/database.adapter.ts:23:26
     this.initCoreTables();
 
     // Check setting for vector features
-    const enableVector = this.getSetting("enable_vector_features", "false") === "true";
+    const enableVector = false;
     
     // Load VSS extension for optional local embeddings ONLY if enabled

[Survived] ConditionalExpression
src/infrastructure/db/database.adapter.ts:23:26
     this.initCoreTables();
 
     // Check setting for vector features
-    const enableVector = this.getSetting("enable_vector_features", "false") === "true";
+    const enableVector = true;
     
     // Load VSS extension for optional local embeddings ONLY if enabled

[Survived] ConditionalExpression
src/infrastructure/db/database.adapter.ts:26:9
     const enableVector = this.getSetting("enable_vector_features", "false") === "true";
     
     // Load VSS extension for optional local embeddings ONLY if enabled
-    if (enableVector) {
+    if (true) {
       try {
         loadVss(this.db as any);

[Survived] ConditionalExpression
src/infrastructure/db/database.adapter.ts:26:9
     const enableVector = this.getSetting("enable_vector_features", "false") === "true";
     
     // Load VSS extension for optional local embeddings ONLY if enabled
-    if (enableVector) {
+    if (false) {
       try {
         loadVss(this.db as any);

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:27:11
     
     // Load VSS extension for optional local embeddings ONLY if enabled
     if (enableVector) {
-      try {
-        loadVss(this.db as any);
-        this.initVectorTables();
-      } catch(e: any) {
+      try {} catch(e: any) {
         console.warn("Could not load sqlite-vss extension, vector features will be disabled.", e.message);
       }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:30:23
       try {
         loadVss(this.db as any);
         this.initVectorTables();
-      } catch(e: any) {
-        console.warn("Could not load sqlite-vss extension, vector features will be disabled.", e.message);
-      }
+      } catch(e: any) {}
     }
     

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:31:22
         loadVss(this.db as any);
         this.initVectorTables();
       } catch(e: any) {
-        console.warn("Could not load sqlite-vss extension, vector features will be disabled.", e.message);
+        console.warn("", e.message);
       }
     }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:89:36
     `);
   }
 
-  private initVectorTables(): void {
-    try {
-      // Create VSS virtual table for 384-dimensional embeddings (all-MiniLM-L6-v2)
-      this.db.exec(`
-        CREATE VIRTUAL TABLE IF NOT EXISTS vss_insights USING vss0(
-          insight_vector(384)
-        );
-      `);
-    } catch(e: any) {
-      console.warn("Could not create VSS tables", e.message);
-    }
-  }
+  private initVectorTables(): void {}
 
   private initSearchTables(): void {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:90:9
   }
 
   private initVectorTables(): void {
-    try {
-      // Create VSS virtual table for 384-dimensional embeddings (all-MiniLM-L6-v2)
-      this.db.exec(`
-        CREATE VIRTUAL TABLE IF NOT EXISTS vss_insights USING vss0(
-          insight_vector(384)
-        );
-      `);
-    } catch(e: any) {
+    try {} catch(e: any) {
       console.warn("Could not create VSS tables", e.message);
     }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:97:21
           insight_vector(384)
         );
       `);
-    } catch(e: any) {
-      console.warn("Could not create VSS tables", e.message);
-    }
+    } catch(e: any) {}
   }
 

[Survived] BlockStatement
src/infrastructure/db/database.adapter.ts:104:9
 
   private initSearchTables(): void {
 
-    try {
-      this.db.exec(`
-        CREATE VIRTUAL TABLE IF NOT EXISTS fts_insights USING fts5(
-          mutant_id UNINDEXED,
-          file_path,
-          insight_text,
-          content='ai_insights',
-          content_rowid='rowid'
-        );
-
-        CREATE TRIGGER IF NOT EXISTS ai_insights_ai AFTER INSERT ON ai_insights BEGIN
-          INSERT INTO fts_insights(rowid, mutant_id, file_path, insight_text) VALUES (new.rowid, new.mutant_id, new.file_path, new.insight_text);
-        END;
-        CREATE TRIGGER IF NOT EXISTS ai_insights_ad AFTER DELETE ON ai_insights BEGIN
-          INSERT INTO fts_insights(fts_insights, rowid, mutant_id, file_path, insight_text) VALUES('delete', old.rowid, old.mutant_id, old.file_path, old.insight_text);
-        END;
-        CREATE TRIGGER IF NOT EXISTS ai_insights_au AFTER UPDATE ON ai_insights BEGIN
-          INSERT INTO fts_insights(fts_insights, rowid, mutant_id, file_path, insight_text) VALUES('delete', old.rowid, old.mutant_id, old.file_path, old.insight_text);
-          INSERT INTO fts_insights(rowid, mutant_id, file_path, insight_text) VALUES (new.rowid, new.mutant_id, new.file_path, new.insight_text);
-        END;
-      `);
-    } catch(e: any) {
+    try {} catch(e: any) {
       console.warn("Could not create FTS5 tables", e);
     }

[Survived] StringLiteral
src/infrastructure/db/database.adapter.ts:105:20
   private initSearchTables(): void {
 
     try {
-      this.db.exec(`
-        CREATE VIRTUAL TABLE IF NOT EXISTS fts_insights USING fts5(
-          mutant_id UNINDEXED,
-          file_path,
-          insight_text,
-          content='ai_insights',
-          content_rowid='rowid'
-        );
-
-        CREATE TRIGGER IF NOT EXISTS ai_insights_ai AFTER INSERT ON ai_insights BEGIN
-          INSERT INTO fts_insights(rowid, mutant_id, file_path, insight_text) VALUES (new.rowid, new.mutant_id, new.file_path, new.insight_text);
-        END;
-        CREATE TRIGGER IF NOT EXISTS ai_insights_ad AFTER DELETE ON ai_insights BEGIN
-          INSERT INTO fts_insights(fts_insights, rowid, mutant_id, file_path, insight_text) VALUES('delete', old.rowid, old.mutant_id, old.file_path, old.insight_text);
-        END;
-        CREATE TRIGGER IF NOT EXISTS ai_insights_au AFTER UPDATE ON ai_insights BEGIN
-          INSERT INTO fts_insights(fts_insights, rowid, mutant_id, file_path, insight_text) VALUES('delete', old.rowid, old.mutant_id, old.file_path, old.insight_text);
-          INSERT INTO fts_insights(rowid, mutant_id, file_path, insight_text) VALUES (new.rowid, new.mutant_id, new.file_path, new.insight_text);
-        END;
-      `);
+      this.db.exec(``);
     } catch(e: any) {
       console.warn("Could not create FTS5 tables", e);

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:125:21
           INSERT INTO fts_insights(rowid, mutant_id, file_path, insight_text) VALUES (new.rowid, new.mutant_id, new.file_path, new.insight_text);
         END;
       `);
-    } catch(e: any) {
-      console.warn("Could not create FTS5 tables", e);
-    }
+    } catch(e: any) {}
   }
 

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:126:20
         END;
       `);
     } catch(e: any) {
-      console.warn("Could not create FTS5 tables", e);
+      console.warn("", e);
     }
   }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:141:51
       VALUES (?, ?, ?, ?, ?, ?)
     `);
 
-    const transaction = this.db.transaction(() => {
-      insertRun.run(
-        runId,
-        summary.mutationScore,
-        summary.killed,
-        summary.survived,
-        summary.total
-      );
-
-      for (const mutant of mutants) {
-        insertMutant.run(
-          mutant.id,
-          runId,
-          mutant.filePath,
-          mutant.mutatorName,
-          mutant.status,
-          mutant.blameAuthor || "Unknown"
-        );
-      }
-    });
+    const transaction = this.db.transaction(() => {});
 
     transaction();

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:150:37
         summary.total
       );
 
-      for (const mutant of mutants) {
-        insertMutant.run(
-          mutant.id,
-          runId,
-          mutant.filePath,
-          mutant.mutatorName,
-          mutant.status,
-          mutant.blameAuthor || "Unknown"
-        );
-      }
+      for (const mutant of mutants) {}
     });
 

[NoCoverage] ConditionalExpression
src/infrastructure/db/database.adapter.ts:157:11
           mutant.filePath,
           mutant.mutatorName,
           mutant.status,
-          mutant.blameAuthor || "Unknown"
+          true
         );
       }

[NoCoverage] LogicalOperator
src/infrastructure/db/database.adapter.ts:157:11
           mutant.filePath,
           mutant.mutatorName,
           mutant.status,
-          mutant.blameAuthor || "Unknown"
+          mutant.blameAuthor && "Unknown"
         );
       }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:165:27
     transaction();
   }
 
-  public getRuns(): any[] {
-    return this.db.prepare(`SELECT * FROM runs ORDER BY timestamp DESC`).all();
-  }
+  public getRuns(): any[] {}
 
   public getMutantsForRun(runId: string): any[] {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:169:49
     return this.db.prepare(`SELECT * FROM runs ORDER BY timestamp DESC`).all();
   }
 
-  public getMutantsForRun(runId: string): any[] {
-    return this.db.prepare(`SELECT * FROM mutants WHERE run_id = ?`).all(runId);
-  }
+  public getMutantsForRun(runId: string): any[] {}
 
   public saveFlakyMutant(mutantId: string, filePath: string, status: string): void {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:173:84
     return this.db.prepare(`SELECT * FROM mutants WHERE run_id = ?`).all(runId);
   }
 
-  public saveFlakyMutant(mutantId: string, filePath: string, status: string): void {
-    this.db.prepare(`
-      INSERT INTO flaky_mutants (mutant_id, file_path, status)
-      VALUES (?, ?, ?)
-    `).run(mutantId, filePath, status);
-  }
+  public saveFlakyMutant(mutantId: string, filePath: string, status: string): void {}
 
   public getFlakyMutants(): any[] {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:180:35
     `).run(mutantId, filePath, status);
   }
 
-  public getFlakyMutants(): any[] {
-    return this.db.prepare(`SELECT * FROM flaky_mutants ORDER BY timestamp DESC`).all();
-  }
+  public getFlakyMutants(): any[] {}
 
   public saveToMutantCache(hash: string, mutantId: string, filePath: string, status: string): void {

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:181:28
   }
 
   public getFlakyMutants(): any[] {
-    return this.db.prepare(`SELECT * FROM flaky_mutants ORDER BY timestamp DESC`).all();
+    return this.db.prepare(``).all();
   }
 

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:184:100
     return this.db.prepare(`SELECT * FROM flaky_mutants ORDER BY timestamp DESC`).all();
   }
 
-  public saveToMutantCache(hash: string, mutantId: string, filePath: string, status: string): void {
-    this.db.prepare(`
-      INSERT OR REPLACE INTO mutant_cache (hash, mutant_id, file_path, status)
-      VALUES (?, ?, ?, ?)
-    `).run(hash, mutantId, filePath, status);
-  }
+  public saveToMutantCache(hash: string, mutantId: string, filePath: string, status: string): void {}
 
   public getFromMutantCache(hash: string): any {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:191:48
     `).run(hash, mutantId, filePath, status);
   }
 
-  public getFromMutantCache(hash: string): any {
-    return this.db.prepare(`SELECT * FROM mutant_cache WHERE hash = ?`).get(hash);
-  }
+  public getFromMutantCache(hash: string): any {}
 
   public saveInsight(mutantId: string, filePath: string, insightText: string, embedding?: number[]): void {

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:192:28
   }
 
   public getFromMutantCache(hash: string): any {
-    return this.db.prepare(`SELECT * FROM mutant_cache WHERE hash = ?`).get(hash);
+    return this.db.prepare(``).get(hash);
   }
 

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:195:107
     return this.db.prepare(`SELECT * FROM mutant_cache WHERE hash = ?`).get(hash);
   }
 
-  public saveInsight(mutantId: string, filePath: string, insightText: string, embedding?: number[]): void {
-    try {
-      this.db.prepare(`
-        INSERT OR REPLACE INTO ai_insights (mutant_id, file_path, insight_text)
-        VALUES (?, ?, ?)
-      `).run(mutantId, filePath, insightText);
-
-      if (embedding && embedding.length > 0) {
-        const row = this.db.prepare(`SELECT rowid FROM ai_insights WHERE mutant_id = ?`).get(mutantId) as any;
-        if (row) {
-          this.db.prepare(`
-            INSERT OR REPLACE INTO vss_insights(rowid, insight_vector) 
-            VALUES (?, ?)
-          `).run(row.rowid, JSON.stringify(embedding));
-        }
-      }
-    } catch(e: any) {
-      console.warn("Failed to save insight text or vector", e);
-    }
-  }
+  public saveInsight(mutantId: string, filePath: string, insightText: string, embedding?: number[]): void {}
 
   public getInsightForMutant(mutantId: string): any {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:196:9
   }
 
   public saveInsight(mutantId: string, filePath: string, insightText: string, embedding?: number[]): void {
-    try {
-      this.db.prepare(`
-        INSERT OR REPLACE INTO ai_insights (mutant_id, file_path, insight_text)
-        VALUES (?, ?, ?)
-      `).run(mutantId, filePath, insightText);
-
-      if (embedding && embedding.length > 0) {
-        const row = this.db.prepare(`SELECT rowid FROM ai_insights WHERE mutant_id = ?`).get(mutantId) as any;
-        if (row) {
-          this.db.prepare(`
-            INSERT OR REPLACE INTO vss_insights(rowid, insight_vector) 
-            VALUES (?, ?)
-          `).run(row.rowid, JSON.stringify(embedding));
-        }
-      }
-    } catch(e: any) {
+    try {} catch(e: any) {
       console.warn("Failed to save insight text or vector", e);
     }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:202:46
         VALUES (?, ?, ?)
       `).run(mutantId, filePath, insightText);
 
-      if (embedding && embedding.length > 0) {
-        const row = this.db.prepare(`SELECT rowid FROM ai_insights WHERE mutant_id = ?`).get(mutantId) as any;
-        if (row) {
-          this.db.prepare(`
-            INSERT OR REPLACE INTO vss_insights(rowid, insight_vector) 
-            VALUES (?, ?)
-          `).run(row.rowid, JSON.stringify(embedding));
-        }
-      }
+      if (embedding && embedding.length > 0) {}
     } catch(e: any) {
       console.warn("Failed to save insight text or vector", e);

[NoCoverage] ConditionalExpression
src/infrastructure/db/database.adapter.ts:202:11
         VALUES (?, ?, ?)
       `).run(mutantId, filePath, insightText);
 
-      if (embedding && embedding.length > 0) {
+      if (true) {
         const row = this.db.prepare(`SELECT rowid FROM ai_insights WHERE mutant_id = ?`).get(mutantId) as any;
         if (row) {

[NoCoverage] ConditionalExpression
src/infrastructure/db/database.adapter.ts:204:13
 
       if (embedding && embedding.length > 0) {
         const row = this.db.prepare(`SELECT rowid FROM ai_insights WHERE mutant_id = ?`).get(mutantId) as any;
-        if (row) {
+        if (true) {
           this.db.prepare(`
             INSERT OR REPLACE INTO vss_insights(rowid, insight_vector) 

[NoCoverage] ConditionalExpression
src/infrastructure/db/database.adapter.ts:204:13
 
       if (embedding && embedding.length > 0) {
         const row = this.db.prepare(`SELECT rowid FROM ai_insights WHERE mutant_id = ?`).get(mutantId) as any;
-        if (row) {
+        if (false) {
           this.db.prepare(`
             INSERT OR REPLACE INTO vss_insights(rowid, insight_vector) 

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:205:27
       if (embedding && embedding.length > 0) {
         const row = this.db.prepare(`SELECT rowid FROM ai_insights WHERE mutant_id = ?`).get(mutantId) as any;
         if (row) {
-          this.db.prepare(`
-            INSERT OR REPLACE INTO vss_insights(rowid, insight_vector) 
-            VALUES (?, ?)
-          `).run(row.rowid, JSON.stringify(embedding));
+          this.db.prepare(``).run(row.rowid, JSON.stringify(embedding));
         }
       }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:211:21
           `).run(row.rowid, JSON.stringify(embedding));
         }
       }
-    } catch(e: any) {
-      console.warn("Failed to save insight text or vector", e);
-    }
+    } catch(e: any) {}
   }
 

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:212:20
         }
       }
     } catch(e: any) {
-      console.warn("Failed to save insight text or vector", e);
+      console.warn("", e);
     }
   }

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:216:53
     }
   }
 
-  public getInsightForMutant(mutantId: string): any {
-    return this.db.prepare(`SELECT * FROM ai_insights WHERE mutant_id = ?`).get(mutantId);
-  }
+  public getInsightForMutant(mutantId: string): any {}
 
   public findSimilarInsights(searchText: string, limit: number = 3): any[] {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:220:76
     return this.db.prepare(`SELECT * FROM ai_insights WHERE mutant_id = ?`).get(mutantId);
   }
 
-  public findSimilarInsights(searchText: string, limit: number = 3): any[] {
-    try {
-      const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, ' ').trim().split(/\s+/).join(' OR ');
-      if (!sanitized) return [];
-
-      const rows = this.db.prepare(`
-        SELECT mutant_id, file_path, insight_text, rank
-        FROM fts_insights
-        WHERE fts_insights MATCH ?
-        ORDER BY rank
-        LIMIT ?
-      `).all(sanitized, limit);
-      return rows;
-    } catch(e: any) {
-      console.warn("FTS search failed", e);
-      return [];
-    }
-  }
+  public findSimilarInsights(searchText: string, limit: number = 3): any[] {}
 
   public findSimilarInsightsVector(embedding: number[], limit: number = 3): any[] {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:221:9
   }
 
   public findSimilarInsights(searchText: string, limit: number = 3): any[] {
-    try {
-      const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, ' ').trim().split(/\s+/).join(' OR ');
-      if (!sanitized) return [];
-
-      const rows = this.db.prepare(`
-        SELECT mutant_id, file_path, insight_text, rank
-        FROM fts_insights
-        WHERE fts_insights MATCH ?
-        ORDER BY rank
-        LIMIT ?
-      `).all(sanitized, limit);
-      return rows;
-    } catch(e: any) {
+    try {} catch(e: any) {
       console.warn("FTS search failed", e);
       return [];

[NoCoverage] MethodExpression
src/infrastructure/db/database.adapter.ts:222:25
 
   public findSimilarInsights(searchText: string, limit: number = 3): any[] {
     try {
-      const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, ' ').trim().split(/\s+/).join(' OR ');
+      const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, ' ').split(/\s+/).join(' OR ');
       if (!sanitized) return [];
 

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:222:62
 
   public findSimilarInsights(searchText: string, limit: number = 3): any[] {
     try {
-      const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, ' ').trim().split(/\s+/).join(' OR ');
+      const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, "").trim().split(/\s+/).join(' OR ');
       if (!sanitized) return [];
 

[NoCoverage] ConditionalExpression
src/infrastructure/db/database.adapter.ts:223:11
   public findSimilarInsights(searchText: string, limit: number = 3): any[] {
     try {
       const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, ' ').trim().split(/\s+/).join(' OR ');
-      if (!sanitized) return [];
+      if (false) return [];
 
       const rows = this.db.prepare(`

[NoCoverage] ConditionalExpression
src/infrastructure/db/database.adapter.ts:223:11
   public findSimilarInsights(searchText: string, limit: number = 3): any[] {
     try {
       const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, ' ').trim().split(/\s+/).join(' OR ');
-      if (!sanitized) return [];
+      if (true) return [];
 
       const rows = this.db.prepare(`

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:225:36
       const sanitized = searchText.replace(/[^a-zA-Z0-9_]/g, ' ').trim().split(/\s+/).join(' OR ');
       if (!sanitized) return [];
 
-      const rows = this.db.prepare(`
-        SELECT mutant_id, file_path, insight_text, rank
-        FROM fts_insights
-        WHERE fts_insights MATCH ?
-        ORDER BY rank
-        LIMIT ?
-      `).all(sanitized, limit);
+      const rows = this.db.prepare(``).all(sanitized, limit);
       return rows;
     } catch(e: any) {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:233:21
         LIMIT ?
       `).all(sanitized, limit);
       return rows;
-    } catch(e: any) {
-      console.warn("FTS search failed", e);
-      return [];
-    }
+    } catch(e: any) {}
   }
 

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:239:83
     }
   }
 
-  public findSimilarInsightsVector(embedding: number[], limit: number = 3): any[] {
-    try {
-      const rows = this.db.prepare(`
-        SELECT a.mutant_id, a.file_path, a.insight_text, v.distance
-        FROM vss_insights v
-        JOIN ai_insights a ON a.rowid = v.rowid
-        WHERE vss_search(v.insight_vector, ?)
-        ORDER BY v.distance ASC
-        LIMIT ?
-      `).all(JSON.stringify(embedding), limit);
-      return rows;
-    } catch(e: any) {
-      console.warn("VSS search failed", e);
-      return [];
-    }
-  }
+  public findSimilarInsightsVector(embedding: number[], limit: number = 3): any[] {}
 
   public getSetting(key: string, defaultValue: string = ""): string {

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:240:9
   }
 
   public findSimilarInsightsVector(embedding: number[], limit: number = 3): any[] {
-    try {
-      const rows = this.db.prepare(`
-        SELECT a.mutant_id, a.file_path, a.insight_text, v.distance
-        FROM vss_insights v
-        JOIN ai_insights a ON a.rowid = v.rowid
-        WHERE vss_search(v.insight_vector, ?)
-        ORDER BY v.distance ASC
-        LIMIT ?
-      `).all(JSON.stringify(embedding), limit);
-      return rows;
-    } catch(e: any) {
+    try {} catch(e: any) {
       console.warn("VSS search failed", e);
       return [];

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:250:21
         LIMIT ?
       `).all(JSON.stringify(embedding), limit);
       return rows;
-    } catch(e: any) {
-      console.warn("VSS search failed", e);
-      return [];
-    }
+    } catch(e: any) {}
   }
 

[Survived] BlockStatement
src/infrastructure/db/database.adapter.ts:256:69
     }
   }
 
-  public getSetting(key: string, defaultValue: string = ""): string {
-    const row = this.db.prepare(`SELECT value FROM app_settings WHERE key = ?`).get(key) as any;
-    return row ? row.value : defaultValue;
-  }
+  public getSetting(key: string, defaultValue: string = ""): string {}
 
   public setSetting(key: string, value: string): void {

[NoCoverage] StringLiteral
src/infrastructure/db/database.adapter.ts:256:57
     }
   }
 
-  public getSetting(key: string, defaultValue: string = ""): string {
+  public getSetting(key: string, defaultValue: string = "Stryker was here!"): string {
     const row = this.db.prepare(`SELECT value FROM app_settings WHERE key = ?`).get(key) as any;
     return row ? row.value : defaultValue;

[NoCoverage] BlockStatement
src/infrastructure/db/database.adapter.ts:261:55
     return row ? row.value : defaultValue;
   }
 
-  public setSetting(key: string, value: string): void {
-    this.db.prepare(`INSERT OR REPLACE INTO app_settings (key, value) VALUES (?, ?)`).run(key, value);
-  }
+  public setSetting(key: string, value: string): void {}
 }
 
