[Survived] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:8:17
 export class InMemoryEventBusAdapter implements EventBusPort {
   private emitter = new EventEmitter();
 
-  constructor() {
-    // Prevent unhandled 'error' event crashes
-    this.emitter.on('error', (err) => {
-      console.error("EventBus encountered an unhandled error:", err);
-    });
-  }
+  constructor() {}
 
   public publish(event: DomainEvent): void {

[NoCoverage] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:10:39
 
   constructor() {
     // Prevent unhandled 'error' event crashes
-    this.emitter.on('error', (err) => {
-      console.error("EventBus encountered an unhandled error:", err);
-    });
+    this.emitter.on('error', (err) => {});
   }
 

[Survived] StringLiteral
src/infrastructure/event/in-memory-event-bus.adapter.ts:10:21
 
   constructor() {
     // Prevent unhandled 'error' event crashes
-    this.emitter.on('error', (err) => {
+    this.emitter.on("", (err) => {
       console.error("EventBus encountered an unhandled error:", err);
     });

[Killed] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:15:44
     });
   }
 
-  public publish(event: DomainEvent): void {
-    setImmediate(() => {
-      try {
-        const listeners = this.emitter.listeners(event.constructor.name);
-        for (const listener of listeners) {
-          try {
-            const result = listener(event);
-            if (result instanceof Promise) {
-              result.catch((err) => this.emitter.emit('error', err));
-            }
-          } catch (err) {
-            this.emitter.emit('error', err);
-          }
-        }
-      } catch (err) {
-        this.emitter.emit('error', err);
-      }
-    });
-  }
+  public publish(event: DomainEvent): void {}
 
   public subscribe<T extends DomainEvent>(eventClass: { new (...args: any[]): T }, handler: EventHandler<T>): void {
killedBy: InMemoryEventBusAdapter sollte einen Eventhandler registrieren und benachrichtigen
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:16:24
   }
 
   public publish(event: DomainEvent): void {
-    setImmediate(() => {
-      try {
-        const listeners = this.emitter.listeners(event.constructor.name);
-        for (const listener of listeners) {
-          try {
-            const result = listener(event);
-            if (result instanceof Promise) {
-              result.catch((err) => this.emitter.emit('error', err));
-            }
-          } catch (err) {
-            this.emitter.emit('error', err);
-          }
-        }
-      } catch (err) {
-        this.emitter.emit('error', err);
-      }
-    });
+    setImmediate(() => {});
   }
 
killedBy: InMemoryEventBusAdapter sollte einen Eventhandler registrieren und benachrichtigen
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:17:11
 
   public publish(event: DomainEvent): void {
     setImmediate(() => {
-      try {
-        const listeners = this.emitter.listeners(event.constructor.name);
-        for (const listener of listeners) {
-          try {
-            const result = listener(event);
-            if (result instanceof Promise) {
-              result.catch((err) => this.emitter.emit('error', err));
-            }
-          } catch (err) {
-            this.emitter.emit('error', err);
-          }
-        }
-      } catch (err) {
+      try {} catch (err) {
         this.emitter.emit('error', err);
       }
killedBy: InMemoryEventBusAdapter sollte einen Eventhandler registrieren und benachrichtigen
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:19:43
     setImmediate(() => {
       try {
         const listeners = this.emitter.listeners(event.constructor.name);
-        for (const listener of listeners) {
-          try {
-            const result = listener(event);
-            if (result instanceof Promise) {
-              result.catch((err) => this.emitter.emit('error', err));
-            }
-          } catch (err) {
-            this.emitter.emit('error', err);
-          }
-        }
+        for (const listener of listeners) {}
       } catch (err) {
         this.emitter.emit('error', err);
killedBy: InMemoryEventBusAdapter sollte einen Eventhandler registrieren und benachrichtigen
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:20:15
       try {
         const listeners = this.emitter.listeners(event.constructor.name);
         for (const listener of listeners) {
-          try {
-            const result = listener(event);
-            if (result instanceof Promise) {
-              result.catch((err) => this.emitter.emit('error', err));
-            }
-          } catch (err) {
+          try {} catch (err) {
             this.emitter.emit('error', err);
           }
killedBy: InMemoryEventBusAdapter sollte einen Eventhandler registrieren und benachrichtigen
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Survived] ConditionalExpression
src/infrastructure/event/in-memory-event-bus.adapter.ts:22:17
         for (const listener of listeners) {
           try {
             const result = listener(event);
-            if (result instanceof Promise) {
+            if (true) {
               result.catch((err) => this.emitter.emit('error', err));
             }

[NoCoverage] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:22:44
         for (const listener of listeners) {
           try {
             const result = listener(event);
-            if (result instanceof Promise) {
-              result.catch((err) => this.emitter.emit('error', err));
-            }
+            if (result instanceof Promise) {}
           } catch (err) {
             this.emitter.emit('error', err);

[NoCoverage] ArrowFunction
src/infrastructure/event/in-memory-event-bus.adapter.ts:23:28
           try {
             const result = listener(event);
             if (result instanceof Promise) {
-              result.catch((err) => this.emitter.emit('error', err));
+              result.catch(() => undefined);
             }
           } catch (err) {

[NoCoverage] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:25:25
             if (result instanceof Promise) {
               result.catch((err) => this.emitter.emit('error', err));
             }
-          } catch (err) {
-            this.emitter.emit('error', err);
-          }
+          } catch (err) {}
         }
       } catch (err) {

[Killed] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:35:116
     });
   }
 
-  public subscribe<T extends DomainEvent>(eventClass: { new (...args: any[]): T }, handler: EventHandler<T>): void {
-    this.emitter.on(eventClass.name, handler as (...args: any[]) => void);
-  }
+  public subscribe<T extends DomainEvent>(eventClass: { new (...args: any[]): T }, handler: EventHandler<T>): void {}
 
   public unsubscribe<T extends DomainEvent>(eventClass: { new (...args: any[]): T }, handler: EventHandler<T>): void {
killedBy: InMemoryEventBusAdapter sollte einen Eventhandler registrieren und benachrichtigen
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/infrastructure/event/in-memory-event-bus.adapter.ts:39:118
     this.emitter.on(eventClass.name, handler as (...args: any[]) => void);
   }
 
-  public unsubscribe<T extends DomainEvent>(eventClass: { new (...args: any[]): T }, handler: EventHandler<T>): void {
-    this.emitter.off(eventClass.name, handler as (...args: any[]) => void);
-  }
+  public unsubscribe<T extends DomainEvent>(eventClass: { new (...args: any[]): T }, handler: EventHandler<T>): void {}
 }
 
killedBy: InMemoryEventBusAdapter sollte das Abonnement entfernen
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      MutantSurvivedEvent {
