[Survived] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:18:67
 export class GitCliAdapter implements GitServicePort {
   constructor(
     private readonly logger: Logger,
-    private readonly execFn: ExecCommandFn = async (cmd, args) => {
-      const { stdout } = await execFileAsync(cmd, args);
-      return stdout;
-    },
+    private readonly execFn: ExecCommandFn = async (cmd, args) => {},
   ) {}
 

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:24:78
     },
   ) {}
 
-  public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {
-    try {
-      const isDiff =
-        typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
-      const args = isDiff
-        ? ["diff", "--name-only", revisionOrBranch]
-        : ["status", "--porcelain"];
-
-      const output = await this.execFn("git", args);
-      return this.parseGitOutput(output, isDiff);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn("Konnte geänderte Git-Dateien nicht ermitteln:", errObj);
-      return [];
-    }
-  }
+  public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {}
 
   public async getChangedFilesBetween(
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'status', '--porcelain' ] ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:25:9
   ) {}
 
   public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {
-    try {
-      const isDiff =
-        typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
-      const args = isDiff
-        ? ["diff", "--name-only", revisionOrBranch]
-        : ["status", "--porcelain"];
-
-      const output = await this.execFn("git", args);
-      return this.parseGitOutput(output, isDiff);
-    } catch (error) {
+    try {} catch (error) {
       const errObj = error instanceof Error ? error : new Error(String(error));
       this.logger.warn("Konnte geänderte Git-Dateien nicht ermitteln:", errObj);
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'status', '--porcelain' ] ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:27:9
   public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {
     try {
       const isDiff =
-        typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
+        false;
       const args = isDiff
         ? ["diff", "--name-only", revisionOrBranch]
killedBy: GitCliAdapter nutzt git diff, wenn eine Revision übergeben wird
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', …(1) ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] EqualityOperator
src/infrastructure/git/git-cli.adapter.ts:27:9
   public async getChangedFiles(revisionOrBranch?: string): Promise<string[]> {
     try {
       const isDiff =
-        typeof revisionOrBranch === "string" &&
+        typeof revisionOrBranch !== "string" &&
         revisionOrBranch.trim().length > 0;
       const args = isDiff
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'status', '--porcelain' ] ]

Number of calls: 0

[Killed] EqualityOperator
src/infrastructure/git/git-cli.adapter.ts:28:9
     try {
       const isDiff =
         typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
+        revisionOrBranch.trim().length >= 0;
       const args = isDiff
         ? ["diff", "--name-only", revisionOrBranch]
killedBy: GitCliAdapter handhabt leeren Revision-String wie den Standard git status --porcelain
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'status', '--porcelain' ] ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:28:9
     try {
       const isDiff =
         typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
+        true;
       const args = isDiff
         ? ["diff", "--name-only", revisionOrBranch]
killedBy: GitCliAdapter handhabt leeren Revision-String wie den Standard git status --porcelain
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'status', '--porcelain' ] ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:30:12
         typeof revisionOrBranch === "string" &&
         revisionOrBranch.trim().length > 0;
       const args = isDiff
-        ? ["diff", "--name-only", revisionOrBranch]
+        ? ["", "--name-only", revisionOrBranch]
         : ["status", "--porcelain"];
 
killedBy: GitCliAdapter nutzt git diff, wenn eine Revision übergeben wird
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', …(1) ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:30:20
         typeof revisionOrBranch === "string" &&
         revisionOrBranch.trim().length > 0;
       const args = isDiff
-        ? ["diff", "--name-only", revisionOrBranch]
+        ? ["diff", "", revisionOrBranch]
         : ["status", "--porcelain"];
 
killedBy: GitCliAdapter nutzt git diff, wenn eine Revision übergeben wird
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', …(1) ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:31:22
         revisionOrBranch.trim().length > 0;
       const args = isDiff
         ? ["diff", "--name-only", revisionOrBranch]
-        : ["status", "--porcelain"];
+        : ["status", ""];
 
       const output = await this.execFn("git", args);
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'status', '--porcelain' ] ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:33:40
         ? ["diff", "--name-only", revisionOrBranch]
         : ["status", "--porcelain"];
 
-      const output = await this.execFn("git", args);
+      const output = await this.execFn("", args);
       return this.parseGitOutput(output, isDiff);
     } catch (error) {
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'status', '--porcelain' ] ]

Received:

  1st vi.fn() call:

  [
-   "git",

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:35:21
 
       const output = await this.execFn("git", args);
       return this.parseGitOutput(output, isDiff);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn("Konnte geänderte Git-Dateien nicht ermitteln:", errObj);
-      return [];
-    }
+    } catch (error) {}
   }
 
killedBy: GitCliAdapter fängt Fehler in git Befehlen ab, loggt eine Warnung und gibt leeres Array zurück
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:45:24
   public async getChangedFilesBetween(
     fromRevision: string,
     toRevision: string,
-  ): Promise<string[]> {
-    try {
-      const args = ["diff", "--name-only", `${fromRevision}..${toRevision}`];
-      const output = await this.execFn("git", args);
-      return this.parseGitOutput(output, true);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn(
-        `Konnte geänderte Git-Dateien zwischen ${fromRevision} und ${toRevision} nicht ermitteln:`,
-        errObj,
-      );
-      return [];
-    }
-  }
+  ): Promise<string[]> {}
 
   public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {
killedBy: GitCliAdapter extrahiert geänderte Dateien zwischen zwei Revisionen via getChangedFilesBetween
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:46:9
     fromRevision: string,
     toRevision: string,
   ): Promise<string[]> {
-    try {
-      const args = ["diff", "--name-only", `${fromRevision}..${toRevision}`];
-      const output = await this.execFn("git", args);
-      return this.parseGitOutput(output, true);
-    } catch (error) {
+    try {} catch (error) {
       const errObj = error instanceof Error ? error : new Error(String(error));
       this.logger.warn(
killedBy: GitCliAdapter extrahiert geänderte Dateien zwischen zwei Revisionen via getChangedFilesBetween
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:47:29
     toRevision: string,
   ): Promise<string[]> {
     try {
-      const args = ["diff", "--name-only", `${fromRevision}..${toRevision}`];
+      const args = ["diff", "", `${fromRevision}..${toRevision}`];
       const output = await this.execFn("git", args);
       return this.parseGitOutput(output, true);
killedBy: GitCliAdapter extrahiert geänderte Dateien zwischen zwei Revisionen via getChangedFilesBetween
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', …(1) ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:48:40
   ): Promise<string[]> {
     try {
       const args = ["diff", "--name-only", `${fromRevision}..${toRevision}`];
-      const output = await this.execFn("git", args);
+      const output = await this.execFn("", args);
       return this.parseGitOutput(output, true);
     } catch (error) {
killedBy: GitCliAdapter extrahiert geänderte Dateien zwischen zwei Revisionen via getChangedFilesBetween
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', …(1) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Survived] BooleanLiteral
src/infrastructure/git/git-cli.adapter.ts:49:42
     try {
       const args = ["diff", "--name-only", `${fromRevision}..${toRevision}`];
       const output = await this.execFn("git", args);
-      return this.parseGitOutput(output, true);
+      return this.parseGitOutput(output, false);
     } catch (error) {
       const errObj = error instanceof Error ? error : new Error(String(error));

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:50:21
       const args = ["diff", "--name-only", `${fromRevision}..${toRevision}`];
       const output = await this.execFn("git", args);
       return this.parseGitOutput(output, true);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn(
-        `Konnte geänderte Git-Dateien zwischen ${fromRevision} und ${toRevision} nicht ermitteln:`,
-        errObj,
-      );
-      return [];
-    }
+    } catch (error) {}
   }
 
killedBy: GitCliAdapter fängt Fehler in git Befehlen ab, loggt eine Warnung und gibt leeres Array zurück
statusReason: expected undefined to deeply equal []

[Survived] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:53:9
     } catch (error) {
       const errObj = error instanceof Error ? error : new Error(String(error));
       this.logger.warn(
-        `Konnte geänderte Git-Dateien zwischen ${fromRevision} und ${toRevision} nicht ermitteln:`,
+        ``,
         errObj,
       );

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:60:79
     }
   }
 
-  public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {
-    try {
-      const args = [
-        "diff-tree",
-        "--no-commit-id",
-        "--name-only",
-        "-r",
-        commitSha,
-      ];
-      const output = await this.execFn("git", args);
-      return this.parseGitOutput(output, true);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn(
-        `Konnte geänderte Git-Dateien für Commit ${commitSha} nicht ermitteln:`,
-        errObj,
-      );
-      return [];
-    }
-  }
+  public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {}
 
   public async getChangedLineRanges(revisionOrBranch?: string): Promise<string[]> {
killedBy: GitCliAdapter extrahiert geänderte Dateien eines spezifischen Commits via getChangedFilesForCommit
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff-tree', …(4) ] ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:61:9
   }
 
   public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {
-    try {
-      const args = [
-        "diff-tree",
-        "--no-commit-id",
-        "--name-only",
-        "-r",
-        commitSha,
-      ];
-      const output = await this.execFn("git", args);
-      return this.parseGitOutput(output, true);
-    } catch (error) {
+    try {} catch (error) {
       const errObj = error instanceof Error ? error : new Error(String(error));
       this.logger.warn(
killedBy: GitCliAdapter extrahiert geänderte Dateien eines spezifischen Commits via getChangedFilesForCommit
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff-tree', …(4) ] ]

Number of calls: 0

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:63:9
   public async getChangedFilesForCommit(commitSha: string): Promise<string[]> {
     try {
       const args = [
-        "diff-tree",
+        "",
         "--no-commit-id",
         "--name-only",
killedBy: GitCliAdapter extrahiert geänderte Dateien eines spezifischen Commits via getChangedFilesForCommit
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff-tree', …(4) ] ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:64:9
     try {
       const args = [
         "diff-tree",
-        "--no-commit-id",
+        "",
         "--name-only",
         "-r",
killedBy: GitCliAdapter extrahiert geänderte Dateien eines spezifischen Commits via getChangedFilesForCommit
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff-tree', …(4) ] ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:65:9
       const args = [
         "diff-tree",
         "--no-commit-id",
-        "--name-only",
+        "",
         "-r",
         commitSha,
killedBy: GitCliAdapter extrahiert geänderte Dateien eines spezifischen Commits via getChangedFilesForCommit
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff-tree', …(4) ] ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:71:21
       ];
       const output = await this.execFn("git", args);
       return this.parseGitOutput(output, true);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn(
-        `Konnte geänderte Git-Dateien für Commit ${commitSha} nicht ermitteln:`,
-        errObj,
-      );
-      return [];
-    }
+    } catch (error) {}
   }
 
killedBy: GitCliAdapter fängt Fehler in git Befehlen ab, loggt eine Warnung und gibt leeres Array zurück
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:81:83
     }
   }
 
-  public async getChangedLineRanges(revisionOrBranch?: string): Promise<string[]> {
-    try {
-      const isDiff =
-        typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
-      const args = isDiff
-        ? ["diff", "-U0", revisionOrBranch]
-        : ["diff", "-U0"];
-
-      const output = await this.execFn("git", args);
-      return this.parseDiffOutput(output);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn("Konnte geänderte Zeilenbereiche nicht ermitteln:", errObj);
-      return [];
-    }
-  }
+  public async getChangedLineRanges(revisionOrBranch?: string): Promise<string[]> {}
 
   private parseGitOutput(output: string, isDiff: boolean): string[] {
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff', '-U0', 'main' ] ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:82:9
   }
 
   public async getChangedLineRanges(revisionOrBranch?: string): Promise<string[]> {
-    try {
-      const isDiff =
-        typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
-      const args = isDiff
-        ? ["diff", "-U0", revisionOrBranch]
-        : ["diff", "-U0"];
-
-      const output = await this.execFn("git", args);
-      return this.parseDiffOutput(output);
-    } catch (error) {
+    try {} catch (error) {
       const errObj = error instanceof Error ? error : new Error(String(error));
       this.logger.warn("Konnte geänderte Zeilenbereiche nicht ermitteln:", errObj);
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff', '-U0', 'main' ] ]

Number of calls: 0

[Killed] LogicalOperator
src/infrastructure/git/git-cli.adapter.ts:84:9
   public async getChangedLineRanges(revisionOrBranch?: string): Promise<string[]> {
     try {
       const isDiff =
-        typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
+        typeof revisionOrBranch === "string" || revisionOrBranch.trim().length > 0;
       const args = isDiff
         ? ["diff", "-U0", revisionOrBranch]
killedBy: GitCliAdapter getChangedLineRanges gibt Fehler ordnungsgemäß als leeres Array zurück
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Konnte geänderte Zeilenbereiche nicht ermitteln:",

[Killed] EqualityOperator
src/infrastructure/git/git-cli.adapter.ts:85:9
     try {
       const isDiff =
         typeof revisionOrBranch === "string" &&
-        revisionOrBranch.trim().length > 0;
+        revisionOrBranch.trim().length <= 0;
       const args = isDiff
         ? ["diff", "-U0", revisionOrBranch]
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff', '-U0', 'main' ] ]

Received:

  1st vi.fn() call:

  [
    "git",

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:87:12
         typeof revisionOrBranch === "string" &&
         revisionOrBranch.trim().length > 0;
       const args = isDiff
-        ? ["diff", "-U0", revisionOrBranch]
+        ? ["", "-U0", revisionOrBranch]
         : ["diff", "-U0"];
 
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected "vi.fn()" to be called with arguments: [ 'git', [ 'diff', '-U0', 'main' ] ]

Received:

  1st vi.fn() call:

  [
    "git",

[Survived] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:88:12
         revisionOrBranch.trim().length > 0;
       const args = isDiff
         ? ["diff", "-U0", revisionOrBranch]
-        : ["diff", "-U0"];
+        : ["", "-U0"];
 
       const output = await this.execFn("git", args);

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:92:21
 
       const output = await this.execFn("git", args);
       return this.parseDiffOutput(output);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn("Konnte geänderte Zeilenbereiche nicht ermitteln:", errObj);
-      return [];
-    }
+    } catch (error) {}
   }
 
killedBy: GitCliAdapter getChangedLineRanges gibt Fehler ordnungsgemäß als leeres Array zurück
statusReason: expected undefined to deeply equal []

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:94:24
       return this.parseDiffOutput(output);
     } catch (error) {
       const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.warn("Konnte geänderte Zeilenbereiche nicht ermitteln:", errObj);
+      this.logger.warn("", errObj);
       return [];
     }
killedBy: GitCliAdapter getChangedLineRanges gibt Fehler ordnungsgemäß als leeres Array zurück
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Konnte geänderte Zeilenbereiche nicht ermitteln:",

[Killed] ArrayDeclaration
src/infrastructure/git/git-cli.adapter.ts:95:14
     } catch (error) {
       const errObj = error instanceof Error ? error : new Error(String(error));
       this.logger.warn("Konnte geänderte Zeilenbereiche nicht ermitteln:", errObj);
-      return [];
+      return ["Stryker was here"];
     }
   }
killedBy: GitCliAdapter getChangedLineRanges gibt Fehler ordnungsgemäß als leeres Array zurück
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Survived] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:100:19
   }
 
   private parseGitOutput(output: string, isDiff: boolean): string[] {
-    const lines = output
-      .split("\n")
-      .map((line) => line.trim())
-      .filter((line) => line.length > 0);
+    const lines = output.split("\n").map(line => line.trim());
     const tsFiles: string[] = [];
 

[Killed] ArrowFunction
src/infrastructure/git/git-cli.adapter.ts:102:12
   private parseGitOutput(output: string, isDiff: boolean): string[] {
     const lines = output
       .split("\n")
-      .map((line) => line.trim())
+      .map(() => undefined)
       .filter((line) => line.length > 0);
     const tsFiles: string[] = [];
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Survived] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:102:22
   private parseGitOutput(output: string, isDiff: boolean): string[] {
     const lines = output
       .split("\n")
-      .map((line) => line.trim())
+      .map((line) => line)
       .filter((line) => line.length > 0);
     const tsFiles: string[] = [];

[Killed] ArrowFunction
src/infrastructure/git/git-cli.adapter.ts:103:15
     const lines = output
       .split("\n")
       .map((line) => line.trim())
-      .filter((line) => line.length > 0);
+      .filter(() => undefined);
     const tsFiles: string[] = [];
 
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:103:25
     const lines = output
       .split("\n")
       .map((line) => line.trim())
-      .filter((line) => line.length > 0);
+      .filter((line) => false);
     const tsFiles: string[] = [];
 
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] ArrayDeclaration
src/infrastructure/git/git-cli.adapter.ts:104:31
       .split("\n")
       .map((line) => line.trim())
       .filter((line) => line.length > 0);
-    const tsFiles: string[] = [];
+    const tsFiles: string[] = ["Stryker was here"];
 
     for (const line of lines) {
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'Stryker was here', …(3) ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] Regex
src/infrastructure/git/git-cli.adapter.ts:110:40
       let filePath = line;
       if (!isDiff) {
         // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
-        const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
+        const statusMatch = line.match(/^[\s\s]{1,2}\s+(.+)$/);
         filePath = statusMatch ? statusMatch[1].trim() : line;
       }
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'M src/index.ts', …(2) ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] Regex
src/infrastructure/git/git-cli.adapter.ts:110:40
       let filePath = line;
       if (!isDiff) {
         // Format bei `git status --porcelain`: ` M src/foo.ts` oder `?? src/foo.ts`
-        const statusMatch = line.match(/^[\s\S]{1,2}\s+(.+)$/);
+        const statusMatch = line.match(/^[\s\S]\s+(.+)$/);
         filePath = statusMatch ? statusMatch[1].trim() : line;
       }
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [ 'src/index.ts', …(2) ] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:118:11
       const isSpecFile = filePath.endsWith(".spec.ts");
       const isDeclFile = filePath.endsWith(".d.ts");
 
-      if (isTsFile && !isSpecFile && !isDeclFile) {
+      if (false) {
         tsFiles.push(filePath);
       }
killedBy: GitCliAdapter extrahiert geänderte TS-Dateien aus git status --porcelain (ohne revision)
statusReason: expected [] to deeply equal [ 'src/index.ts', 'src/app.ts', …(1) ]

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:131:31
     const results: string[] = [];
     let currentFile = "";
 
-    for (const line of lines) {
-      if (line.startsWith("+++ b/")) {
-        currentFile = line.substring(6).trim();
-      } else if (line.startsWith("@@ ") && currentFile) {
-        if (!currentFile.endsWith(".ts") || currentFile.endsWith(".spec.ts") || currentFile.endsWith(".d.ts")) {
-          continue;
-        }
-
-        const match = line.match(/@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/);
-        if (match) {
-          const startLine = parseInt(match[1], 10);
-          const lineCount = match[2] ? parseInt(match[2], 10) : 1;
-          
-          if (lineCount > 0) {
-            const endLine = startLine + lineCount - 1;
-            results.push(`${currentFile}:${startLine}-${endLine}`);
-          } else {
-            results.push(`${currentFile}:${startLine}-${startLine}`);
-          }
-        }
-      }
-    }
+    for (const line of lines) {}
     
     return results;
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:132:11
     let currentFile = "";
 
     for (const line of lines) {
-      if (line.startsWith("+++ b/")) {
+      if (true) {
         currentFile = line.substring(6).trim();
       } else if (line.startsWith("@@ ") && currentFile) {
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:132:11
     let currentFile = "";
 
     for (const line of lines) {
-      if (line.startsWith("+++ b/")) {
+      if (line.endsWith("+++ b/")) {
         currentFile = line.substring(6).trim();
       } else if (line.startsWith("@@ ") && currentFile) {
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:133:23
 
     for (const line of lines) {
       if (line.startsWith("+++ b/")) {
-        currentFile = line.substring(6).trim();
+        currentFile = line.trim();
       } else if (line.startsWith("@@ ") && currentFile) {
         if (!currentFile.endsWith(".ts") || currentFile.endsWith(".spec.ts") || currentFile.endsWith(".d.ts")) {
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [ '+++ b/src/app.ts:10-13', …(2) ] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Survived] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:133:23
 
     for (const line of lines) {
       if (line.startsWith("+++ b/")) {
-        currentFile = line.substring(6).trim();
+        currentFile = line.substring(6);
       } else if (line.startsWith("@@ ") && currentFile) {
         if (!currentFile.endsWith(".ts") || currentFile.endsWith(".spec.ts") || currentFile.endsWith(".d.ts")) {

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:134:18
     for (const line of lines) {
       if (line.startsWith("+++ b/")) {
         currentFile = line.substring(6).trim();
-      } else if (line.startsWith("@@ ") && currentFile) {
+      } else if (false) {
         if (!currentFile.endsWith(".ts") || currentFile.endsWith(".spec.ts") || currentFile.endsWith(".d.ts")) {
           continue;
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]
