[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:134:57
     for (const line of lines) {
       if (line.startsWith("+++ b/")) {
         currentFile = line.substring(6).trim();
-      } else if (line.startsWith("@@ ") && currentFile) {
-        if (!currentFile.endsWith(".ts") || currentFile.endsWith(".spec.ts") || currentFile.endsWith(".d.ts")) {
-          continue;
-        }
-
-        const match = line.match(/@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/);
-        if (match) {
-          const startLine = parseInt(match[1], 10);
-          const lineCount = match[2] ? parseInt(match[2], 10) : 1;
-          
-          if (lineCount > 0) {
-            const endLine = startLine + lineCount - 1;
-            results.push(`${currentFile}:${startLine}-${endLine}`);
-          } else {
-            results.push(`${currentFile}:${startLine}-${startLine}`);
-          }
-        }
-      }
+      } else if (line.startsWith("@@ ") && currentFile) {}
     }
     
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:135:14
       if (line.startsWith("+++ b/")) {
         currentFile = line.substring(6).trim();
       } else if (line.startsWith("@@ ") && currentFile) {
-        if (!currentFile.endsWith(".ts") || currentFile.endsWith(".spec.ts") || currentFile.endsWith(".d.ts")) {
+        if (!currentFile.startsWith(".ts") || currentFile.endsWith(".spec.ts") || currentFile.endsWith(".d.ts")) {
           continue;
         }
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:135:13
       if (line.startsWith("+++ b/")) {
         currentFile = line.substring(6).trim();
       } else if (line.startsWith("@@ ") && currentFile) {
-        if (!currentFile.endsWith(".ts") || currentFile.endsWith(".spec.ts") || currentFile.endsWith(".d.ts")) {
+        if (false) {
           continue;
         }
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [ 'src/app.ts:10-13', …(3) ] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] Regex
src/infrastructure/git/git-cli.adapter.ts:139:34
           continue;
         }
 
-        const match = line.match(/@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/);
+        const match = line.match(/@@ -\D+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/);
         if (match) {
           const startLine = parseInt(match[1], 10);
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] Regex
src/infrastructure/git/git-cli.adapter.ts:139:34
           continue;
         }
 
-        const match = line.match(/@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/);
+        const match = line.match(/@@ -\d+(?:,\D+)? \+(\d+)(?:,(\d+))? @@/);
         if (match) {
           const startLine = parseInt(match[1], 10);
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [ 'src/app.ts:22-22' ] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:140:13
         }
 
         const match = line.match(/@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/);
-        if (match) {
+        if (false) {
           const startLine = parseInt(match[1], 10);
           const lineCount = match[2] ? parseInt(match[2], 10) : 1;
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:140:20
         }
 
         const match = line.match(/@@ -\d+(?:,\d+)? \+(\d+)(?:,(\d+))? @@/);
-        if (match) {
-          const startLine = parseInt(match[1], 10);
-          const lineCount = match[2] ? parseInt(match[2], 10) : 1;
-          
-          if (lineCount > 0) {
-            const endLine = startLine + lineCount - 1;
-            results.push(`${currentFile}:${startLine}-${endLine}`);
-          } else {
-            results.push(`${currentFile}:${startLine}-${startLine}`);
-          }
-        }
+        if (match) {}
       }
     }
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] EqualityOperator
src/infrastructure/git/git-cli.adapter.ts:144:15
           const startLine = parseInt(match[1], 10);
           const lineCount = match[2] ? parseInt(match[2], 10) : 1;
           
-          if (lineCount > 0) {
+          if (lineCount <= 0) {
             const endLine = startLine + lineCount - 1;
             results.push(`${currentFile}:${startLine}-${endLine}`);
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [ 'src/app.ts:10-10', …(2) ] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:144:15
           const startLine = parseInt(match[1], 10);
           const lineCount = match[2] ? parseInt(match[2], 10) : 1;
           
-          if (lineCount > 0) {
+          if (false) {
             const endLine = startLine + lineCount - 1;
             results.push(`${currentFile}:${startLine}-${endLine}`);
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [ 'src/app.ts:10-10', …(2) ] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] ArithmeticOperator
src/infrastructure/git/git-cli.adapter.ts:145:29
           const lineCount = match[2] ? parseInt(match[2], 10) : 1;
           
           if (lineCount > 0) {
-            const endLine = startLine + lineCount - 1;
+            const endLine = startLine + lineCount + 1;
             results.push(`${currentFile}:${startLine}-${endLine}`);
           } else {
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [ 'src/app.ts:10-15', …(2) ] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] ArithmeticOperator
src/infrastructure/git/git-cli.adapter.ts:145:29
           const lineCount = match[2] ? parseInt(match[2], 10) : 1;
           
           if (lineCount > 0) {
-            const endLine = startLine + lineCount - 1;
+            const endLine = startLine - lineCount - 1;
             results.push(`${currentFile}:${startLine}-${endLine}`);
           } else {
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [ 'src/app.ts:10-5', …(2) ] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[Killed] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:146:26
           
           if (lineCount > 0) {
             const endLine = startLine + lineCount - 1;
-            results.push(`${currentFile}:${startLine}-${endLine}`);
+            results.push(``);
           } else {
             results.push(`${currentFile}:${startLine}-${startLine}`);
killedBy: GitCliAdapter getChangedLineRanges extrahiert geänderte Zeilenbereiche
statusReason: expected [ '', '', '' ] to deeply equal [ 'src/app.ts:10-13', …(2) ]

[NoCoverage] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:147:18
           if (lineCount > 0) {
             const endLine = startLine + lineCount - 1;
             results.push(`${currentFile}:${startLine}-${endLine}`);
-          } else {
-            results.push(`${currentFile}:${startLine}-${startLine}`);
-          }
+          } else {}
         }
       }

[NoCoverage] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:163:9
     commitHash: string;
     timestamp: Date;
   } | undefined> {
-    try {
-      const output = await this.execFn("git", [
-        "blame",
-        "-L",
-        `${line},${line}`,
-        "--porcelain",
-        filePath
-      ]);
-      
-      const lines = output.split('\n');
-      if (lines.length === 0) return undefined;
-      
-      const commitHash = lines[0].split(' ')[0];
-      let author = "Unknown";
-      let authorEmail = "unknown@example.com";
-      let timestamp = new Date();
-      
-      for (const l of lines) {
-        if (l.startsWith("author ")) author = l.substring(7);
-        if (l.startsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
-        if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);
-      }
-      
-      return { author, authorEmail, commitHash, timestamp };
-    } catch (e) {
+    try {} catch (e) {
       return undefined;
     }

[NoCoverage] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:168:9
         "blame",
         "-L",
         `${line},${line}`,
-        "--porcelain",
+        "",
         filePath
       ]);

[NoCoverage] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:172:34
         filePath
       ]);
       
-      const lines = output.split('\n');
+      const lines = output.split("");
       if (lines.length === 0) return undefined;
       

[NoCoverage] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:173:11
       ]);
       
       const lines = output.split('\n');
-      if (lines.length === 0) return undefined;
+      if (true) return undefined;
       
       const commitHash = lines[0].split(' ')[0];

[NoCoverage] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:173:11
       ]);
       
       const lines = output.split('\n');
-      if (lines.length === 0) return undefined;
+      if (false) return undefined;
       
       const commitHash = lines[0].split(' ')[0];

[NoCoverage] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:175:41
       const lines = output.split('\n');
       if (lines.length === 0) return undefined;
       
-      const commitHash = lines[0].split(' ')[0];
+      const commitHash = lines[0].split("")[0];
       let author = "Unknown";
       let authorEmail = "unknown@example.com";

[NoCoverage] StringLiteral
src/infrastructure/git/git-cli.adapter.ts:177:25
       
       const commitHash = lines[0].split(' ')[0];
       let author = "Unknown";
-      let authorEmail = "unknown@example.com";
+      let authorEmail = "";
       let timestamp = new Date();
       

[NoCoverage] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:180:30
       let authorEmail = "unknown@example.com";
       let timestamp = new Date();
       
-      for (const l of lines) {
-        if (l.startsWith("author ")) author = l.substring(7);
-        if (l.startsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
-        if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);
-      }
+      for (const l of lines) {}
       
       return { author, authorEmail, commitHash, timestamp };

[NoCoverage] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:181:13
       let timestamp = new Date();
       
       for (const l of lines) {
-        if (l.startsWith("author ")) author = l.substring(7);
+        if (false) author = l.substring(7);
         if (l.startsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
         if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);

[NoCoverage] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:181:13
       let timestamp = new Date();
       
       for (const l of lines) {
-        if (l.startsWith("author ")) author = l.substring(7);
+        if (l.endsWith("author ")) author = l.substring(7);
         if (l.startsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
         if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);

[NoCoverage] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:182:13
       
       for (const l of lines) {
         if (l.startsWith("author ")) author = l.substring(7);
-        if (l.startsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
+        if (l.endsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
         if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);
       }

[NoCoverage] ConditionalExpression
src/infrastructure/git/git-cli.adapter.ts:182:13
       
       for (const l of lines) {
         if (l.startsWith("author ")) author = l.substring(7);
-        if (l.startsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
+        if (false) authorEmail = l.substring(12).replace(/[<>]/g, "");
         if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);
       }

[NoCoverage] ArithmeticOperator
src/infrastructure/git/git-cli.adapter.ts:183:64
       for (const l of lines) {
         if (l.startsWith("author ")) author = l.substring(7);
         if (l.startsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
-        if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);
+        if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) / 1000);
       }
       

[NoCoverage] MethodExpression
src/infrastructure/git/git-cli.adapter.ts:183:13
       for (const l of lines) {
         if (l.startsWith("author ")) author = l.substring(7);
         if (l.startsWith("author-mail ")) authorEmail = l.substring(12).replace(/[<>]/g, "");
-        if (l.startsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);
+        if (l.endsWith("author-time ")) timestamp = new Date(parseInt(l.substring(12)) * 1000);
       }
       

[NoCoverage] BlockStatement
src/infrastructure/git/git-cli.adapter.ts:187:17
       }
       
       return { author, authorEmail, commitHash, timestamp };
-    } catch (e) {
-      return undefined;
-    }
+    } catch (e) {}
   }
 }
