[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:38:17
       resources: [
         {
           uri: "stryker://report/latest",
-          name: "Latest Mutation Testing Report",
+          name: "",
           mimeType: "application/json",
           description:

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:41:13
           name: "Latest Mutation Testing Report",
           mimeType: "application/json",
           description:
-            "Der vollständige Stryker Mutation Testing Report im JSON-Format.",
+            "",
         },
         {

[Killed] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:44:16
             "Der vollständige Stryker Mutation Testing Report im JSON-Format.",
         },
         {
-          uri: "stryker://report/summary",
+          uri: "",
           name: "Mutation Testing Summary Metrics",
           mimeType: "application/json",
killedBy: McpResourceController ListResources should return the correct list of resources
statusReason: expected [ 'stryker://report/latest', '', …(6) ] to deeply equal [ 'stryker://report/latest', …(7) ]

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:45:17
         },
         {
           uri: "stryker://report/summary",
-          name: "Mutation Testing Summary Metrics",
+          name: "",
           mimeType: "application/json",
           description:

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:46:21
         {
           uri: "stryker://report/summary",
           name: "Mutation Testing Summary Metrics",
-          mimeType: "application/json",
+          mimeType: "",
           description:
             "Kompakte Zusammenfassung der Mutations-Metriken (Score, Killed, Survived).",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:55:13
           name: "Survived Mutants List",
           mimeType: "application/json",
           description:
-            "Liste aller überlebenden Mutanten inkl. Pfad, Zeile, Mutator und Ersetzung.",
+            "",
         },
         {

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:59:17
         },
         {
           uri: "stryker://report/killed",
-          name: "Killed Mutants List",
+          name: "",
           mimeType: "application/json",
           description: "Liste aller getöteten Mutanten (positiv bewertet).",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:60:21
         {
           uri: "stryker://report/killed",
           name: "Killed Mutants List",
-          mimeType: "application/json",
+          mimeType: "",
           description: "Liste aller getöteten Mutanten (positiv bewertet).",
         },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:61:24
           uri: "stryker://report/killed",
           name: "Killed Mutants List",
           mimeType: "application/json",
-          description: "Liste aller getöteten Mutanten (positiv bewertet).",
+          description: "",
         },
         {

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:63:9
           mimeType: "application/json",
           description: "Liste aller getöteten Mutanten (positiv bewertet).",
         },
-        {
-          uri: "stryker://analytics/trends",
-          name: "Mutation Testing Score Trends",
-          mimeType: "application/json",
-          description:
-            "Historische Trendanalyse der Mutationsscore-Entwicklung.",
-        },
+        {},
         {
           uri: "stryker://analytics/flaky-mutants",
killedBy: McpResourceController ListResources should return the correct list of resources
statusReason: expected [ 'stryker://report/latest', …(7) ] to deeply equal [ 'stryker://report/latest', …(7) ]

[Killed] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:64:16
           description: "Liste aller getöteten Mutanten (positiv bewertet).",
         },
         {
-          uri: "stryker://analytics/trends",
+          uri: "",
           name: "Mutation Testing Score Trends",
           mimeType: "application/json",
killedBy: McpResourceController ListResources should return the correct list of resources
statusReason: expected [ 'stryker://report/latest', …(7) ] to deeply equal [ 'stryker://report/latest', …(7) ]

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:73:21
         {
           uri: "stryker://analytics/flaky-mutants",
           name: "Flaky Mutants",
-          mimeType: "application/json",
+          mimeType: "",
           description: "List of flaky mutants that flip between Killed and Survived.",
         },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:80:24
           uri: "stryker://analytics/coverage-fake-hotspots",
           name: "Coverage Gap Analysis",
           mimeType: "application/json",
-          description: "Analysis of files with high coverage but high mutation survival rate.",
+          description: "",
         },
         {

[Killed] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:83:16
           description: "Analysis of files with high coverage but high mutation survival rate.",
         },
         {
-          uri: "stryker://status",
+          uri: "",
           name: "Stryker Execution Status",
           mimeType: "application/json",
killedBy: McpResourceController ListResources should return the correct list of resources
statusReason: expected [ 'stryker://report/latest', …(7) ] to deeply equal [ 'stryker://report/latest', …(7) ]

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:96:26
       ReadResourceRequestSchema,
       async (request) => {
         const uri = request.params.uri;
-        this.logger.info(`[MCP] Resource Request received: ${uri}`);
+        this.logger.info(``);
 
         if (uri === "stryker://report/latest") {

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-resource.controller.ts:101:23
         if (uri === "stryker://report/latest") {
           const report = this.reportStream.current();
           return {
-            contents: [
-              {
-                uri,
-                mimeType: "application/json",
-                text: JSON.stringify(report ?? { files: {} }),
-              },
-            ],
+            contents: [],
           };
         }
killedBy: McpResourceController ReadResource should read latest report when present
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:105:48
               {
                 uri,
                 mimeType: "application/json",
-                text: JSON.stringify(report ?? { files: {} }),
+                text: JSON.stringify(report ?? {}),
               },
             ],
killedBy: McpResourceController ReadResource should fallback to empty files when no latest report
statusReason: expected '{}' to be '{"files":{}}' // Object.is equality

[Survived] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:121:27
             contents: [
               {
                 uri,
-                mimeType: "application/json",
+                mimeType: "",
                 text: summaryText,
               },

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-resource.controller.ts:128:13
           };
         }
 
-        if (uri === "stryker://report/survived") {
+        if (true) {
           const survivedResult = await this.getSurvivedUseCase.execute();
           const text = survivedResult.isOk
killedBy: McpResourceController ReadResource should read killed when Ok
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-resource.controller.ts:135:23
             : JSON.stringify({ error: survivedResult.error.message });
 
           return {
-            contents: [
-              {
-                uri,
-                mimeType: "application/json",
-                text,
-              },
-            ],
+            contents: [],
           };
         }
killedBy: McpResourceController ReadResource should read survived when Ok
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-resource.controller.ts:145:13
           };
         }
 
-        if (uri === "stryker://report/killed") {
+        if (uri !== "stryker://report/killed") {
           const killedResult = this.getKilledUseCase.execute();
           const text = killedResult.isOk
killedBy: McpResourceController ReadResource should read killed when Ok
statusReason: Ressource nicht gefunden

[Killed] BlockStatement
src/infrastructure/mcp/mcp-resource.controller.ts:145:48
           };
         }
 
-        if (uri === "stryker://report/killed") {
-          const killedResult = this.getKilledUseCase.execute();
-          const text = killedResult.isOk
-            ? JSON.stringify(killedResult.value, null, 2)
-            : JSON.stringify({ error: killedResult.error.message });
-
-          return {
-            contents: [
-              {
-                uri,
-                mimeType: "application/json",
-                text,
-              },
-            ],
-          };
-        }
+        if (uri === "stryker://report/killed") {}
 
         if (uri === "stryker://analytics/trends") {
killedBy: McpResourceController ReadResource should read killed when Ok
statusReason: Ressource nicht gefunden

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-resource.controller.ts:162:13
           };
         }
 
-        if (uri === "stryker://analytics/trends") {
+        if (false) {
           const summary = this.getSummaryUseCase.execute();
           if (summary.isOk) {
killedBy: McpResourceController ReadResource should record trend and read trends when summary Ok
statusReason: Ressource nicht gefunden

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-resource.controller.ts:164:15
 
         if (uri === "stryker://analytics/trends") {
           const summary = this.getSummaryUseCase.execute();
-          if (summary.isOk) {
+          if (false) {
             this.trendTracker.recordRun({
               timestamp: new Date().toISOString(),
killedBy: McpResourceController ReadResource should record trend and read trends when summary Ok
statusReason: expected '{\n  "scoreDelta": 0,\n  "isImproving…' to contain '"latestScore": 90'

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:173:18
               survivedMutants: summary.value.survived,
             });
           }
-          return {
-            contents: [
-              {
-                uri,
-                mimeType: "application/json",
-                text: JSON.stringify(
-                  this.trendTracker.getTrendSummary(),
-                  null,
-                  2,
-                ),
-              },
-            ],
-          };
+          return {};
         }
 
killedBy: McpResourceController ReadResource should record trend and read trends when summary Ok
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-resource.controller.ts:188:13
           };
         }
 
-        if (uri === "stryker://analytics/flaky-mutants") {
+        if (uri !== "stryker://analytics/flaky-mutants") {
           const report = this.reportStream.current();
           
killedBy: McpResourceController ReadResource should read status
statusReason: expected '[]' to contain 'test running'

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-resource.controller.ts:188:13
           };
         }
 
-        if (uri === "stryker://analytics/flaky-mutants") {
+        if (true) {
           const report = this.reportStream.current();
           
killedBy: McpResourceController ReadResource should read status
statusReason: expected '[]' to contain 'test running'

[NoCoverage] LogicalOperator
src/infrastructure/mcp/mcp-resource.controller.ts:192:15
           const report = this.reportStream.current();
           
           let mutants: any[] = [];
-          if (report && report.files) {
+          if (report || report.files) {
             for (const [filePath, file] of Object.entries(report.files)) {
               if (file.mutants) {

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-resource.controller.ts:192:39
           const report = this.reportStream.current();
           
           let mutants: any[] = [];
-          if (report && report.files) {
-            for (const [filePath, file] of Object.entries(report.files)) {
-              if (file.mutants) {
-                mutants = mutants.concat(file.mutants.map(m => ({
-                  id: m.id,
-                  filePath,
-                  status: m.status
-                })));
-              }
-            }
-          }
+          if (report && report.files) {}
           
           const flaky = this.trackTestFlakinessUseCase.execute(mutants);

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-resource.controller.ts:193:74
           
           let mutants: any[] = [];
           if (report && report.files) {
-            for (const [filePath, file] of Object.entries(report.files)) {
-              if (file.mutants) {
-                mutants = mutants.concat(file.mutants.map(m => ({
-                  id: m.id,
-                  filePath,
-                  status: m.status
-                })));
-              }
-            }
+            for (const [filePath, file] of Object.entries(report.files)) {}
           }
           

[NoCoverage] ConditionalExpression
src/infrastructure/mcp/mcp-resource.controller.ts:194:19
           let mutants: any[] = [];
           if (report && report.files) {
             for (const [filePath, file] of Object.entries(report.files)) {
-              if (file.mutants) {
+              if (false) {
                 mutants = mutants.concat(file.mutants.map(m => ({
                   id: m.id,

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-resource.controller.ts:194:33
           let mutants: any[] = [];
           if (report && report.files) {
             for (const [filePath, file] of Object.entries(report.files)) {
-              if (file.mutants) {
-                mutants = mutants.concat(file.mutants.map(m => ({
-                  id: m.id,
-                  filePath,
-                  status: m.status
-                })));
-              }
+              if (file.mutants) {}
             }
           }

[NoCoverage] ArrowFunction
src/infrastructure/mcp/mcp-resource.controller.ts:195:59
           if (report && report.files) {
             for (const [filePath, file] of Object.entries(report.files)) {
               if (file.mutants) {
-                mutants = mutants.concat(file.mutants.map(m => ({
-                  id: m.id,
-                  filePath,
-                  status: m.status
-                })));
+                mutants = mutants.concat(file.mutants.map(() => undefined));
               }
             }

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-resource.controller.ts:217:13
           };
         }
 
-        if (uri === "stryker://analytics/coverage-fake-hotspots") {
+        if (true) {
           const result = this.analyzeCoverageGapUseCase.execute();
           const text = result.isOk
killedBy: McpResourceController ReadResource should read status
statusReason: expected '[]' to contain 'test running'

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-resource.controller.ts:217:13
           };
         }
 
-        if (uri === "stryker://analytics/coverage-fake-hotspots") {
+        if (uri !== "stryker://analytics/coverage-fake-hotspots") {
           const result = this.analyzeCoverageGapUseCase.execute();
           const text = result.isOk
killedBy: McpResourceController ReadResource should read status
statusReason: expected '[]' to contain 'test running'

[NoCoverage] ObjectLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:225:15
 
           return {
             contents: [
-              {
-                uri,
-                mimeType: "application/json",
-                text,
-              },
+              {},
             ],
           };

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-resource.controller.ts:237:23
         if (uri === "stryker://status") {
           const status = this.statusStream.current();
           return {
-            contents: [
-              {
-                uri,
-                mimeType: "application/json",
-                text: JSON.stringify(status),
-              },
-            ],
+            contents: [],
           };
         }
killedBy: McpResourceController ReadResource should read status
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] StringLiteral
src/infrastructure/mcp/mcp-resource.controller.ts:247:25
           };
         }
 
-        throw new Error("Ressource nicht gefunden");
+        throw new Error("");
       },
     );
killedBy: McpResourceController ReadResource should throw error for unknown uri
statusReason: expected [Function] to throw error including 'Ressource nicht gefunden' but got ''
