[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:20:59
 import type { DetectEquivalentMutantsUseCase } from "../../core/application/detect-equivalent-mutants.use-case.js";
 import type { NotificationServicePort } from "../../core/domain/notification-service.port.js";
 
-function parseFilePath(args: unknown): string | undefined {
-  if (typeof args !== "object" || args === null) return undefined;
-  const rawPath = (args as { filePath?: unknown }).filePath;
-  return typeof rawPath === "string" && rawPath.trim() !== ""
-    ? rawPath.trim()
-    : undefined;
-}
+function parseFilePath(args: unknown): string | undefined {}
 
 export class McpToolController {
killedBy: McpToolController CallTool get_survived_mutants should return mutants on ok
statusReason: expected "vi.fn()" to be called with arguments: [ 'x.ts' ]

Received:

  1st vi.fn() call:

  [
-   "x.ts",

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:21:35
 import type { NotificationServicePort } from "../../core/domain/notification-service.port.js";
 
 function parseFilePath(args: unknown): string | undefined {
-  if (typeof args !== "object" || args === null) return undefined;
+  if (typeof args !== "object" || false) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
   return typeof rawPath === "string" && rawPath.trim() !== ""
killedBy: McpToolController CallTool suggest_mutant_fixes should suggest fixes for invalid survived mutants gracefully
statusReason: Cannot read properties of null (reading 'filePath')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:23:10
 function parseFilePath(args: unknown): string | undefined {
   if (typeof args !== "object" || args === null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
-  return typeof rawPath === "string" && rawPath.trim() !== ""
+  return false
     ? rawPath.trim()
     : undefined;
killedBy: McpToolController CallTool get_survived_mutants should return mutants on ok
statusReason: expected "vi.fn()" to be called with arguments: [ 'x.ts' ]

Received:

  1st vi.fn() call:

  [
-   "x.ts",

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-tool.controller.ts:23:10
 function parseFilePath(args: unknown): string | undefined {
   if (typeof args !== "object" || args === null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
-  return typeof rawPath === "string" && rawPath.trim() !== ""
+  return typeof rawPath !== "string" && rawPath.trim() !== ""
     ? rawPath.trim()
     : undefined;
killedBy: McpToolController CallTool get_survived_mutants should return mutants on ok
statusReason: expected "vi.fn()" to be called with arguments: [ 'x.ts' ]

Received:

  1st vi.fn() call:

  [
-   "x.ts",

[Killed] MethodExpression
src/infrastructure/mcp/mcp-tool.controller.ts:24:7
   if (typeof args !== "object" || args === null) return undefined;
   const rawPath = (args as { filePath?: unknown }).filePath;
   return typeof rawPath === "string" && rawPath.trim() !== ""
-    ? rawPath.trim()
+    ? rawPath
     : undefined;
 }
killedBy: McpToolController CallTool get_survived_mutants should return mutants on ok
statusReason: expected "vi.fn()" to be called with arguments: [ 'x.ts' ]

Received:

  1st vi.fn() call:

  [
-   "x.ts",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:51:13
         {
           name: "run_mutation_tests",
           description:
-            "Führt Stryker Mutationstests für das Projekt oder spezifische Dateien aus.",
+            "",
           inputSchema: {
             type: "object",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:62:23
                   "Array von Datei-Globs für Mutationen (z.B. ['src/calculator.ts']).",
               },
               concurrency: {
-                type: "number",
+                type: "",
                 description: "Anzahl paralleler Test-Runner-Prozesse.",
               },

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:69:27
                 type: "string",
                 description: "Name des Test-Runners (z.B. 'vitest').",
               },
-              configFile: {
-                type: "string",
-                description: "Pfad zur Stryker Konfigurationsdatei.",
-              },
+              configFile: {},
             },
           },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:71:30
               },
               configFile: {
                 type: "string",
-                description: "Pfad zur Stryker Konfigurationsdatei.",
+                description: "",
               },
             },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:81:19
           description:
             "Erkennt in Git geänderte TypeScript-Dateien (für Commits, Commit-Ranges oder Uncommitted Changes) und führt Mutationstests gezielt nur für diese aus.",
           inputSchema: {
-            type: "object",
+            type: "",
             properties: {
               commitSha: {

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:83:26
           inputSchema: {
             type: "object",
             properties: {
-              commitSha: {
-                type: "string",
-                description:
-                  "Spezifischer Commit-Hash für gezielten Testlauf (z.B. 'a9d1206').",
-              },
+              commitSha: {},
               revision: {
                 type: "string",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:84:23
             type: "object",
             properties: {
               commitSha: {
-                type: "string",
+                type: "",
                 description:
                   "Spezifischer Commit-Hash für gezielten Testlauf (z.B. 'a9d1206').",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:91:19
               revision: {
                 type: "string",
                 description:
-                  "Ziel-Branch oder Revision für Git-Diff (z.B. 'HEAD~1' oder 'main').",
+                  "",
               },
               fromRevision: {

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:94:23
                   "Ziel-Branch oder Revision für Git-Diff (z.B. 'HEAD~1' oder 'main').",
               },
               fromRevision: {
-                type: "string",
+                type: "",
                 description:
                   "Start-Revision für Commit-Bereich (z.B. 'v1.0.0' oder 'HEAD~3').",

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:98:27
                 description:
                   "Start-Revision für Commit-Bereich (z.B. 'v1.0.0' oder 'HEAD~3').",
               },
-              toRevision: {
-                type: "string",
-                description: "Die End-Revision (Git).",
-              },
+              toRevision: {},
               useLineRanges: {
                 type: "boolean",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:100:30
               },
               toRevision: {
                 type: "string",
-                description: "Die End-Revision (Git).",
+                description: "",
               },
               useLineRanges: {

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:102:30
                 type: "string",
                 description: "Die End-Revision (Git).",
               },
-              useLineRanges: {
-                type: "boolean",
-                description: "Wenn true, werden nur die geänderten Zeilen statt der ganzen Dateien mutiert (Git Delta).",
-              },
+              useLineRanges: {},
               baseBranch: {
                 type: "string",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:103:23
                 description: "Die End-Revision (Git).",
               },
               useLineRanges: {
-                type: "boolean",
+                type: "",
                 description: "Wenn true, werden nur die geänderten Zeilen statt der ganzen Dateien mutiert (Git Delta).",
               },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:104:30
               },
               useLineRanges: {
                 type: "boolean",
-                description: "Wenn true, werden nur die geänderten Zeilen statt der ganzen Dateien mutiert (Git Delta).",
+                description: "",
               },
               baseBranch: {

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:107:23
                 description: "Wenn true, werden nur die geänderten Zeilen statt der ganzen Dateien mutiert (Git Delta).",
               },
               baseBranch: {
-                type: "string",
+                type: "",
                 description: "Veraltet: Nutze 'revision' stattdessen.",
               },

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:117:24
           name: "suggest_mutant_fixes",
           description:
             "Generiert KI-gestützte Behebungsratschläge, konkrete Code-Assertions und Boundary-Tests für überlebte Mutanten.",
-          inputSchema: {
-            type: "object",
-            properties: {
-              filePath: {
-                type: "string",
-                description:
-                  "Optionaler Dateipfad-Filter (z.B. 'src/calculator.ts').",
-              },
-              profile: {
-                type: "string",
-                enum: ["local", "cloud", "regex"],
-                description:
-                  "Das Remediation-Profil. 'local' für lokales LLM, 'cloud' für Cloud LLM, 'regex' für klassischen AST-Fallback.",
-              }
-            },
-          },
+          inputSchema: {},
         },
         {

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:119:25
             "Generiert KI-gestützte Behebungsratschläge, konkrete Code-Assertions und Boundary-Tests für überlebte Mutanten.",
           inputSchema: {
             type: "object",
-            properties: {
-              filePath: {
-                type: "string",
-                description:
-                  "Optionaler Dateipfad-Filter (z.B. 'src/calculator.ts').",
-              },
-              profile: {
-                type: "string",
-                enum: ["local", "cloud", "regex"],
-                description:
-                  "Das Remediation-Profil. 'local' für lokales LLM, 'cloud' für Cloud LLM, 'regex' für klassischen AST-Fallback.",
-              }
-            },
+            properties: {},
           },
         },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:127:24
               },
               profile: {
                 type: "string",
-                enum: ["local", "cloud", "regex"],
+                enum: ["", "cloud", "regex"],
                 description:
                   "Das Remediation-Profil. 'local' für lokales LLM, 'cloud' für Cloud LLM, 'regex' für klassischen AST-Fallback.",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:129:19
                 type: "string",
                 enum: ["local", "cloud", "regex"],
                 description:
-                  "Das Remediation-Profil. 'local' für lokales LLM, 'cloud' für Cloud LLM, 'regex' für klassischen AST-Fallback.",
+                  "",
               }
             },

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:141:29
           inputSchema: {
             type: "object",
             properties: {
-              changedFiles: {
-                type: "array",
-                items: { type: "string" },
-                description: "Liste der geänderten Dateipfade.",
-              },
+              changedFiles: {},
             },
             required: ["changedFiles"],

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:153:13
         {
           name: "generate_testing_cheat_sheet",
           description:
-            "Analysiert überlebende Mutanten und generiert ein Best-Practice Cheat Sheet mit typischen Anti-Pattern und Lösungsvorschlägen.",
+            "",
           inputSchema: {
             type: "object",

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:154:24
           name: "generate_testing_cheat_sheet",
           description:
             "Analysiert überlebende Mutanten und generiert ein Best-Practice Cheat Sheet mit typischen Anti-Pattern und Lösungsvorschlägen.",
-          inputSchema: {
-            type: "object",
-            properties: {
-              filePath: {
-                type: "string",
-                description:
-                  "Optionaler Dateipfad-Filter für das Cheat Sheet (z.B. 'src/calculator.ts').",
-              },
-            },
-          },
+          inputSchema: {},
         },
         {

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:167:24
         },
         {
           name: "detect_equivalent_mutants",
-          description: "Sucht in den überlebenden Mutanten nach semantisch äquivalenten Mutationen und schlägt Code zur Unterdrückung vor.",
+          description: "",
           inputSchema: {
             type: "object",

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:171:25
           inputSchema: {
             type: "object",
             properties: {
-              filePath: {
-                type: "string",
-                description: "Optionaler Dateipfad-Filter (z.B. 'src/calculator.ts').",
-              }
+              filePath: {}
             }
           }

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:172:23
             type: "object",
             properties: {
               filePath: {
-                type: "string",
+                type: "",
                 description: "Optionaler Dateipfad-Filter (z.B. 'src/calculator.ts').",
               }

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:178:9
             }
           }
         },
-        {
-          name: "get_mutation_score",
-          description:
-            "Ruft den aktuellen Mutationsscore und eine detaillierte Zusammenfassung ab.",
-          inputSchema: {
-            type: "object",
-            properties: {},
-          },
-        },
+        {},
         {
           name: "get_survived_mutants",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:179:17
           }
         },
         {
-          name: "get_mutation_score",
+          name: "",
           description:
             "Ruft den aktuellen Mutationsscore und eine detaillierte Zusammenfassung ab.",

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:182:24
           name: "get_mutation_score",
           description:
             "Ruft den aktuellen Mutationsscore und eine detaillierte Zusammenfassung ab.",
-          inputSchema: {
-            type: "object",
-            properties: {},
-          },
+          inputSchema: {},
         },
         {

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:190:13
         {
           name: "get_survived_mutants",
           description:
-            "Liefert alle überlebenden Mutanten inkl. Dateipfad, Zeile, Mutator-Typ und Ersetzungscode.",
+            "",
           inputSchema: {
             type: "object",

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:193:25
             "Liefert alle überlebenden Mutanten inkl. Dateipfad, Zeile, Mutator-Typ und Ersetzungscode.",
           inputSchema: {
             type: "object",
-            properties: {
-              filePath: {
-                type: "string",
-                description:
-                  "Optionaler Dateipfad-Filter (z.B. 'src/calculator.ts').",
-              },
-            },
+            properties: {},
           },
         },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:197:19
               filePath: {
                 type: "string",
                 description:
-                  "Optionaler Dateipfad-Filter (z.B. 'src/calculator.ts').",
+                  "",
               },
             },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:203:17
           },
         },
         {
-          name: "get_killed_mutants",
+          name: "",
           description: "Liefert alle erfolgreich getöteten Mutanten.",
           inputSchema: {

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:220:24
           name: "get_mutant_context",
           description:
             "Liefert den Quellcode-Kontext für einen bestimmten Mutanten inkl. Original- und mutiertem Code.",
-          inputSchema: {
-            type: "object",
-            properties: {
-              mutantId: {
-                type: "string",
-                description: "Die ID des Mutanten (z.B. '42').",
-              },
-            },
-            required: ["mutantId"],
-          },
+          inputSchema: {},
         },
         {

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:225:30
             properties: {
               mutantId: {
                 type: "string",
-                description: "Die ID des Mutanten (z.B. '42').",
+                description: "",
               },
             },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:234:13
         {
           name: "configure_desktop_notifications",
           description:
-            "Konfiguriert die nativen Desktop-Benachrichtigungen (Aktivieren, Ton, Persistenter Status).",
+            "",
           inputSchema: {
             type: "object",

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:235:24
           name: "configure_desktop_notifications",
           description:
             "Konfiguriert die nativen Desktop-Benachrichtigungen (Aktivieren, Ton, Persistenter Status).",
-          inputSchema: {
-            type: "object",
-            properties: {
-              enabled: {
-                type: "boolean",
-                description: "Benachrichtigungen aktivieren oder deaktivieren.",
-              },
-              persistentOverlay: {
-                type: "boolean",
-                description:
-                  "Persistente Floating-Benachrichtigung aktivieren.",
-              },
-              sound: {
-                type: "boolean",
-                description: "Benachrichtigungston aktivieren.",
-              },
-            },
-          },
+          inputSchema: {},
         },
       ],

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:237:25
             "Konfiguriert die nativen Desktop-Benachrichtigungen (Aktivieren, Ton, Persistenter Status).",
           inputSchema: {
             type: "object",
-            properties: {
-              enabled: {
-                type: "boolean",
-                description: "Benachrichtigungen aktivieren oder deaktivieren.",
-              },
-              persistentOverlay: {
-                type: "boolean",
-                description:
-                  "Persistente Floating-Benachrichtigung aktivieren.",
-              },
-              sound: {
-                type: "boolean",
-                description: "Benachrichtigungston aktivieren.",
-              },
-            },
+            properties: {},
           },
         },

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:240:30
             properties: {
               enabled: {
                 type: "boolean",
-                description: "Benachrichtigungen aktivieren oder deaktivieren.",
+                description: "",
               },
               persistentOverlay: {

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:243:23
                 description: "Benachrichtigungen aktivieren oder deaktivieren.",
               },
               persistentOverlay: {
-                type: "boolean",
+                type: "",
                 description:
                   "Persistente Floating-Benachrichtigung aktivieren.",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:245:19
               persistentOverlay: {
                 type: "boolean",
                 description:
-                  "Persistente Floating-Benachrichtigung aktivieren.",
+                  "",
               },
               sound: {

[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:247:22
                 description:
                   "Persistente Floating-Benachrichtigung aktivieren.",
               },
-              sound: {
-                type: "boolean",
-                description: "Benachrichtigungston aktivieren.",
-              },
+              sound: {},
             },
           },

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-tool.controller.ts:273:22
         if (!runResult.isOk) {
           return {
             isError: true,
-            content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen von Mutationstests: ${runResult.error.message}`,
-              },
-            ],
+            content: [],
           };
         }
killedBy: McpToolController CallTool run_mutation_tests should return error if run fails
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:287:13
 
         return {
           content: [
-            {
-              type: "text",
-              text: `Mutationstests erfolgreich beendet.\nMutationsscore: ${summary?.mutationScore ?? "N/A"}%\nÜberlebte Mutanten: ${summary?.survived ?? "N/A"}\nKilled: ${summary?.killed ?? "N/A"}`,
-            },
+            {},
           ],
         };
killedBy: McpToolController CallTool run_mutation_tests should return summary if run succeeds
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:313:13
 
         let targetedResult;
 
-        if (commitSha) {
+        if (false) {
           targetedResult = await this.runTargetedUseCase.execute({ commitSha });
         } else if (fromRevision && toRevision) {
killedBy: McpToolController CallTool run_targeted_mutation_tests should return error if targeted run fails (with specific args)
statusReason: expected "vi.fn()" to be called with arguments: [ { commitSha: '123' } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:313:13
 
         let targetedResult;
 
-        if (commitSha) {
+        if (true) {
           targetedResult = await this.runTargetedUseCase.execute({ commitSha });
         } else if (fromRevision && toRevision) {
killedBy: McpToolController CallTool run_targeted_mutation_tests should return summary if targeted run succeeds (with baseBranch)
statusReason: expected "vi.fn()" to be called with arguments: [ { revision: 'main', …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:314:66
         let targetedResult;
 
         if (commitSha) {
-          targetedResult = await this.runTargetedUseCase.execute({ commitSha });
+          targetedResult = await this.runTargetedUseCase.execute({});
         } else if (fromRevision && toRevision) {
           targetedResult = await this.runTargetedUseCase.execute({
killedBy: McpToolController CallTool run_targeted_mutation_tests should return error if targeted run fails (with specific args)
statusReason: expected "vi.fn()" to be called with arguments: [ { commitSha: '123' } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:315:20
 
         if (commitSha) {
           targetedResult = await this.runTargetedUseCase.execute({ commitSha });
-        } else if (fromRevision && toRevision) {
+        } else if (true) {
           targetedResult = await this.runTargetedUseCase.execute({
             fromRevision,
killedBy: McpToolController CallTool run_targeted_mutation_tests should return summary if targeted run succeeds (with baseBranch)
statusReason: expected "vi.fn()" to be called with arguments: [ { revision: 'main', …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[NoCoverage] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:315:48
 
         if (commitSha) {
           targetedResult = await this.runTargetedUseCase.execute({ commitSha });
-        } else if (fromRevision && toRevision) {
-          targetedResult = await this.runTargetedUseCase.execute({
-            fromRevision,
-            toRevision,
-          });
-        } else {
+        } else if (fromRevision && toRevision) {} else {
           targetedResult = await this.runTargetedUseCase.execute({
             revision: rawArgs.revision || baseBranch,

[NoCoverage] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:316:66
         if (commitSha) {
           targetedResult = await this.runTargetedUseCase.execute({ commitSha });
         } else if (fromRevision && toRevision) {
-          targetedResult = await this.runTargetedUseCase.execute({
-            fromRevision,
-            toRevision,
-          });
+          targetedResult = await this.runTargetedUseCase.execute({});
         } else {
           targetedResult = await this.runTargetedUseCase.execute({

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:320:16
             fromRevision,
             toRevision,
           });
-        } else {
-          targetedResult = await this.runTargetedUseCase.execute({
-            revision: rawArgs.revision || baseBranch,
-            useLineRanges,
-          });
-        }
+        } else {}
 
         if (!targetedResult.isOk) {
killedBy: McpToolController CallTool run_targeted_mutation_tests should return summary if targeted run succeeds (with baseBranch)
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:321:66
             toRevision,
           });
         } else {
-          targetedResult = await this.runTargetedUseCase.execute({
-            revision: rawArgs.revision || baseBranch,
-            useLineRanges,
-          });
+          targetedResult = await this.runTargetedUseCase.execute({});
         }
 
killedBy: McpToolController CallTool run_targeted_mutation_tests should return summary if targeted run succeeds (with baseBranch)
statusReason: expected "vi.fn()" to be called with arguments: [ { revision: 'main', …(1) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:322:23
           });
         } else {
           targetedResult = await this.runTargetedUseCase.execute({
-            revision: rawArgs.revision || baseBranch,
+            revision: false,
             useLineRanges,
           });
killedBy: McpToolController CallTool run_targeted_mutation_tests should return summary if targeted run succeeds (with baseBranch)
statusReason: expected "vi.fn()" to be called with arguments: [ { revision: 'main', …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] LogicalOperator
src/infrastructure/mcp/mcp-tool.controller.ts:322:23
           });
         } else {
           targetedResult = await this.runTargetedUseCase.execute({
-            revision: rawArgs.revision || baseBranch,
+            revision: rawArgs.revision && baseBranch,
             useLineRanges,
           });
killedBy: McpToolController CallTool run_targeted_mutation_tests should return summary if targeted run succeeds (with baseBranch)
statusReason: expected "vi.fn()" to be called with arguments: [ { revision: 'main', …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:327:35
           });
         }
 
-        if (!targetedResult.isOk) {
-          return {
-            isError: true,
-            content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen zielgerichteter Mutationstests: ${targetedResult.error.message}`,
-              },
-            ],
-          };
-        }
+        if (!targetedResult.isOk) {}
 
         const summaryResult = this.getSummaryUseCase.execute();
killedBy: McpToolController CallTool run_targeted_mutation_tests should return error if targeted run fails (with specific args)
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:327:13
           });
         }
 
-        if (!targetedResult.isOk) {
+        if (targetedResult.isOk) {
           return {
             isError: true,
killedBy: McpToolController CallTool run_targeted_mutation_tests should return error if targeted run fails (with specific args)
statusReason: Cannot read properties of undefined (reading 'isOk')
