[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-tool.controller.ts:330:22
         if (!targetedResult.isOk) {
           return {
             isError: true,
-            content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen zielgerichteter Mutationstests: ${targetedResult.error.message}`,
-              },
-            ],
+            content: [],
           };
         }
killedBy: McpToolController CallTool run_targeted_mutation_tests should return error if targeted run fails (with specific args)
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:331:15
           return {
             isError: true,
             content: [
-              {
-                type: "text",
-                text: `Fehler beim Ausführen zielgerichteter Mutationstests: ${targetedResult.error.message}`,
-              },
+              {},
             ],
           };
killedBy: McpToolController CallTool run_targeted_mutation_tests should return error if targeted run fails (with specific args)
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-tool.controller.ts:352:11
         };
       }
 
-      if (name === "suggest_mutant_fixes") {
+      if (name !== "suggest_mutant_fixes") {
         const filterPath = parseFilePath(args);
         const profile = (args as any)?.profile as "local" | "cloud" | "regex" | undefined;
killedBy: McpToolController CallTool suggest_mutant_fixes should suggest fixes for valid survived mutants
statusReason: Unbekanntes Tool: suggest_mutant_fixes

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:352:44
         };
       }
 
-      if (name === "suggest_mutant_fixes") {
-        const filterPath = parseFilePath(args);
-        const profile = (args as any)?.profile as "local" | "cloud" | "regex" | undefined;
-        const survivedResult = await this.getSurvivedUseCase.execute(filterPath);
-        const survivedMutants = survivedResult.isOk ? survivedResult.value : [];
-        const advice = await this.suggestFixesUseCase.execute(survivedMutants, profile);
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(advice, null, 2),
-            },
-          ],
-        };
-      }
+      if (name === "suggest_mutant_fixes") {}
 
       if (name === "predict_mutation_impact") {
killedBy: McpToolController CallTool suggest_mutant_fixes should suggest fixes for valid survived mutants
statusReason: Unbekanntes Tool: suggest_mutant_fixes

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:369:11
         };
       }
 
-      if (name === "predict_mutation_impact") {
+      if (true) {
         const changedFiles =
           (args as { changedFiles?: string[] })?.changedFiles || [];
killedBy: McpToolController CallTool get_mutation_score should return score on ok
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:369:47
         };
       }
 
-      if (name === "predict_mutation_impact") {
-        const changedFiles =
-          (args as { changedFiles?: string[] })?.changedFiles || [];
-        const riskAnalysis = this.predictImpactUseCase.execute(changedFiles);
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(riskAnalysis, null, 2),
-            },
-          ],
-        };
-      }
+      if (name === "predict_mutation_impact") {}
 
       if (name === "generate_testing_cheat_sheet") {
killedBy: McpToolController CallTool predict_mutation_impact should predict impact
statusReason: Unbekanntes Tool: predict_mutation_impact

[Killed] OptionalChaining
src/infrastructure/mcp/mcp-tool.controller.ts:371:11
 
       if (name === "predict_mutation_impact") {
         const changedFiles =
-          (args as { changedFiles?: string[] })?.changedFiles || [];
+          (args as {
+  changedFiles?: string[];
+}).changedFiles || [];
         const riskAnalysis = this.predictImpactUseCase.execute(changedFiles);
 
killedBy: McpToolController CallTool predict_mutation_impact should handle missing args gracefully
statusReason: Cannot read properties of undefined (reading 'changedFiles')

[Killed] LogicalOperator
src/infrastructure/mcp/mcp-tool.controller.ts:371:11
 
       if (name === "predict_mutation_impact") {
         const changedFiles =
-          (args as { changedFiles?: string[] })?.changedFiles || [];
+          (args as {
+  changedFiles?: string[];
+})?.changedFiles && [];
         const riskAnalysis = this.predictImpactUseCase.execute(changedFiles);
 
killedBy: McpToolController CallTool predict_mutation_impact should handle missing args gracefully
statusReason: expected "vi.fn()" to be called with arguments: [ [] ]

Received:

  1st vi.fn() call:

  [
-   [],

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-tool.controller.ts:375:20
         const riskAnalysis = this.predictImpactUseCase.execute(changedFiles);
 
         return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(riskAnalysis, null, 2),
-            },
-          ],
+          content: [],
         };
       }
killedBy: McpToolController CallTool predict_mutation_impact should predict impact
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:384:52
         };
       }
 
-      if (name === "generate_testing_cheat_sheet") {
-        const filterPath = parseFilePath(args);
-        const survivedResult = await this.getSurvivedUseCase.execute(filterPath);
-        const survivedMutants = survivedResult.isOk ? survivedResult.value : [];
-        const cheatSheet = this.generateCheatSheetUseCase.execute(survivedMutants);
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: cheatSheet,
-            },
-          ],
-        };
-      }
+      if (name === "generate_testing_cheat_sheet") {}
 
       if (name === "detect_equivalent_mutants") {
killedBy: McpToolController CallTool generate_testing_cheat_sheet should return generated cheat sheet
statusReason: Unbekanntes Tool: generate_testing_cheat_sheet

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:384:11
         };
       }
 
-      if (name === "generate_testing_cheat_sheet") {
+      if (true) {
         const filterPath = parseFilePath(args);
         const survivedResult = await this.getSurvivedUseCase.execute(filterPath);
killedBy: McpToolController CallTool get_mutation_score should return score on ok
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:390:16
         const survivedMutants = survivedResult.isOk ? survivedResult.value : [];
         const cheatSheet = this.generateCheatSheetUseCase.execute(survivedMutants);
 
-        return {
-          content: [
-            {
-              type: "text",
-              text: cheatSheet,
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpToolController CallTool generate_testing_cheat_sheet should return generated cheat sheet
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:400:11
         };
       }
 
-      if (name === "detect_equivalent_mutants") {
+      if (false) {
         const filterPath = parseFilePath(args);
         const survivedResult = await this.getSurvivedUseCase.execute(filterPath);
killedBy: McpToolController CallTool detect_equivalent_mutants should return detected equivalent mutants
statusReason: Unbekanntes Tool: detect_equivalent_mutants

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-tool.controller.ts:400:11
         };
       }
 
-      if (name === "detect_equivalent_mutants") {
+      if (name !== "detect_equivalent_mutants") {
         const filterPath = parseFilePath(args);
         const survivedResult = await this.getSurvivedUseCase.execute(filterPath);
killedBy: McpToolController CallTool get_mutation_score should return score on ok
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:406:16
         const survivedMutants = survivedResult.isOk ? survivedResult.value : [];
         const detected = this.detectEquivalentUseCase.execute(survivedMutants);
         
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(detected, null, 2),
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpToolController CallTool detect_equivalent_mutants should return detected equivalent mutants
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:408:13
         
         return {
           content: [
-            {
-              type: "text",
-              text: JSON.stringify(detected, null, 2),
-            },
+            {},
           ],
         };
killedBy: McpToolController CallTool detect_equivalent_mutants should return detected equivalent mutants
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:416:42
         };
       }
 
-      if (name === "get_mutation_score") {
-        const summaryResult = this.getSummaryUseCase.execute();
-        if (!summaryResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: summaryResult.error.message }],
-          };
-        }
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(summaryResult.value, null, 2),
-            },
-          ],
-        };
-      }
+      if (name === "get_mutation_score") {}
 
       if (name === "get_survived_mutants") {
killedBy: McpToolController CallTool get_mutation_score should return score on ok
statusReason: Unbekanntes Tool: get_mutation_score

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-tool.controller.ts:421:22
         if (!summaryResult.isOk) {
           return {
             isError: true,
-            content: [{ type: "text", text: summaryResult.error.message }],
+            content: [],
           };
         }
killedBy: McpToolController CallTool get_mutation_score should return error on fail
statusReason: Cannot read properties of undefined (reading 'text')

[Survived] StringLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:421:31
         if (!summaryResult.isOk) {
           return {
             isError: true,
-            content: [{ type: "text", text: summaryResult.error.message }],
+            content: [{ type: "", text: summaryResult.error.message }],
           };
         }

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:425:16
           };
         }
 
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(summaryResult.value, null, 2),
-            },
-          ],
-        };
+        return {};
       }
 
killedBy: McpToolController CallTool get_mutation_score should return score on ok
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-tool.controller.ts:426:20
         }
 
         return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(summaryResult.value, null, 2),
-            },
-          ],
+          content: [],
         };
       }
killedBy: McpToolController CallTool get_mutation_score should return score on ok
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:435:44
         };
       }
 
-      if (name === "get_survived_mutants") {
-        const filterPath = parseFilePath(args);
-        const survivedResult = await this.getSurvivedUseCase.execute(filterPath);
-        if (!survivedResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: survivedResult.error.message }],
-          };
-        }
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(survivedResult.value, null, 2),
-            },
-          ],
-        };
-      }
+      if (name === "get_survived_mutants") {}
 
       if (name === "get_killed_mutants") {
killedBy: McpToolController CallTool get_survived_mutants should return mutants on ok
statusReason: Unbekanntes Tool: get_survived_mutants

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:438:13
       if (name === "get_survived_mutants") {
         const filterPath = parseFilePath(args);
         const survivedResult = await this.getSurvivedUseCase.execute(filterPath);
-        if (!survivedResult.isOk) {
+        if (true) {
           return {
             isError: true,
killedBy: McpToolController CallTool get_survived_mutants should return mutants on ok
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:438:35
       if (name === "get_survived_mutants") {
         const filterPath = parseFilePath(args);
         const survivedResult = await this.getSurvivedUseCase.execute(filterPath);
-        if (!survivedResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: survivedResult.error.message }],
-          };
-        }
+        if (!survivedResult.isOk) {}
 
         return {
killedBy: McpToolController CallTool get_survived_mutants should return error on fail
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:455:42
         };
       }
 
-      if (name === "get_killed_mutants") {
-        const filterPath = parseFilePath(args);
-        const killedResult = this.getKilledUseCase.execute(filterPath);
-        if (!killedResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: killedResult.error.message }],
-          };
-        }
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(killedResult.value, null, 2),
-            },
-          ],
-        };
-      }
+      if (name === "get_killed_mutants") {}
 
       if (name === "get_mutant_context") {
killedBy: McpToolController CallTool get_killed_mutants should return mutants on ok
statusReason: Unbekanntes Tool: get_killed_mutants

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-tool.controller.ts:455:11
         };
       }
 
-      if (name === "get_killed_mutants") {
+      if (name !== "get_killed_mutants") {
         const filterPath = parseFilePath(args);
         const killedResult = this.getKilledUseCase.execute(filterPath);
killedBy: McpToolController CallTool get_killed_mutants should return mutants on ok
statusReason: Unbekanntes Tool: get_killed_mutants

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:458:33
       if (name === "get_killed_mutants") {
         const filterPath = parseFilePath(args);
         const killedResult = this.getKilledUseCase.execute(filterPath);
-        if (!killedResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: killedResult.error.message }],
-          };
-        }
+        if (!killedResult.isOk) {}
 
         return {
killedBy: McpToolController CallTool get_killed_mutants should return error on fail
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:458:13
       if (name === "get_killed_mutants") {
         const filterPath = parseFilePath(args);
         const killedResult = this.getKilledUseCase.execute(filterPath);
-        if (!killedResult.isOk) {
+        if (killedResult.isOk) {
           return {
             isError: true,
killedBy: McpToolController CallTool get_killed_mutants should return mutants on ok
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:459:18
         const filterPath = parseFilePath(args);
         const killedResult = this.getKilledUseCase.execute(filterPath);
         if (!killedResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: killedResult.error.message }],
-          };
+          return {};
         }
 
killedBy: McpToolController CallTool get_killed_mutants should return error on fail
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-tool.controller.ts:466:20
         }
 
         return {
-          content: [
-            {
-              type: "text",
-              text: JSON.stringify(killedResult.value, null, 2),
-            },
-          ],
+          content: [],
         };
       }
killedBy: McpToolController CallTool get_killed_mutants should return mutants on ok
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:475:11
         };
       }
 
-      if (name === "get_mutant_context") {
+      if (false) {
         const mutantId = (args as { mutantId?: string })?.mutantId;
         if (!mutantId) {
killedBy: McpToolController CallTool get_mutant_context should return error if no mutantId
statusReason: Unbekanntes Tool: get_mutant_context

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-tool.controller.ts:475:11
         };
       }
 
-      if (name === "get_mutant_context") {
+      if (name !== "get_mutant_context") {
         const mutantId = (args as { mutantId?: string })?.mutantId;
         if (!mutantId) {
killedBy: McpToolController CallTool get_mutant_context should return error if no mutantId
statusReason: Unbekanntes Tool: get_mutant_context

[Survived] OptionalChaining
src/infrastructure/mcp/mcp-tool.controller.ts:476:26
       }
 
       if (name === "get_mutant_context") {
-        const mutantId = (args as { mutantId?: string })?.mutantId;
+        const mutantId = (args as {
+  mutantId?: string;
+}).mutantId;
         if (!mutantId) {
           return {

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:477:13
 
       if (name === "get_mutant_context") {
         const mutantId = (args as { mutantId?: string })?.mutantId;
-        if (!mutantId) {
+        if (true) {
           return {
             isError: true,
killedBy: McpToolController CallTool get_mutant_context should return context on ok
statusReason: expected 'mutantId ist erforderlich.' to contain 'abc'

[Killed] BooleanLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:477:13
 
       if (name === "get_mutant_context") {
         const mutantId = (args as { mutantId?: string })?.mutantId;
-        if (!mutantId) {
+        if (mutantId) {
           return {
             isError: true,
killedBy: McpToolController CallTool get_mutant_context should return error if no mutantId
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:485:34
         }
 
         const contextResult = this.getMutantContextUseCase.execute(mutantId);
-        if (!contextResult.isOk) {
-          return {
-            isError: true,
-            content: [{ type: "text", text: contextResult.error.message }],
-          };
-        }
+        if (!contextResult.isOk) {}
 
         return {
killedBy: McpToolController CallTool get_mutant_context should return error on fail
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-tool.controller.ts:485:13
         }
 
         const contextResult = this.getMutantContextUseCase.execute(mutantId);
-        if (!contextResult.isOk) {
+        if (true) {
           return {
             isError: true,
killedBy: McpToolController CallTool get_mutant_context should return context on ok
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-tool.controller.ts:488:23
         if (!contextResult.isOk) {
           return {
             isError: true,
-            content: [{ type: "text", text: contextResult.error.message }],
+            content: [{}],
           };
         }
killedBy: McpToolController CallTool get_mutant_context should return error on fail
statusReason: expected undefined to be 'ctx fail' // Object.is equality

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-tool.controller.ts:488:22
         if (!contextResult.isOk) {
           return {
             isError: true,
-            content: [{ type: "text", text: contextResult.error.message }],
+            content: [],
           };
         }
killedBy: McpToolController CallTool get_mutant_context should return error on fail
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-tool.controller.ts:502:55
         };
       }
 
-      if (name === "configure_desktop_notifications") {
-        const options = args as {
-          enabled?: boolean;
-          persistentOverlay?: boolean;
-          sound?: boolean;
-        };
-        this.notificationService.configure(options);
-
-        return {
-          content: [
-            {
-              type: "text",
-              text: `Desktop Benachrichtigungseinstellungen aktualisiert: ${JSON.stringify(options)}`,
-            },
-          ],
-        };
-      }
+      if (name === "configure_desktop_notifications") {}
 
       throw new Error(`Unbekanntes Tool: ${name}`);
killedBy: McpToolController CallTool configure_desktop_notifications should configure and return ok
statusReason: Unbekanntes Tool: configure_desktop_notifications

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-tool.controller.ts:511:20
         this.notificationService.configure(options);
 
         return {
-          content: [
-            {
-              type: "text",
-              text: `Desktop Benachrichtigungseinstellungen aktualisiert: ${JSON.stringify(options)}`,
-            },
-          ],
+          content: [],
         };
       }
killedBy: McpToolController CallTool configure_desktop_notifications should configure and return ok
statusReason: Cannot read properties of undefined (reading 'text')
