[Killed] StringLiteral
src/infrastructure/stryker/mcp-reporter.ts:19:19
   public async onMutationTestReportReady(
     report: MutationTestResult,
   ): Promise<void> {
-    this.log.info("Mutation Testing abgeschlossen. Bereite MCP-Server vor...");
+    this.log.info("");
 
     // 1. Report über die Domain-Grenze validieren und mappen
killedBy: McpReporter sollte den Report verarbeiten und beenden, wenn MCP_DAEMON inaktiv ist
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Mutation Testing abgeschlossen. Bereite MCP-Server vor...",

[Killed] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:23:9
 
     // 1. Report über die Domain-Grenze validieren und mappen
     const useCaseResult = this.publishUseCase.execute(report);
-    if (!useCaseResult.isOk) {
+    if (false) {
       this.log.error(
         `Fehler beim Verarbeiten des Reports: ${useCaseResult.error.message}`,
killedBy: McpReporter sollte Fehler aus dem Use Case loggen und abbrechen
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Survived] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:30:9
       return;
     }
 
-    if (this.db) {
+    if (true) {
       try {
         let commitMessage = "Unknown Commit";

[Survived] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:30:9
       return;
     }
 
-    if (this.db) {
+    if (false) {
       try {
         let commitMessage = "Unknown Commit";

[NoCoverage] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:33:13
     if (this.db) {
       try {
         let commitMessage = "Unknown Commit";
-        try {
-          const { execSync } = await import("child_process");
-          commitMessage = execSync("git log -1 --pretty=%B", { encoding: "utf-8" }).trim();
-        } catch (e) {
+        try {} catch (e) {
           // ignore
         }

[NoCoverage] MethodExpression
src/infrastructure/stryker/mcp-reporter.ts:35:27
         let commitMessage = "Unknown Commit";
         try {
           const { execSync } = await import("child_process");
-          commitMessage = execSync("git log -1 --pretty=%B", { encoding: "utf-8" }).trim();
+          commitMessage = execSync("git log -1 --pretty=%B", {
+  encoding: "utf-8"
+});
         } catch (e) {
           // ignore

[NoCoverage] ObjectLiteral
src/infrastructure/stryker/mcp-reporter.ts:35:62
         let commitMessage = "Unknown Commit";
         try {
           const { execSync } = await import("child_process");
-          commitMessage = execSync("git log -1 --pretty=%B", { encoding: "utf-8" }).trim();
+          commitMessage = execSync("git log -1 --pretty=%B", {}).trim();
         } catch (e) {
           // ignore

[NoCoverage] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:41:13
         }
         
         let author = "Unknown Author";
-        try {
-          const { execSync } = await import("child_process");
-          author = execSync("git log -1 --pretty=%an", { encoding: "utf-8" }).trim();
-        } catch(e) {
+        try {} catch(e) {
           // ignore
         }

[NoCoverage] MethodExpression
src/infrastructure/stryker/mcp-reporter.ts:43:20
         let author = "Unknown Author";
         try {
           const { execSync } = await import("child_process");
-          author = execSync("git log -1 --pretty=%an", { encoding: "utf-8" }).trim();
+          author = execSync("git log -1 --pretty=%an", {
+  encoding: "utf-8"
+});
         } catch(e) {
           // ignore

[NoCoverage] ObjectLiteral
src/infrastructure/stryker/mcp-reporter.ts:49:25
         }
 
         const runId = `run-${Date.now()}`;
-        const summary = {
-          mutationScore: report.thresholds.high, // We could calculate this from the thresholds or use a dummy
-          killed: 0,
-          survived: 0,
-          total: 0
-        };
+        const summary = {};
         
         const mutantsToSave: any[] = [];

[NoCoverage] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:58:13
         
         const mutantsToSave: any[] = [];
         
-        if (report.files) {
+        if (false) {
           for (const [filePath, fileObj] of Object.entries(report.files)) {
             if (fileObj.mutants) {

[NoCoverage] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:58:13
         
         const mutantsToSave: any[] = [];
         
-        if (report.files) {
+        if (true) {
           for (const [filePath, fileObj] of Object.entries(report.files)) {
             if (fileObj.mutants) {

[NoCoverage] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:59:75
         const mutantsToSave: any[] = [];
         
         if (report.files) {
-          for (const [filePath, fileObj] of Object.entries(report.files)) {
-            if (fileObj.mutants) {
-              for (const m of fileObj.mutants) {
-                summary.total++;
-                if (m.status === "Killed") summary.killed++;
-                if (m.status === "Survived") summary.survived++;
-                
-                mutantsToSave.push({
-                  id: m.id,
-                  filePath: filePath,
-                  mutatorName: m.mutatorName,
-                  status: m.status,
-                  blameAuthor: author
-                });
-              }
-            }
-          }
+          for (const [filePath, fileObj] of Object.entries(report.files)) {}
         }
         

[NoCoverage] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:60:34
         
         if (report.files) {
           for (const [filePath, fileObj] of Object.entries(report.files)) {
-            if (fileObj.mutants) {
-              for (const m of fileObj.mutants) {
-                summary.total++;
-                if (m.status === "Killed") summary.killed++;
-                if (m.status === "Survived") summary.survived++;
-                
-                mutantsToSave.push({
-                  id: m.id,
-                  filePath: filePath,
-                  mutatorName: m.mutatorName,
-                  status: m.status,
-                  blameAuthor: author
-                });
-              }
-            }
+            if (fileObj.mutants) {}
           }
         }

[NoCoverage] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:60:17
         
         if (report.files) {
           for (const [filePath, fileObj] of Object.entries(report.files)) {
-            if (fileObj.mutants) {
+            if (true) {
               for (const m of fileObj.mutants) {
                 summary.total++;

[NoCoverage] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:61:48
         if (report.files) {
           for (const [filePath, fileObj] of Object.entries(report.files)) {
             if (fileObj.mutants) {
-              for (const m of fileObj.mutants) {
-                summary.total++;
-                if (m.status === "Killed") summary.killed++;
-                if (m.status === "Survived") summary.survived++;
-                
-                mutantsToSave.push({
-                  id: m.id,
-                  filePath: filePath,
-                  mutatorName: m.mutatorName,
-                  status: m.status,
-                  blameAuthor: author
-                });
-              }
+              for (const m of fileObj.mutants) {}
             }
           }

[NoCoverage] UpdateOperator
src/infrastructure/stryker/mcp-reporter.ts:62:17
           for (const [filePath, fileObj] of Object.entries(report.files)) {
             if (fileObj.mutants) {
               for (const m of fileObj.mutants) {
-                summary.total++;
+                summary.total--;
                 if (m.status === "Killed") summary.killed++;
                 if (m.status === "Survived") summary.survived++;

[NoCoverage] UpdateOperator
src/infrastructure/stryker/mcp-reporter.ts:63:44
             if (fileObj.mutants) {
               for (const m of fileObj.mutants) {
                 summary.total++;
-                if (m.status === "Killed") summary.killed++;
+                if (m.status === "Killed") summary.killed--;
                 if (m.status === "Survived") summary.survived++;
                 

[NoCoverage] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:63:21
             if (fileObj.mutants) {
               for (const m of fileObj.mutants) {
                 summary.total++;
-                if (m.status === "Killed") summary.killed++;
+                if (true) summary.killed++;
                 if (m.status === "Survived") summary.survived++;
                 

[NoCoverage] UpdateOperator
src/infrastructure/stryker/mcp-reporter.ts:64:46
               for (const m of fileObj.mutants) {
                 summary.total++;
                 if (m.status === "Killed") summary.killed++;
-                if (m.status === "Survived") summary.survived++;
+                if (m.status === "Survived") summary.survived--;
                 
                 mutantsToSave.push({

[NoCoverage] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:64:21
               for (const m of fileObj.mutants) {
                 summary.total++;
                 if (m.status === "Killed") summary.killed++;
-                if (m.status === "Survived") summary.survived++;
+                if (true) summary.survived++;
                 
                 mutantsToSave.push({

[NoCoverage] EqualityOperator
src/infrastructure/stryker/mcp-reporter.ts:78:13
           }
         }
         
-        if (summary.total > 0) {
+        if (summary.total >= 0) {
           summary.mutationScore = (summary.killed / summary.total) * 100;
         } else {

[NoCoverage] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:78:13
           }
         }
         
-        if (summary.total > 0) {
+        if (true) {
           summary.mutationScore = (summary.killed / summary.total) * 100;
         } else {

[NoCoverage] ArithmeticOperator
src/infrastructure/stryker/mcp-reporter.ts:79:36
         }
         
         if (summary.total > 0) {
-          summary.mutationScore = (summary.killed / summary.total) * 100;
+          summary.mutationScore = (summary.killed * summary.total) * 100;
         } else {
           summary.mutationScore = 0;

[NoCoverage] ArithmeticOperator
src/infrastructure/stryker/mcp-reporter.ts:79:35
         }
         
         if (summary.total > 0) {
-          summary.mutationScore = (summary.killed / summary.total) * 100;
+          summary.mutationScore = summary.killed / summary.total / 100;
         } else {
           summary.mutationScore = 0;

[NoCoverage] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:80:16
         
         if (summary.total > 0) {
           summary.mutationScore = (summary.killed / summary.total) * 100;
-        } else {
-          summary.mutationScore = 0;
-        }
+        } else {}
 
         this.db.saveRun(runId, summary, mutantsToSave);

[NoCoverage] StringLiteral
src/infrastructure/stryker/mcp-reporter.ts:85:23
         }
 
         this.db.saveRun(runId, summary, mutantsToSave);
-        this.log.info(`Speichere Mutation-Run ${runId} in der Datenbank mit ${mutantsToSave.length} Mutanten.`);
+        this.log.info(``);
       } catch (e) {
         this.log.error(`Fehler beim Speichern in der Datenbank: ${e}`);

[NoCoverage] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:86:19
 
         this.db.saveRun(runId, summary, mutantsToSave);
         this.log.info(`Speichere Mutation-Run ${runId} in der Datenbank mit ${mutantsToSave.length} Mutanten.`);
-      } catch (e) {
-        this.log.error(`Fehler beim Speichern in der Datenbank: ${e}`);
-      }
+      } catch (e) {}
     }
 

[Killed] EqualityOperator
src/infrastructure/stryker/mcp-reporter.ts:92:9
     }
 
     // 3. Den Stryker-Lifecycle nur blockieren und Server starten, wenn Daemon-Modus aktiv ist
-    if (process.env.MCP_DAEMON === "true") {
+    if (process.env.MCP_DAEMON !== "true") {
       // 2. Outbound-Adapter (Express/MCP) starten
       const serverResult = await this.serverAdapter.start();
killedBy: McpReporter sollte den Report verarbeiten und beenden, wenn MCP_DAEMON inaktiv ist
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/infrastructure/stryker/mcp-reporter.ts:92:9
     }
 
     // 3. Den Stryker-Lifecycle nur blockieren und Server starten, wenn Daemon-Modus aktiv ist
-    if (process.env.MCP_DAEMON === "true") {
+    if (true) {
       // 2. Outbound-Adapter (Express/MCP) starten
       const serverResult = await this.serverAdapter.start();
killedBy: McpReporter sollte den Report verarbeiten und beenden, wenn MCP_DAEMON inaktiv ist
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/stryker/mcp-reporter.ts:95:31
     if (process.env.MCP_DAEMON === "true") {
       // 2. Outbound-Adapter (Express/MCP) starten
       const serverResult = await this.serverAdapter.start();
-      if (!serverResult.isOk) {
-        this.log.error(
-          `MCP-Server konnte nicht gestartet werden: ${serverResult.error.message}`,
-        );
-        return;
-      }
+      if (!serverResult.isOk) {}
 
       this.log.info(
killedBy: McpReporter sollte Fehler beim Server-Start loggen und abbrechen (NoCoverage behoben)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
src/infrastructure/stryker/mcp-reporter.ts:103:9
       }
 
       this.log.info(
-        "🚀 MCP Server läuft auf Port 3000! Warte auf KI-Verbindungen (Beenden mit Strg+C).",
+        ""
       );
 
