[Killed] EqualityOperator
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:37:28
       reporters: [],
     };
 
-    if (options?.mutate && options.mutate.length > 0) {
+    if (options?.mutate && options.mutate.length >= 0) {
       strykerConfig.mutate = options.mutate;
     }
killedBy: StrykerCliRunnerAdapter ignoriert concurrency=0 oder leere Optionseigenschaften
statusReason: expected "vi.fn()" to be called with arguments: [ { logLevel: 'off', …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] EqualityOperator
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:40:53
     if (options?.mutate && options.mutate.length > 0) {
       strykerConfig.mutate = options.mutate;
     }
-    if (typeof options?.concurrency === "number" && options.concurrency > 0) {
+    if (typeof options?.concurrency === "number" && options.concurrency <= 0) {
       strykerConfig.concurrency = options.concurrency;
     }
killedBy: StrykerCliRunnerAdapter reicht alle Optionen (concurrency, reporters, testRunner, configFile) an Stryker weiter
statusReason: expected "vi.fn()" to be called with arguments: [ { mutate: [ 'src/app.ts' ], …(5) } ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,7 @@
  [

[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:43:9
     if (typeof options?.concurrency === "number" && options.concurrency > 0) {
       strykerConfig.concurrency = options.concurrency;
     }
-    if (options?.reporters && options.reporters.length > 0) {
+    if (true) {
       strykerConfig.reporters = options.reporters;
     }
killedBy: StrykerCliRunnerAdapter nutzt den dynamischen Import von @stryker-mutator/core wenn keine Factory übergeben wird
statusReason: Cannot read properties of undefined (reading 'reporters')

[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:46:9
     if (options?.reporters && options.reporters.length > 0) {
       strykerConfig.reporters = options.reporters;
     }
-    if (options?.testRunner) {
+    if (true) {
       strykerConfig.testRunner = options.testRunner;
     }
killedBy: StrykerCliRunnerAdapter nutzt den dynamischen Import von @stryker-mutator/core wenn keine Factory übergeben wird
statusReason: Cannot read properties of undefined (reading 'testRunner')

[Killed] ConditionalExpression
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:46:9
     if (options?.reporters && options.reporters.length > 0) {
       strykerConfig.reporters = options.reporters;
     }
-    if (options?.testRunner) {
+    if (false) {
       strykerConfig.testRunner = options.testRunner;
     }
killedBy: StrykerCliRunnerAdapter reicht alle Optionen (concurrency, reporters, testRunner, configFile) an Stryker weiter
statusReason: expected "vi.fn()" to be called with arguments: [ { mutate: [ 'src/app.ts' ], …(5) } ]

Received:

  1st vi.fn() call:

@@ -7,8 +7,7 @@
        "src/app.ts",

[Killed] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:49:30
     if (options?.testRunner) {
       strykerConfig.testRunner = options.testRunner;
     }
-    if (options?.configFile) {
-      strykerConfig.configFile = options.configFile;
-    }
+    if (options?.configFile) {}
 
     try {
killedBy: StrykerCliRunnerAdapter reicht alle Optionen (concurrency, reporters, testRunner, configFile) an Stryker weiter
statusReason: expected "vi.fn()" to be called with arguments: [ { mutate: [ 'src/app.ts' ], …(5) } ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,8 @@
  [

[Survived] ObjectLiteral
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:74:36
       const fs = await import("fs");
       const path = await import("path");
 
-      let report: MutationReport = { files: {} };
+      let report: MutationReport = {};
       try {
         const reportPath = path.resolve(

[Killed] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:75:11
       const path = await import("path");
 
       let report: MutationReport = { files: {} };
-      try {
-        const reportPath = path.resolve(
-          process.cwd(),
-          "reports",
-          "mutation",
-          "mutation.json",
-        );
-        const fileContent = await fs.promises.readFile(reportPath, "utf-8");
-        report = JSON.parse(fileContent);
-      } catch (err) {
+      try {} catch (err) {
         this.logger.warn("Konnte mutation.json nicht lesen.");
       }
killedBy: StrykerCliRunnerAdapter führt Stryker programmatisch aus und gibt das ok-Result mit dem Report zurück
statusReason: expected {} to have property "src/app.ts"

[NoCoverage] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:84:21
         );
         const fileContent = await fs.promises.readFile(reportPath, "utf-8");
         report = JSON.parse(fileContent);
-      } catch (err) {
-        this.logger.warn("Konnte mutation.json nicht lesen.");
-      }
+      } catch (err) {}
 
       return ok(report);

[Killed] BlockStatement
src/infrastructure/stryker/stryker-cli-runner.adapter.ts:89:21
       }
 
       return ok(report);
-    } catch (error) {
-      const errObj = error instanceof Error ? error : new Error(String(error));
-      this.logger.error(
-        "Fehler bei der Ausführung von Stryker Mutationstests:",
-        errObj,
-      );
-      return err(errObj);
-    }
+    } catch (error) {}
   }
 }
killedBy: StrykerCliRunnerAdapter fängt Fehler bei der Stryker-Ausführung ab und gibt ein err-Result zurück
statusReason: Cannot read properties of undefined (reading 'isOk')
