[Killed] MethodExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:5:29
 
 export class GenerateTestingCheatSheetUseCase {
   public execute(mutants: MutantDetail[]): string {
-    const survivedMutants = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
-    );
+    const survivedMutants = mutants;
 
     if (survivedMutants.length === 0) {
killedBy: GenerateTestingCheatSheetUseCase should ignore killed mutants
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Great job!'

[Killed] EqualityOperator
src/core/application/generate-testing-cheat-sheet.use-case.ts:6:41
 export class GenerateTestingCheatSheetUseCase {
   public execute(mutants: MutantDetail[]): string {
     const survivedMutants = mutants.filter(
-      (m) => m.status === "Survived" || m.status === "NoCoverage",
+      (m) => m.status === "Survived" || m.status !== "NoCoverage",
     );
 
killedBy: GenerateTestingCheatSheetUseCase should ignore killed mutants
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Great job!'

[Killed] EqualityOperator
src/core/application/generate-testing-cheat-sheet.use-case.ts:9:9
       (m) => m.status === "Survived" || m.status === "NoCoverage",
     );
 
-    if (survivedMutants.length === 0) {
+    if (survivedMutants.length !== 0) {
       return "# Mutation Testing Cheat Sheet\n\nGreat job! No survived mutants to generate anti-patterns for.";
     }
killedBy: GenerateTestingCheatSheetUseCase should return a positive message when there are no survived mutants
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Great job!'

[Killed] ConditionalExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:9:9
       (m) => m.status === "Survived" || m.status === "NoCoverage",
     );
 
-    if (survivedMutants.length === 0) {
+    if (true) {
       return "# Mutation Testing Cheat Sheet\n\nGreat job! No survived mutants to generate anti-patterns for.";
     }
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nGre…' to contain '## EqualityOperator (Survived 1 times)'

[Killed] StringLiteral
src/core/application/generate-testing-cheat-sheet.use-case.ts:10:14
     );
 
     if (survivedMutants.length === 0) {
-      return "# Mutation Testing Cheat Sheet\n\nGreat job! No survived mutants to generate anti-patterns for.";
+      return "";
     }
 
killedBy: GenerateTestingCheatSheetUseCase should return a positive message when there are no survived mutants
statusReason: expected '' to contain 'Great job!'

[Killed] BlockStatement
src/core/application/generate-testing-cheat-sheet.use-case.ts:14:24
     }
 
     const groupedByMutator = survivedMutants.reduce(
-      (acc, mutant) => {
-        const mutatorName = mutant.mutatorName || "UnknownMutator";
-        if (!acc[mutatorName]) {
-          acc[mutatorName] = [];
-        }
-        acc[mutatorName].push(mutant);
-        return acc;
-      },
+      (acc, mutant) => {},
       {} as Record<string, MutantDetail[]>,
     );
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:15:29
 
     const groupedByMutator = survivedMutants.reduce(
       (acc, mutant) => {
-        const mutatorName = mutant.mutatorName || "UnknownMutator";
+        const mutatorName = false;
         if (!acc[mutatorName]) {
           acc[mutatorName] = [];
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain '## EqualityOperator (Survived 1 times)'

[Killed] LogicalOperator
src/core/application/generate-testing-cheat-sheet.use-case.ts:15:29
 
     const groupedByMutator = survivedMutants.reduce(
       (acc, mutant) => {
-        const mutatorName = mutant.mutatorName || "UnknownMutator";
+        const mutatorName = mutant.mutatorName && "UnknownMutator";
         if (!acc[mutatorName]) {
           acc[mutatorName] = [];
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain '## EqualityOperator (Survived 1 times)'

[Killed] BooleanLiteral
src/core/application/generate-testing-cheat-sheet.use-case.ts:16:13
     const groupedByMutator = survivedMutants.reduce(
       (acc, mutant) => {
         const mutatorName = mutant.mutatorName || "UnknownMutator";
-        if (!acc[mutatorName]) {
+        if (acc[mutatorName]) {
           acc[mutatorName] = [];
         }
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/core/application/generate-testing-cheat-sheet.use-case.ts:16:32
     const groupedByMutator = survivedMutants.reduce(
       (acc, mutant) => {
         const mutatorName = mutant.mutatorName || "UnknownMutator";
-        if (!acc[mutatorName]) {
-          acc[mutatorName] = [];
-        }
+        if (!acc[mutatorName]) {}
         acc[mutatorName].push(mutant);
         return acc;
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/core/application/generate-testing-cheat-sheet.use-case.ts:17:30
       (acc, mutant) => {
         const mutatorName = mutant.mutatorName || "UnknownMutator";
         if (!acc[mutatorName]) {
-          acc[mutatorName] = [];
+          acc[mutatorName] = ["Stryker was here"];
         }
         acc[mutatorName].push(mutant);
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain '## EqualityOperator (Survived 1 times)'

[Killed] MethodExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:28:28
     let cheatSheet = "# Mutation Testing Cheat Sheet\n\n";
     cheatSheet += `Based on the latest analysis of ${survivedMutants.length} surviving mutants, here are the most common testing anti-patterns in this project and how to fix them:\n\n`;
 
-    const sortedMutators = Object.keys(groupedByMutator).sort(
-      (a, b) => groupedByMutator[b].length - groupedByMutator[a].length,
-    );
+    const sortedMutators = Object.keys(groupedByMutator);
 
     for (const mutator of sortedMutators) {
killedBy: GenerateTestingCheatSheetUseCase should sort mutators by frequency
statusReason: expected 398 to be less than 170

[Killed] ArithmeticOperator
src/core/application/generate-testing-cheat-sheet.use-case.ts:29:17
     cheatSheet += `Based on the latest analysis of ${survivedMutants.length} surviving mutants, here are the most common testing anti-patterns in this project and how to fix them:\n\n`;
 
     const sortedMutators = Object.keys(groupedByMutator).sort(
-      (a, b) => groupedByMutator[b].length - groupedByMutator[a].length,
+      (a, b) => groupedByMutator[b].length + groupedByMutator[a].length,
     );
 
killedBy: GenerateTestingCheatSheetUseCase should sort mutators by frequency
statusReason: expected 398 to be less than 170

[Killed] ArrowFunction
src/core/application/generate-testing-cheat-sheet.use-case.ts:29:7
     cheatSheet += `Based on the latest analysis of ${survivedMutants.length} surviving mutants, here are the most common testing anti-patterns in this project and how to fix them:\n\n`;
 
     const sortedMutators = Object.keys(groupedByMutator).sort(
-      (a, b) => groupedByMutator[b].length - groupedByMutator[a].length,
+      () => undefined,
     );
 
killedBy: GenerateTestingCheatSheetUseCase should sort mutators by frequency
statusReason: expected 398 to be less than 170

[Killed] StringLiteral
src/core/application/generate-testing-cheat-sheet.use-case.ts:34:21
 
     for (const mutator of sortedMutators) {
       const count = groupedByMutator[mutator].length;
-      cheatSheet += `## ${mutator} (Survived ${count} times)\n\n`;
+      cheatSheet += ``;
 
       if (mutator.includes("Equality") || mutator.includes("Conditional")) {
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain '## EqualityOperator (Survived 1 times)'

[Killed] BlockStatement
src/core/application/generate-testing-cheat-sheet.use-case.ts:39:77
       if (mutator.includes("Equality") || mutator.includes("Conditional")) {
         cheatSheet += `**Best Practice:** Always write a specific test case for the boundary value. Use strict equality (\`toBe\`, \`toEqual\`) instead of truthy assertions.\n\n`;
-      } else if (mutator.includes("String") || mutator.includes("Literal")) {
-        cheatSheet += `**Anti-Pattern:** Missing assertions on specific output strings or literal values. Tests might check that a function returns a string, but not the *exact* string.\n\n`;
-        cheatSheet += `**Best Practice:** Assert exact formatting and string literals. If a function returns an error message, test the exact error message content.\n\n`;
-      } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
+      } else if (mutator.includes("String") || mutator.includes("Literal")) {} else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
         cheatSheet += `**Anti-Pattern:** Only testing the "happy path" (true branch) of logical conditions (AND/OR). The false branch remains untested.\n\n`;
         cheatSheet += `**Best Practice:** Write dedicated test cases that explicitly trigger the \`false\` condition of logical operators to ensure the branch logic is covered.\n\n`;
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for String mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Missing assertions on specific output…'

[Killed] ConditionalExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:39:18
       if (mutator.includes("Equality") || mutator.includes("Conditional")) {
         cheatSheet += `**Best Practice:** Always write a specific test case for the boundary value. Use strict equality (\`toBe\`, \`toEqual\`) instead of truthy assertions.\n\n`;
-      } else if (mutator.includes("String") || mutator.includes("Literal")) {
+      } else if (true) {
         cheatSheet += `**Anti-Pattern:** Missing assertions on specific output strings or literal values. Tests might check that a function returns a string, but not the *exact* string.\n\n`;
         cheatSheet += `**Best Practice:** Assert exact formatting and string literals. If a function returns an error message, test the exact error message content.\n\n`;
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Boolean mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Only testing the "happy path"'

[Killed] ConditionalExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:42:18
       } else if (mutator.includes("String") || mutator.includes("Literal")) {
         cheatSheet += `**Anti-Pattern:** Missing assertions on specific output strings or literal values. Tests might check that a function returns a string, but not the *exact* string.\n\n`;
         cheatSheet += `**Best Practice:** Assert exact formatting and string literals. If a function returns an error message, test the exact error message content.\n\n`;
-      } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
+      } else if (true) {
         cheatSheet += `**Anti-Pattern:** Only testing the "happy path" (true branch) of logical conditions (AND/OR). The false branch remains untested.\n\n`;
         cheatSheet += `**Best Practice:** Write dedicated test cases that explicitly trigger the \`false\` condition of logical operators to ensure the branch logic is covered.\n\n`;
killedBy: GenerateTestingCheatSheetUseCase should handle unknown mutator type
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Uncovered code mutations for WeirdMut…'

[Killed] LogicalOperator
src/core/application/generate-testing-cheat-sheet.use-case.ts:42:18
       } else if (mutator.includes("String") || mutator.includes("Literal")) {
         cheatSheet += `**Anti-Pattern:** Missing assertions on specific output strings or literal values. Tests might check that a function returns a string, but not the *exact* string.\n\n`;
         cheatSheet += `**Best Practice:** Assert exact formatting and string literals. If a function returns an error message, test the exact error message content.\n\n`;
-      } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
+      } else if (mutator.includes("Boolean") && mutator.includes("Logical")) {
         cheatSheet += `**Anti-Pattern:** Only testing the "happy path" (true branch) of logical conditions (AND/OR). The false branch remains untested.\n\n`;
         cheatSheet += `**Best Practice:** Write dedicated test cases that explicitly trigger the \`false\` condition of logical operators to ensure the branch logic is covered.\n\n`;
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Boolean mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Only testing the "happy path"'

[Killed] StringLiteral
src/core/application/generate-testing-cheat-sheet.use-case.ts:43:23
         cheatSheet += `**Anti-Pattern:** Missing assertions on specific output strings or literal values. Tests might check that a function returns a string, but not the *exact* string.\n\n`;
         cheatSheet += `**Best Practice:** Assert exact formatting and string literals. If a function returns an error message, test the exact error message content.\n\n`;
       } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
-        cheatSheet += `**Anti-Pattern:** Only testing the "happy path" (true branch) of logical conditions (AND/OR). The false branch remains untested.\n\n`;
+        cheatSheet += ``;
         cheatSheet += `**Best Practice:** Write dedicated test cases that explicitly trigger the \`false\` condition of logical operators to ensure the branch logic is covered.\n\n`;
       } else {
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Boolean mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Only testing the "happy path"'

[Killed] BlockStatement
src/core/application/generate-testing-cheat-sheet.use-case.ts:45:14
       } else if (mutator.includes("Boolean") || mutator.includes("Logical")) {
         cheatSheet += `**Anti-Pattern:** Only testing the "happy path" (true branch) of logical conditions (AND/OR). The false branch remains untested.\n\n`;
         cheatSheet += `**Best Practice:** Write dedicated test cases that explicitly trigger the \`false\` condition of logical operators to ensure the branch logic is covered.\n\n`;
-      } else {
-        cheatSheet += `**Anti-Pattern:** Uncovered code mutations for ${mutator}.\n\n`;
-        cheatSheet += `**Best Practice:** Ensure robust coverage and explicit assertions around this logic.\n\n`;
-      }
+      } else {}
 
       const examples = groupedByMutator[mutator].slice(0, 3);
killedBy: GenerateTestingCheatSheetUseCase should handle unknown mutator type
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'Uncovered code mutations for WeirdMut…'

[Survived] StringLiteral
src/core/application/generate-testing-cheat-sheet.use-case.ts:47:23
         cheatSheet += `**Best Practice:** Write dedicated test cases that explicitly trigger the \`false\` condition of logical operators to ensure the branch logic is covered.\n\n`;
       } else {
         cheatSheet += `**Anti-Pattern:** Uncovered code mutations for ${mutator}.\n\n`;
-        cheatSheet += `**Best Practice:** Ensure robust coverage and explicit assertions around this logic.\n\n`;
+        cheatSheet += ``;
       }
 

[Killed] MethodExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:50:24
         cheatSheet += `**Best Practice:** Ensure robust coverage and explicit assertions around this logic.\n\n`;
       }
 
-      const examples = groupedByMutator[mutator].slice(0, 3);
+      const examples = groupedByMutator[mutator];
       cheatSheet += `### Recent Examples:\n`;
       examples.forEach((ex) => {
killedBy: GenerateTestingCheatSheetUseCase should limit examples to 3 per mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' not to contain 'f4.ts'

[Killed] BlockStatement
src/core/application/generate-testing-cheat-sheet.use-case.ts:52:32
 
       const examples = groupedByMutator[mutator].slice(0, 3);
       cheatSheet += `### Recent Examples:\n`;
-      examples.forEach((ex) => {
-        cheatSheet += `- \`${ex.filePath}\` at line ${ex.line || "unknown"}: mutated to \`${ex.replacement || "none"}\`\n`;
-      });
+      examples.forEach((ex) => {});
       cheatSheet += `\n`;
     }
killedBy: GenerateTestingCheatSheetUseCase should generate cheat sheet for Equality mutator
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'file1.ts'

[Killed] ConditionalExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:53:93
       const examples = groupedByMutator[mutator].slice(0, 3);
       cheatSheet += `### Recent Examples:\n`;
       examples.forEach((ex) => {
-        cheatSheet += `- \`${ex.filePath}\` at line ${ex.line || "unknown"}: mutated to \`${ex.replacement || "none"}\`\n`;
+        cheatSheet += `- \`${ex.filePath}\` at line ${ex.line || "unknown"}: mutated to \`${false}\`\n`;
       });
       cheatSheet += `\n`;
killedBy: GenerateTestingCheatSheetUseCase should fallback to 'unknown' line and 'none' replacement if missing
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'mutated to `none`'

[Killed] LogicalOperator
src/core/application/generate-testing-cheat-sheet.use-case.ts:53:93
       const examples = groupedByMutator[mutator].slice(0, 3);
       cheatSheet += `### Recent Examples:\n`;
       examples.forEach((ex) => {
-        cheatSheet += `- \`${ex.filePath}\` at line ${ex.line || "unknown"}: mutated to \`${ex.replacement || "none"}\`\n`;
+        cheatSheet += `- \`${ex.filePath}\` at line ${ex.line || "unknown"}: mutated to \`${ex.replacement && "none"}\`\n`;
       });
       cheatSheet += `\n`;
killedBy: GenerateTestingCheatSheetUseCase should fallback to 'unknown' line and 'none' replacement if missing
statusReason: expected '# Mutation Testing Cheat Sheet\n\nBas…' to contain 'mutated to `none`'

[Survived] StringLiteral
src/core/application/generate-testing-cheat-sheet.use-case.ts:55:21
       examples.forEach((ex) => {
         cheatSheet += `- \`${ex.filePath}\` at line ${ex.line || "unknown"}: mutated to \`${ex.replacement || "none"}\`\n`;
       });
-      cheatSheet += `\n`;
+      cheatSheet += ``;
     }
 

[Killed] MethodExpression
src/core/application/generate-testing-cheat-sheet.use-case.ts:58:12
       cheatSheet += `\n`;
     }
 
-    return cheatSheet.trim();
+    return cheatSheet;
   }
 }
killedBy: GenerateTestingCheatSheetUseCase should trim the resulting cheat sheet string
statusReason: expected true to be false // Object.is equality
