[Killed] BlockStatement
src/core/application/get-killed-mutants.use-case.ts:11:74
 export class GetKilledMutantsUseCase {
   constructor(private readonly reportStream: ReportStream) {}
 
-  public execute(filePathFilter?: string): Result<MutantDetail[], Error> {
-    const report = this.reportStream.current();
-
-    if (!report) {
-      return err(
-        new Error(
-          "Kein Mutationsbericht gefunden. Wurde Stryker bereits ausgeführt?",
-        ),
-      );
-    }
-
-    const killed = extractKilledMutants(report, filePathFilter);
-    return ok(killed);
-  }
+  public execute(filePathFilter?: string): Result<MutantDetail[], Error> {}
 }
 
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BooleanLiteral
src/core/application/get-killed-mutants.use-case.ts:14:9
   public execute(filePathFilter?: string): Result<MutantDetail[], Error> {
     const report = this.reportStream.current();
 
-    if (!report) {
+    if (report) {
       return err(
         new Error(
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/get-killed-mutants.use-case.ts:14:9
   public execute(filePathFilter?: string): Result<MutantDetail[], Error> {
     const report = this.reportStream.current();
 
-    if (!report) {
+    if (true) {
       return err(
         new Error(
killedBy: GetKilledMutantsUseCase sollte getötete Mutanten zurückgeben, wenn ein Bericht vorliegt
statusReason: expected false to be true // Object.is equality
