[Killed] StringLiteral
src/core/application/predict-mutation-impact.use-case.ts:12:50
 export class PredictMutationImpactUseCase {
   public execute(changedFiles: string[]): FileMutationRisk[] {
     return changedFiles.map((file) => {
-      let riskLevel: "HIGH" | "MEDIUM" | "LOW" = "LOW";
+      let riskLevel: "HIGH" | "MEDIUM" | "LOW" = "";
       let estimatedMutantCount = 5;
       let reason = "Routine file change.";
killedBy: PredictMutationImpactUseCase should categorize generic files as LOW risk
statusReason: expected '' to be 'LOW' // Object.is equality

[Killed] StringLiteral
src/core/application/predict-mutation-impact.use-case.ts:19:23
       if (
         file.includes("use-case") ||
         file.includes("domain") ||
-        file.includes("adapter")
+        file.includes("")
       ) {
         riskLevel = "HIGH";
killedBy: PredictMutationImpactUseCase should categorize helper and config files as MEDIUM risk
statusReason: expected 'HIGH' to be 'MEDIUM' // Object.is equality

[Killed] ConditionalExpression
src/core/application/predict-mutation-impact.use-case.ts:26:9
         reason =
           "Core business or adapter logic contains complex branching and assertions.";
       } else if (
-        file.includes("config") ||
-        file.includes("util") ||
-        file.includes("helper")
+        false
       ) {
         riskLevel = "MEDIUM";
killedBy: PredictMutationImpactUseCase should categorize helper and config files as MEDIUM risk
statusReason: expected 'LOW' to be 'MEDIUM' // Object.is equality

[Killed] StringLiteral
src/core/application/predict-mutation-impact.use-case.ts:27:23
           "Core business or adapter logic contains complex branching and assertions.";
       } else if (
         file.includes("config") ||
-        file.includes("util") ||
+        file.includes("") ||
         file.includes("helper")
       ) {
killedBy: PredictMutationImpactUseCase should categorize generic files as LOW risk
statusReason: expected 'MEDIUM' to be 'LOW' // Object.is equality

[Survived] StringLiteral
src/core/application/predict-mutation-impact.use-case.ts:33:11
         riskLevel = "MEDIUM";
         estimatedMutantCount = 12;
         reason =
-          "Utility functions and configurations require boundary condition assertions.";
+          "";
       }
 
