[Killed] EqualityOperator
src/core/application/run-mutation-tests.use-case.ts:28:9
     options?: StrykerRunOptions,
   ): Promise<Result<MutationReport, Error>> {
     const currentStatus = this.statusStream.current();
-    if (currentStatus.state === "running") {
+    if (currentStatus.state !== "running") {
       return err(new Error("Ein Mutationstest-Lauf ist bereits aktiv."));
     }
killedBy: RunMutationTestsUseCase führt Mutationstests erfolgreich aus, aktualisiert Status, publiziert Report und benachrichtigt Desktop
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/run-mutation-tests.use-case.ts:57:21
       );
 
       return ok(report);
-    } catch (error) {
-      const errorMessage =
-        error instanceof Error ? error.message : String(error);
-      this.statusStream.setFailed(errorMessage);
-      await this.notificationService.notifyError(errorMessage);
-      return err(new Error(errorMessage));
-    }
+    } catch (error) {}
   }
 }
killedBy: RunMutationTestsUseCase fängt unerwartete Exceptions in der Ausführung ab und benachrichtigt Desktop
statusReason: Cannot read properties of undefined (reading 'isOk')
