[Survived] ArrayDeclaration
src/core/application/run-targeted-mutation-tests.use-case.ts:30:34
   public async execute(
     options?: string | TargetedRunOptions,
   ): Promise<Result<MutationReport, Error>> {
-    let changedFiles: string[] = [];
+    let changedFiles: string[] = ["Stryker was here"];
 
     if (typeof options === "string") {

[Killed] EqualityOperator
src/core/application/run-targeted-mutation-tests.use-case.ts:32:9
   ): Promise<Result<MutationReport, Error>> {
     let changedFiles: string[] = [];
 
-    if (typeof options === "string") {
+    if (typeof options !== "string") {
       changedFiles = await this.gitService.getChangedFiles(options);
     } else if (options?.useLineRanges) {
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für einen einzelnen Commit und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/application/run-targeted-mutation-tests.use-case.ts:34:16
 
     if (typeof options === "string") {
       changedFiles = await this.gitService.getChangedFiles(options);
-    } else if (options?.useLineRanges) {
+    } else if (true) {
       changedFiles = await this.gitService.getChangedLineRanges(options.revision);
     } else if (options?.commitSha) {
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für einen einzelnen Commit und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/core/application/run-targeted-mutation-tests.use-case.ts:34:16
 
     if (typeof options === "string") {
       changedFiles = await this.gitService.getChangedFiles(options);
-    } else if (options?.useLineRanges) {
+    } else if (options.useLineRanges) {
       changedFiles = await this.gitService.getChangedLineRanges(options.revision);
     } else if (options?.commitSha) {
killedBy: RunTargetedMutationTestsUseCase gibt ein err-Result zurück, wenn getChangedFiles null zurückgibt
statusReason: Cannot read properties of undefined (reading 'useLineRanges')

[Killed] ConditionalExpression
src/core/application/run-targeted-mutation-tests.use-case.ts:36:16
       changedFiles = await this.gitService.getChangedFiles(options);
     } else if (options?.useLineRanges) {
       changedFiles = await this.gitService.getChangedLineRanges(options.revision);
-    } else if (options?.commitSha) {
+    } else if (false) {
       changedFiles = await this.gitService.getChangedFilesForCommit(
         options.commitSha,
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für einen einzelnen Commit und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/run-targeted-mutation-tests.use-case.ts:36:36
       changedFiles = await this.gitService.getChangedFiles(options);
     } else if (options?.useLineRanges) {
       changedFiles = await this.gitService.getChangedLineRanges(options.revision);
-    } else if (options?.commitSha) {
-      changedFiles = await this.gitService.getChangedFilesForCommit(
-        options.commitSha,
-      );
-    } else if (options?.fromRevision && options?.toRevision) {
+    } else if (options?.commitSha) {} else if (options?.fromRevision && options?.toRevision) {
       changedFiles = await this.gitService.getChangedFilesBetween(
         options.fromRevision,
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für einen einzelnen Commit und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/application/run-targeted-mutation-tests.use-case.ts:40:62
       changedFiles = await this.gitService.getChangedFilesForCommit(
         options.commitSha,
       );
-    } else if (options?.fromRevision && options?.toRevision) {
-      changedFiles = await this.gitService.getChangedFilesBetween(
-        options.fromRevision,
-        options.toRevision,
-      );
-    } else {
+    } else if (options?.fromRevision && options?.toRevision) {} else {
       changedFiles = await this.gitService.getChangedFiles(options?.revision);
     }
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für eine Commit-Range (from/to) und führt Mutationstests dafür aus
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/core/application/run-targeted-mutation-tests.use-case.ts:40:16
       changedFiles = await this.gitService.getChangedFilesForCommit(
         options.commitSha,
       );
-    } else if (options?.fromRevision && options?.toRevision) {
+    } else if (options.fromRevision && options?.toRevision) {
       changedFiles = await this.gitService.getChangedFilesBetween(
         options.fromRevision,
killedBy: RunTargetedMutationTestsUseCase gibt ein err-Result zurück, wenn getChangedFiles null zurückgibt
statusReason: Cannot read properties of undefined (reading 'fromRevision')

[Killed] BlockStatement
src/core/application/run-targeted-mutation-tests.use-case.ts:45:12
         options.fromRevision,
         options.toRevision,
       );
-    } else {
-      changedFiles = await this.gitService.getChangedFiles(options?.revision);
-    }
+    } else {}
 
     if (!changedFiles || changedFiles.length === 0) {
killedBy: RunTargetedMutationTestsUseCase ermittelt geänderte Dateien für eine Revision (z.B. HEAD~1 oder main)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/application/run-targeted-mutation-tests.use-case.ts:49:9
       changedFiles = await this.gitService.getChangedFiles(options?.revision);
     }
 
-    if (!changedFiles || changedFiles.length === 0) {
+    if (!changedFiles && changedFiles.length === 0) {
       return err(
         new Error(
killedBy: RunTargetedMutationTestsUseCase gibt ein err-Result zurück, wenn getChangedFiles null zurückgibt
statusReason: Cannot read properties of null (reading 'length')
