[Killed] StringLiteral
src/core/domain/execution-status.ts:46:14
 
   public setRunning(message?: string, percentage?: number): void {
     this.subject.next({
-      state: "running",
+      state: "",
       progress: { message, percentage },
       error: null,
killedBy: ExecutionStatusStream Domain Model aktualisiert den Status auf 'running' mit Fortschrittsinformationen
statusReason: expected '' to be 'running' // Object.is equality

[Killed] StringLiteral
src/core/domain/execution-status.ts:64:14
 
   public setFailed(errorMessage: string): void {
     this.subject.next({
-      state: "failed",
+      state: "",
       error: errorMessage,
       lastRunTime: new Date().toISOString(),
killedBy: ExecutionStatusStream Domain Model aktualisiert den Status auf 'failed' mit Fehlermeldung
statusReason: expected '' to be 'failed' // Object.is equality
