[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:108:7
 
 export function mapMutatorCategory(mutatorName: string): MutatorCategory {
   const name = mutatorName.toLowerCase();
-  if (name.includes("arithmetic") || name.includes("math"))
+  if (false)
     return "Arithmetic & Math";
   if (
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Arithmetic & Math' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:108:7
 
 export function mapMutatorCategory(mutatorName: string): MutatorCategory {
   const name = mutatorName.toLowerCase();
-  if (name.includes("arithmetic") || name.includes("math"))
+  if (name.includes("arithmetic") && name.includes("math"))
     return "Arithmetic & Math";
   if (
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Arithmetic & Math' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-insight.ts:109:12
 export function mapMutatorCategory(mutatorName: string): MutatorCategory {
   const name = mutatorName.toLowerCase();
   if (name.includes("arithmetic") || name.includes("math"))
-    return "Arithmetic & Math";
+    return "";
   if (
     name.includes("equality") ||
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected '' to be 'Arithmetic & Math' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:111:5
   if (name.includes("arithmetic") || name.includes("math"))
     return "Arithmetic & Math";
   if (
-    name.includes("equality") ||
-    name.includes("logical") ||
-    name.includes("boolean")
+    (name.includes("equality") || name.includes("logical")) && name.includes("boolean")
   )
     return "Equality & Logic";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Equality & Logic' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:111:5
   if (name.includes("arithmetic") || name.includes("math"))
     return "Arithmetic & Math";
   if (
-    name.includes("equality") ||
-    name.includes("logical") ||
-    name.includes("boolean")
+    true
   )
     return "Equality & Logic";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Equality & Logic' to be 'Control Flow & Conditionals' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:117:5
   )
     return "Equality & Logic";
   if (
-    name.includes("conditional") ||
-    name.includes("if") ||
-    name.includes("switch")
+    false
   )
     return "Control Flow & Conditionals";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Control Flow & Conditionals' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:117:5
   )
     return "Equality & Logic";
   if (
-    name.includes("conditional") ||
-    name.includes("if") ||
+    false ||
     name.includes("switch")
   )
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Control Flow & Conditionals' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-insight.ts:118:19
     return "Equality & Logic";
   if (
     name.includes("conditional") ||
-    name.includes("if") ||
+    name.includes("") ||
     name.includes("switch")
   )
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Control Flow & Conditionals' to be 'String & Literals' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:122:7
     name.includes("switch")
   )
     return "Control Flow & Conditionals";
-  if (name.includes("string") || name.includes("literal"))
+  if (false)
     return "String & Literals";
   if (
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'String & Literals' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:122:7
     name.includes("switch")
   )
     return "Control Flow & Conditionals";
-  if (name.includes("string") || name.includes("literal"))
+  if (true)
     return "String & Literals";
   if (
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'String & Literals' to be 'Block & Structure' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:125:5
   if (name.includes("string") || name.includes("literal"))
     return "String & Literals";
   if (
-    name.includes("exception") ||
-    name.includes("throw") ||
+    name.includes("exception") && name.includes("throw") ||
     name.includes("catch")
   )
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Exception & Error Handling' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:125:5
   if (name.includes("string") || name.includes("literal"))
     return "String & Literals";
   if (
-    name.includes("exception") ||
-    name.includes("throw") ||
-    name.includes("catch")
+    (name.includes("exception") || name.includes("throw")) && name.includes("catch")
   )
     return "Exception & Error Handling";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Exception & Error Handling' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-insight.ts:129:12
     name.includes("throw") ||
     name.includes("catch")
   )
-    return "Exception & Error Handling";
+    return "";
   if (name.includes("block") || name.includes("statement"))
     return "Block & Structure";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected '' to be 'Exception & Error Handling' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:130:7
     name.includes("catch")
   )
     return "Exception & Error Handling";
-  if (name.includes("block") || name.includes("statement"))
+  if (false)
     return "Block & Structure";
   if (name.includes("array") || name.includes("collection"))
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Block & Structure' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:130:7
     name.includes("catch")
   )
     return "Exception & Error Handling";
-  if (name.includes("block") || name.includes("statement"))
+  if (true)
     return "Block & Structure";
   if (name.includes("array") || name.includes("collection"))
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Block & Structure' to be 'Array & Collection' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:132:7
     return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement"))
     return "Block & Structure";
-  if (name.includes("array") || name.includes("collection"))
+  if (name.includes("array") && name.includes("collection"))
     return "Array & Collection";
   if (
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Array & Collection' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:132:7
     return "Exception & Error Handling";
   if (name.includes("block") || name.includes("statement"))
     return "Block & Structure";
-  if (name.includes("array") || name.includes("collection"))
+  if (true)
     return "Array & Collection";
   if (
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Array & Collection' to be 'Async & Promises' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:135:5
   if (name.includes("array") || name.includes("collection"))
     return "Array & Collection";
   if (
-    name.includes("async") ||
-    name.includes("promise") ||
-    name.includes("await")
+    (name.includes("async") || name.includes("promise")) && name.includes("await")
   )
     return "Async & Promises";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Unknown Category' to be 'Async & Promises' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:135:5
   if (name.includes("array") || name.includes("collection"))
     return "Array & Collection";
   if (
-    name.includes("async") ||
-    name.includes("promise") ||
-    name.includes("await")
+    true
   )
     return "Async & Promises";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Async & Promises' to be 'Unknown Category' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-insight.ts:137:19
   if (
     name.includes("async") ||
     name.includes("promise") ||
-    name.includes("await")
+    name.includes("")
   )
     return "Async & Promises";
killedBy: MutationInsight Entity Domain Model mappt alle Mutator-Kategorien exakt
statusReason: expected 'Async & Promises' to be 'Unknown Category' // Object.is equality

[Killed] BlockStatement
src/core/domain/mutation-insight.ts:143:65
   return "Unknown Category";
 }
 
-export function mapFileCategory(filePath: string): FileCategory {
-  const path = filePath.toLowerCase().replace(/\\/g, "/");
-  if (path.includes("/domain/")) return "Domain";
-  if (path.includes("/application/") || path.includes("use-case"))
-    return "Application";
-  if (path.includes("/infrastructure/") || path.includes("adapter"))
-    return "Infrastructure";
-  if (path.includes("/ui/") || path.includes("/components/")) return "UI";
-  if (path.includes("/util") || path.includes("/helper")) return "Utility";
-  return "Unknown";
-}
+export function mapFileCategory(filePath: string): FileCategory {}
 
 export function buildMutationInsightEntity(
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected undefined to be 'Domain' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:146:7
 export function mapFileCategory(filePath: string): FileCategory {
   const path = filePath.toLowerCase().replace(/\\/g, "/");
   if (path.includes("/domain/")) return "Domain";
-  if (path.includes("/application/") || path.includes("use-case"))
+  if (path.includes("/application/") && path.includes("use-case"))
     return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter"))
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Application' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:146:7
 export function mapFileCategory(filePath: string): FileCategory {
   const path = filePath.toLowerCase().replace(/\\/g, "/");
   if (path.includes("/domain/")) return "Domain";
-  if (path.includes("/application/") || path.includes("use-case"))
+  if (true)
     return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter"))
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Application' to be 'Infrastructure' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:148:7
   if (path.includes("/domain/")) return "Domain";
   if (path.includes("/application/") || path.includes("use-case"))
     return "Application";
-  if (path.includes("/infrastructure/") || path.includes("adapter"))
+  if (path.includes("/infrastructure/") && path.includes("adapter"))
     return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Infrastructure' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:148:7
   if (path.includes("/domain/")) return "Domain";
   if (path.includes("/application/") || path.includes("use-case"))
     return "Application";
-  if (path.includes("/infrastructure/") || path.includes("adapter"))
+  if (true)
     return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Infrastructure' to be 'UI' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:150:7
     return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter"))
     return "Infrastructure";
-  if (path.includes("/ui/") || path.includes("/components/")) return "UI";
+  if (path.includes("/ui/") && path.includes("/components/")) return "UI";
   if (path.includes("/util") || path.includes("/helper")) return "Utility";
   return "Unknown";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'UI' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:150:7
     return "Application";
   if (path.includes("/infrastructure/") || path.includes("adapter"))
     return "Infrastructure";
-  if (path.includes("/ui/") || path.includes("/components/")) return "UI";
+  if (false) return "UI";
   if (path.includes("/util") || path.includes("/helper")) return "Utility";
   return "Unknown";
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'UI' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:151:7
   if (path.includes("/infrastructure/") || path.includes("adapter"))
     return "Infrastructure";
   if (path.includes("/ui/") || path.includes("/components/")) return "UI";
-  if (path.includes("/util") || path.includes("/helper")) return "Utility";
+  if (path.includes("/util") && path.includes("/helper")) return "Utility";
   return "Unknown";
 }
killedBy: MutationInsight Entity Domain Model mappt alle Dateipfad-Kategorien (Slashes und Backslashes) exakt
statusReason: expected 'Unknown' to be 'Utility' // Object.is equality

[Killed] ArrayDeclaration
src/core/domain/mutation-insight.ts:160:69
 ): MutationInsightEntity {
   const mutatorCategory = mapMutatorCategory(input.mutatorName);
   const fileCategory = mapFileCategory(input.filePath);
-  const testsRan = Array.isArray(input.testsRan) ? input.testsRan : [];
+  const testsRan = Array.isArray(input.testsRan) ? input.testsRan : ["Stryker was here"];
 
   const coverageState: TestCoverageState =
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected 'TestsRanButFailedToAssert' to be 'NoTests' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:163:5
   const testsRan = Array.isArray(input.testsRan) ? input.testsRan : [];
 
   const coverageState: TestCoverageState =
-    input.status === "NoCoverage" || testsRan.length === 0
+    input.status === "NoCoverage" && testsRan.length === 0
       ? "NoTests"
       : "TestsRanButFailedToAssert";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected 'TestsRanButFailedToAssert' to be 'NoTests' // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-insight.ts:163:38
   const testsRan = Array.isArray(input.testsRan) ? input.testsRan : [];
 
   const coverageState: TestCoverageState =
-    input.status === "NoCoverage" || testsRan.length === 0
+    input.status === "NoCoverage" || testsRan.length !== 0
       ? "NoTests"
       : "TestsRanButFailedToAssert";
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected 'NoTests' to be 'TestsRanButFailedToAssert' // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-insight.ts:168:5
       : "TestsRanButFailedToAssert";
 
   const flawCategory =
-    coverageState === "NoTests"
+    coverageState !== "NoTests"
       ? "Uncovered Execution Path"
       : "OverMocking / Weak Assertions";
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected 'Uncovered Execution Path' to be 'OverMocking / Weak Assertions' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-insight.ts:172:33
       ? "Uncovered Execution Path"
       : "OverMocking / Weak Assertions";
 
-  let severity: SeverityLevel = "Medium";
+  let severity: SeverityLevel = "";
   let riskScore = 50;
 
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '' to be 'Medium' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:175:7
   let severity: SeverityLevel = "Medium";
   let riskScore = 50;
 
-  if (input.status === "NoCoverage") {
+  if (false) {
     severity = "High";
     riskScore = 85;
killedBy: MutationInsight Entity Domain Model kategorisiert NoCoverage Mutanten korrekt mit Risikoscore 85
statusReason: expected 'Medium' to be 'High' // Object.is equality

[Killed] BlockStatement
src/core/domain/mutation-insight.ts:178:72
   if (input.status === "NoCoverage") {
     severity = "High";
     riskScore = 85;
-  } else if (fileCategory === "Domain" && input.status === "Survived") {
-    severity = "Critical";
-    riskScore = 95;
-  } else if (mutatorCategory === "Exception & Error Handling") {
+  } else if (fileCategory === "Domain" && input.status === "Survived") {} else if (mutatorCategory === "Exception & Error Handling") {
     severity = "High";
     riskScore = 80;
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected 'Medium' to be 'Critical' // Object.is equality

[Killed] ConditionalExpression
src/core/domain/mutation-insight.ts:181:14
   } else if (fileCategory === "Domain" && input.status === "Survived") {
     severity = "Critical";
     riskScore = 95;
-  } else if (mutatorCategory === "Exception & Error Handling") {
+  } else if (false) {
     severity = "High";
     riskScore = 80;
killedBy: MutationInsight Entity Domain Model kategorisiert Exception & Error Handling Mutanten mit Risikoscore 80
statusReason: expected 'Medium' to be 'High' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-insight.ts:182:16
     severity = "Critical";
     riskScore = 95;
   } else if (mutatorCategory === "Exception & Error Handling") {
-    severity = "High";
+    severity = "";
     riskScore = 80;
   }
killedBy: MutationInsight Entity Domain Model kategorisiert Exception & Error Handling Mutanten mit Risikoscore 80
statusReason: expected '' to be 'High' // Object.is equality

[Killed] EqualityOperator
src/core/domain/mutation-insight.ts:188:5
 
   const primarySkillGap = `${mutatorCategory} Assertions`;
   const originalCode =
-    input.sourceCodeSnippet !== undefined && input.sourceCodeSnippet !== ""
+    input.sourceCodeSnippet === undefined && input.sourceCodeSnippet !== ""
       ? input.sourceCodeSnippet
       : "// Quellcode-Zeile nicht direkt verfügbar";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected undefined to be '// Quellcode-Zeile nicht direkt verfü…' // Object.is equality

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:188:5
 
   const primarySkillGap = `${mutatorCategory} Assertions`;
   const originalCode =
-    input.sourceCodeSnippet !== undefined && input.sourceCodeSnippet !== ""
+    input.sourceCodeSnippet !== undefined || input.sourceCodeSnippet !== ""
       ? input.sourceCodeSnippet
       : "// Quellcode-Zeile nicht direkt verfügbar";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected undefined to be '// Quellcode-Zeile nicht direkt verfü…' // Object.is equality

[Killed] StringLiteral
src/core/domain/mutation-insight.ts:190:9
   const originalCode =
     input.sourceCodeSnippet !== undefined && input.sourceCodeSnippet !== ""
       ? input.sourceCodeSnippet
-      : "// Quellcode-Zeile nicht direkt verfügbar";
+      : "";
   const diff = `- ${originalCode}\n+ ${originalCode} [Mutated: ${input.replacement}]`;
 
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '' to be '// Quellcode-Zeile nicht direkt verfü…' // Object.is equality

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:191:16
     input.sourceCodeSnippet !== undefined && input.sourceCodeSnippet !== ""
       ? input.sourceCodeSnippet
       : "// Quellcode-Zeile nicht direkt verfügbar";
-  const diff = `- ${originalCode}\n+ ${originalCode} [Mutated: ${input.replacement}]`;
+  const diff = ``;
 
   const authorName =

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:194:5
   const diff = `- ${originalCode}\n+ ${originalCode} [Mutated: ${input.replacement}]`;
 
   const authorName =
-    input.authorName !== undefined && input.authorName !== ""
+    input.authorName !== undefined || input.authorName !== ""
       ? input.authorName
       : "Unknown";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Unknown <unknown@example.com>'

[Killed] EqualityOperator
src/core/domain/mutation-insight.ts:194:39
   const diff = `- ${originalCode}\n+ ${originalCode} [Mutated: ${input.replacement}]`;
 
   const authorName =
-    input.authorName !== undefined && input.authorName !== ""
+    input.authorName !== undefined && input.authorName === ""
       ? input.authorName
       : "Unknown";
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Alice Developer <dev@example.…'

[Killed] StringLiteral
src/core/domain/mutation-insight.ts:196:9
   const authorName =
     input.authorName !== undefined && input.authorName !== ""
       ? input.authorName
-      : "Unknown";
+      : "";
   const authorEmail =
     input.authorEmail !== undefined && input.authorEmail !== ""
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Unknown <unknown@example.com>'

[Killed] EqualityOperator
src/core/domain/mutation-insight.ts:198:40
       ? input.authorName
       : "Unknown";
   const authorEmail =
-    input.authorEmail !== undefined && input.authorEmail !== ""
+    input.authorEmail !== undefined && input.authorEmail === ""
       ? input.authorEmail
       : "unknown@example.com";
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Alice Developer <dev@example.…'

[Killed] LogicalOperator
src/core/domain/mutation-insight.ts:198:5
       ? input.authorName
       : "Unknown";
   const authorEmail =
-    input.authorEmail !== undefined && input.authorEmail !== ""
+    input.authorEmail !== undefined || input.authorEmail !== ""
       ? input.authorEmail
       : "unknown@example.com";
killedBy: MutationInsight Entity Domain Model handhabt fehlende optionale Felder (sourceCodeSnippet, author, testsRan) mit Fallbacks
statusReason: expected '[MUTANT INSIGHT RECORD]\nID: mutant-1…' to contain 'Author: Unknown <unknown@example.com>'

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:203:46
       : "unknown@example.com";
 
   const normalizedPath = input.filePath.replace(/\\/g, "/");
-  const moduleName = normalizedPath.includes("/")
+  const moduleName = normalizedPath.includes("")
     ? normalizedPath.split("/").pop()!
     : normalizedPath;

[Killed] ObjectLiteral
src/core/domain/mutation-insight.ts:243:26
       diff,
       cyclomaticComplexityEstimate: 3,
     },
-    testCoverageContext: {
-      testsRan,
-      testCoverageState: coverageState,
-      assertionFlawCategory: flawCategory,
-    },
+    testCoverageContext: {},
     gitDevContext: {
       authorEmail: input.authorEmail,
killedBy: MutationInsight Entity Domain Model erzeugt eine hochstrukturierte, Vector-DB-bereite Insight-Entität
statusReason: expected undefined to be 'TestsRanButFailedToAssert' // Object.is equality

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:259:55
       severity,
       riskScore,
       learningTopicTags: [
-        mutatorCategory.toLowerCase().replace(/\s+/g, "-"),
+        mutatorCategory.toLowerCase().replace(/\s+/g, ""),
         input.mutatorName.toLowerCase(),
         fileCategory.toLowerCase(),

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:266:16
       ],
       recommendedTrainingModule: {
-        title: `Meistere ${primarySkillGap} in ${fileCategory}-Komponenten`,
+        title: ``,
         summary: `Lerne, wie du seltene Randfälle und Modifikationen von ${input.mutatorName} mit präzisen Assertions absicherst.`,
         conceptToMaster: `Verifizierung von ${mutatorCategory}`,

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:268:26
       recommendedTrainingModule: {
         title: `Meistere ${primarySkillGap} in ${fileCategory}-Komponenten`,
         summary: `Lerne, wie du seltene Randfälle und Modifikationen von ${input.mutatorName} mit präzisen Assertions absicherst.`,
-        conceptToMaster: `Verifizierung von ${mutatorCategory}`,
+        conceptToMaster: ``,
         exampleFixCode: `expect(result).toBe(expectedValue); // Statt schwachem expect(result).toBeDefined()`,
         suggestedExercise: `Schreibe einen spezifischen Testfall in ${input.filePath.replace(".ts", ".spec.ts")}, der den Wert '${input.replacement}' explizit ausschließt.`,

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:269:25
         title: `Meistere ${primarySkillGap} in ${fileCategory}-Komponenten`,
         summary: `Lerne, wie du seltene Randfälle und Modifikationen von ${input.mutatorName} mit präzisen Assertions absicherst.`,
         conceptToMaster: `Verifizierung von ${mutatorCategory}`,
-        exampleFixCode: `expect(result).toBe(expectedValue); // Statt schwachem expect(result).toBeDefined()`,
+        exampleFixCode: ``,
         suggestedExercise: `Schreibe einen spezifischen Testfall in ${input.filePath.replace(".ts", ".spec.ts")}, der den Wert '${input.replacement}' explizit ausschließt.`,
       },

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:270:94
         summary: `Lerne, wie du seltene Randfälle und Modifikationen von ${input.mutatorName} mit präzisen Assertions absicherst.`,
         conceptToMaster: `Verifizierung von ${mutatorCategory}`,
         exampleFixCode: `expect(result).toBe(expectedValue); // Statt schwachem expect(result).toBeDefined()`,
-        suggestedExercise: `Schreibe einen spezifischen Testfall in ${input.filePath.replace(".ts", ".spec.ts")}, der den Wert '${input.replacement}' explizit ausschließt.`,
+        suggestedExercise: `Schreibe einen spezifischen Testfall in ${input.filePath.replace("", ".spec.ts")}, der den Wert '${input.replacement}' explizit ausschließt.`,
       },
     },

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:270:101
         summary: `Lerne, wie du seltene Randfälle und Modifikationen von ${input.mutatorName} mit präzisen Assertions absicherst.`,
         conceptToMaster: `Verifizierung von ${mutatorCategory}`,
         exampleFixCode: `expect(result).toBe(expectedValue); // Statt schwachem expect(result).toBeDefined()`,
-        suggestedExercise: `Schreibe einen spezifischen Testfall in ${input.filePath.replace(".ts", ".spec.ts")}, der den Wert '${input.replacement}' explizit ausschließt.`,
+        suggestedExercise: `Schreibe einen spezifischen Testfall in ${input.filePath.replace(".ts", "")}, der den Wert '${input.replacement}' explizit ausschließt.`,
       },
     },

[Survived] StringLiteral
src/core/domain/mutation-insight.ts:276:22
     vectorEmbedding: {
       vectorId: `insight-${input.mutantId}`,
       embeddingText,
-      schemaVersion: "1.0.0",
+      schemaVersion: "",
       createdAt: new Date().toISOString(),
     },
