[Killed] ArrayDeclaration
src/index.ts:30:31
 import { AnalyzeCoverageGapUseCase } from "./core/application/analyze-coverage-gap.use-case.js";
 import { InMemoryEventBusAdapter } from "./infrastructure/event/in-memory-event-bus.adapter.js";
 
-export const strykerPlugins = [
-  declareFactoryPlugin(PluginKind.Reporter, "mcp", mcpReporterFactory),
-];
+export const strykerPlugins = [];
 
 /**
killedBy: Plugin Index (Composition Root) sollte das Plugin korrekt deklarieren
statusReason: expected [] to have a length of 1 but got +0

[Survived] StringLiteral
src/index.ts:148:27
 export async function startStandaloneServer(
   logger: Logger,
   adapter?: McpServerAdapter,
-  mode: "sse" | "stdio" = "sse",
+  mode: "sse" | "stdio" = "",
 ): Promise<Result<void, Error>> {
   const server = adapter || createMcpServerAdapter(logger, 3000);

[Killed] LogicalOperator
src/index.ts:150:18
   adapter?: McpServerAdapter,
   mode: "sse" | "stdio" = "sse",
 ): Promise<Result<void, Error>> {
-  const server = adapter || createMcpServerAdapter(logger, 3000);
+  const server = adapter && createMcpServerAdapter(logger, 3000);
   if (mode === "stdio") {
     return server.startStdio();
killedBy: Plugin Index (Composition Root) sollte den Standalone-Server mit Standard-Adapter erzeugen und starten können
statusReason: Cannot read properties of undefined (reading 'start')
