[Survived] ObjectLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:27:9
           description:
             "Formatiert alle überlebenden Mutanten als verständliche Prompt-Anweisung zur KI-Testgenerierung.",
         },
-        {
-          name: "remediate_mutants",
-          description:
-            "Generiert konkreten Test-Code und Randwertprüfungen für überlebte Mutanten.",
-        },
+        {},
         {
           name: "why_is_this_bad",

[Survived] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:28:17
             "Formatiert alle überlebenden Mutanten als verständliche Prompt-Anweisung zur KI-Testgenerierung.",
         },
         {
-          name: "remediate_mutants",
+          name: "",
           description:
             "Generiert konkreten Test-Code und Randwertprüfungen für überlebte Mutanten.",

[Survived] BooleanLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:41:25
               name: "mutantId",
               description:
                 "The ID of a specific surviving mutant to analyze (optional). If omitted, analyzes all surviving mutants.",
-              required: false,
+              required: true,
             },
           ],

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:54:11
         const { name } = request.params;
 
         if (
-          name === "explain_survived_mutants" ||
-          name === "remediate_mutants"
+          true
         ) {
           const survivedResult = await this.getSurvivedUseCase.execute();
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId success
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:54:11
         const { name } = request.params;
 
         if (
-          name === "explain_survived_mutants" ||
-          name === "remediate_mutants"
+          false
         ) {
           const survivedResult = await this.getSurvivedUseCase.execute();
killedBy: McpPromptController GetPrompt explain_survived_mutants & remediate_mutants should return success message if no mutants survived
statusReason: Unbekannter Prompt: explain_survived_mutants

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:55:11
 
         if (
           name === "explain_survived_mutants" ||
-          name === "remediate_mutants"
+          false
         ) {
           const survivedResult = await this.getSurvivedUseCase.execute();
killedBy: McpPromptController GetPrompt explain_survived_mutants & remediate_mutants should format advice if mutants survived
statusReason: Unbekannter Prompt: remediate_mutants

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-prompt.controller.ts:55:11
 
         if (
           name === "explain_survived_mutants" ||
-          name === "remediate_mutants"
+          name !== "remediate_mutants"
         ) {
           const survivedResult = await this.getSurvivedUseCase.execute();
killedBy: McpPromptController GetPrompt explain_survived_mutants & remediate_mutants should format advice if mutants survived
statusReason: Unbekannter Prompt: remediate_mutants

[Killed] ArrayDeclaration
src/infrastructure/mcp/mcp-prompt.controller.ts:58:73
           name === "remediate_mutants"
         ) {
           const survivedResult = await this.getSurvivedUseCase.execute();
-          const survived = survivedResult.isOk ? survivedResult.value : [];
+          const survived = survivedResult.isOk ? survivedResult.value : ["Stryker was here"];
           const advice = await this.suggestFixesUseCase.execute(survived);
 
killedBy: McpPromptController GetPrompt explain_survived_mutants & remediate_mutants should handle getSurvivedUseCase error gracefully as empty array
statusReason: expected 'Bitte erstelle Unit-Tests, um die fol…' to contain 'Perfekt!'

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-prompt.controller.ts:61:15
           const survived = survivedResult.isOk ? survivedResult.value : [];
           const advice = await this.suggestFixesUseCase.execute(survived);
 
-          if (survived.length === 0) {
+          if (survived.length !== 0) {
             return {
               description: "Keine überlebenden Mutanten vorhanden.",
killedBy: McpPromptController GetPrompt explain_survived_mutants & remediate_mutants should return success message if no mutants survived
statusReason: expected 'Bitte erstelle Unit-Tests, um die fol…' to contain 'Perfekt!'

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:67:28
               messages: [
                 {
                   role: "user",
-                  content: {
-                    type: "text",
-                    text: "🎉 Perfekt! Es gibt aktuell keine überlebenden Mutanten. Der Mutation Score liegt bei 100%!",
-                  },
+                  content: {},
                 },
               ],
killedBy: McpPromptController GetPrompt explain_survived_mutants & remediate_mutants should return success message if no mutants survived
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:84:26
             .join("\n\n");
 
           return {
-            description: "Aufforderung zur KI-Behebung überlebender Mutanten.",
+            description: "",
             messages: [
               {

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:86:15
           return {
             description: "Aufforderung zur KI-Behebung überlebender Mutanten.",
             messages: [
-              {
-                role: "user",
-                content: {
-                  type: "text",
-                  text: `Bitte erstelle Unit-Tests, um die folgenden überlebenden Mutanten zu beheben und einen 100% Mutation Score zu erreichen:\n\n${formattedMutants}`,
-                },
-              },
+              {},
             ],
           };
killedBy: McpPromptController GetPrompt explain_survived_mutants & remediate_mutants should format advice if mutants survived
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-prompt.controller.ts:97:13
           };
         }
 
-        if (name === "why_is_this_bad") {
+        if (name !== "why_is_this_bad") {
           const mutantId = request.params.arguments?.mutantId;
           let mutantDetails = "";
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId success
statusReason: Unbekannter Prompt: why_is_this_bad

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:97:13
           };
         }
 
-        if (name === "why_is_this_bad") {
+        if (false) {
           const mutantId = request.params.arguments?.mutantId;
           let mutantDetails = "";
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId success
statusReason: Unbekannter Prompt: why_is_this_bad

[Survived] OptionalChaining
src/infrastructure/mcp/mcp-prompt.controller.ts:98:28
         }
 
         if (name === "why_is_this_bad") {
-          const mutantId = request.params.arguments?.mutantId;
+          const mutantId = request.params.arguments.mutantId;
           let mutantDetails = "";
 

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:101:15
           const mutantId = request.params.arguments?.mutantId;
           let mutantDetails = "";
 
-          if (mutantId) {
+          if (false) {
             const contextResult =
               this.getMutantContextUseCase.execute(mutantId);
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId success
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/infrastructure/mcp/mcp-prompt.controller.ts:101:25
           const mutantId = request.params.arguments?.mutantId;
           let mutantDetails = "";
 
-          if (mutantId) {
-            const contextResult =
-              this.getMutantContextUseCase.execute(mutantId);
-            if (contextResult.isOk) {
-              mutantDetails = `Mutant ID: ${mutantId}\n\nContext:\n${JSON.stringify(contextResult.value, null, 2)}`;
-            } else {
-              mutantDetails = `Fehler beim Abrufen des Mutanten ${mutantId}: ${contextResult.error.message}`;
-            }
-          } else {
+          if (mutantId) {} else {
             const survivedResult = await this.getSurvivedUseCase.execute();
             const survived = survivedResult.isOk ? survivedResult.value : [];
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId success
statusReason: expected 'Hier sind Informationen über überlebe…' to contain 'Mutant ID: 123'

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:104:17
           if (mutantId) {
             const contextResult =
               this.getMutantContextUseCase.execute(mutantId);
-            if (contextResult.isOk) {
+            if (true) {
               mutantDetails = `Mutant ID: ${mutantId}\n\nContext:\n${JSON.stringify(contextResult.value, null, 2)}`;
             } else {
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId error
statusReason: expected 'Hier sind Informationen über überlebe…' to contain 'Fehler beim Abrufen des Mutanten 123:…'

[Killed] BlockStatement
src/infrastructure/mcp/mcp-prompt.controller.ts:104:37
           if (mutantId) {
             const contextResult =
               this.getMutantContextUseCase.execute(mutantId);
-            if (contextResult.isOk) {
-              mutantDetails = `Mutant ID: ${mutantId}\n\nContext:\n${JSON.stringify(contextResult.value, null, 2)}`;
-            } else {
+            if (contextResult.isOk) {} else {
               mutantDetails = `Fehler beim Abrufen des Mutanten ${mutantId}: ${contextResult.error.message}`;
             }
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId success
statusReason: expected 'Hier sind Informationen über überlebe…' to contain 'Mutant ID: 123'

[Killed] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:105:31
             const contextResult =
               this.getMutantContextUseCase.execute(mutantId);
             if (contextResult.isOk) {
-              mutantDetails = `Mutant ID: ${mutantId}\n\nContext:\n${JSON.stringify(contextResult.value, null, 2)}`;
+              mutantDetails = ``;
             } else {
               mutantDetails = `Fehler beim Abrufen des Mutanten ${mutantId}: ${contextResult.error.message}`;
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId success
statusReason: expected 'Hier sind Informationen über überlebe…' to contain 'Mutant ID: 123'

[Killed] BlockStatement
src/infrastructure/mcp/mcp-prompt.controller.ts:106:20
               this.getMutantContextUseCase.execute(mutantId);
             if (contextResult.isOk) {
               mutantDetails = `Mutant ID: ${mutantId}\n\nContext:\n${JSON.stringify(contextResult.value, null, 2)}`;
-            } else {
-              mutantDetails = `Fehler beim Abrufen des Mutanten ${mutantId}: ${contextResult.error.message}`;
-            }
+            } else {}
           } else {
             const survivedResult = await this.getSurvivedUseCase.execute();
killedBy: McpPromptController GetPrompt why_is_this_bad should handle specific mutantId error
statusReason: expected 'Hier sind Informationen über überlebe…' to contain 'Fehler beim Abrufen des Mutanten 123:…'

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:112:17
           } else {
             const survivedResult = await this.getSurvivedUseCase.execute();
             const survived = survivedResult.isOk ? survivedResult.value : [];
-            if (survived.length === 0) {
+            if (true) {
               return {
                 description: "No surviving mutants to analyze.",
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when some survive with context
statusReason: expected 'Es gibt aktuell keine überlebenden Mu…' to contain '--- Mutant ID: 1 an Ort: a:1:1 ---'

[Killed] EqualityOperator
src/infrastructure/mcp/mcp-prompt.controller.ts:112:17
           } else {
             const survivedResult = await this.getSurvivedUseCase.execute();
             const survived = survivedResult.isOk ? survivedResult.value : [];
-            if (survived.length === 0) {
+            if (survived.length !== 0) {
               return {
                 description: "No surviving mutants to analyze.",
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when none survive
statusReason: expected 'Hier sind Informationen über überlebe…' to contain 'aktuell keine überlebenden Mutanten'

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:113:22
             const survivedResult = await this.getSurvivedUseCase.execute();
             const survived = survivedResult.isOk ? survivedResult.value : [];
             if (survived.length === 0) {
-              return {
-                description: "No surviving mutants to analyze.",
-                messages: [
-                  {
-                    role: "user",
-                    content: {
-                      type: "text",
-                      text: "Es gibt aktuell keine überlebenden Mutanten. Kein Risiko vorhanden!",
-                    },
-                  },
-                ],
-              };
+              return {};
             }
 
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when none survive
statusReason: Cannot read properties of undefined (reading '0')

[Survived] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:114:30
             const survived = survivedResult.isOk ? survivedResult.value : [];
             if (survived.length === 0) {
               return {
-                description: "No surviving mutants to analyze.",
+                description: "",
                 messages: [
                   {

[Killed] ObjectLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:116:19
               return {
                 description: "No surviving mutants to analyze.",
                 messages: [
-                  {
-                    role: "user",
-                    content: {
-                      type: "text",
-                      text: "Es gibt aktuell keine überlebenden Mutanten. Kein Risiko vorhanden!",
-                    },
-                  },
+                  {},
                 ],
               };
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when none survive
statusReason: Cannot read properties of undefined (reading 'text')

[Survived] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:119:29
                   {
                     role: "user",
                     content: {
-                      type: "text",
+                      type: "",
                       text: "Es gibt aktuell keine überlebenden Mutanten. Kein Risiko vorhanden!",
                     },

[Killed] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:120:29
                     role: "user",
                     content: {
                       type: "text",
-                      text: "Es gibt aktuell keine überlebenden Mutanten. Kein Risiko vorhanden!",
+                      text: "",
                     },
                   },
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when none survive
statusReason: expected '' to contain 'aktuell keine überlebenden Mutanten'

[Survived] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:127:38
               };
             }
 
-            let fullContextDetails = "";
+            let fullContextDetails = "Stryker was here!";
             for (const mutant of survived) {
               const contextResult = this.getMutantContextUseCase.execute(

[Killed] BlockStatement
src/infrastructure/mcp/mcp-prompt.controller.ts:128:44
             }
 
             let fullContextDetails = "";
-            for (const mutant of survived) {
-              const contextResult = this.getMutantContextUseCase.execute(
-                mutant.id,
-              );
-              if (contextResult.isOk) {
-                fullContextDetails += `\n--- Mutant ID: ${mutant.id} an Ort: ${mutant.filePath}:${mutant.line}:${mutant.column} ---\n`;
-                fullContextDetails += `Mutator: ${mutant.mutatorName}\n`;
-                fullContextDetails += `Code Context (Vorher/Nachher):\n`;
-                fullContextDetails += `Original:\n\`\`\`typescript\n${contextResult.value.originalCodeSnippet}\n\`\`\`\n`;
-                fullContextDetails += `Mutiert:\n\`\`\`typescript\n${contextResult.value.mutatedCodeSnippet}\n\`\`\`\n`;
-              } else {
-                fullContextDetails += `\n--- Mutant ID: ${mutant.id} ---\nFehler beim Abrufen des Context: ${contextResult.error.message}\n`;
-              }
-            }
+            for (const mutant of survived) {}
 
             mutantDetails = `All Surviving Mutants Context:\n\n${fullContextDetails}`;
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when some survive with context
statusReason: expected 'Hier sind Informationen über überlebe…' to contain '--- Mutant ID: 1 an Ort: a:1:1 ---'

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:132:19
               const contextResult = this.getMutantContextUseCase.execute(
                 mutant.id,
               );
-              if (contextResult.isOk) {
+              if (true) {
                 fullContextDetails += `\n--- Mutant ID: ${mutant.id} an Ort: ${mutant.filePath}:${mutant.line}:${mutant.column} ---\n`;
                 fullContextDetails += `Mutator: ${mutant.mutatorName}\n`;
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when some survive without context error
statusReason: Cannot read properties of undefined (reading 'originalCodeSnippet')

[Killed] ConditionalExpression
src/infrastructure/mcp/mcp-prompt.controller.ts:132:19
               const contextResult = this.getMutantContextUseCase.execute(
                 mutant.id,
               );
-              if (contextResult.isOk) {
+              if (false) {
                 fullContextDetails += `\n--- Mutant ID: ${mutant.id} an Ort: ${mutant.filePath}:${mutant.line}:${mutant.column} ---\n`;
                 fullContextDetails += `Mutator: ${mutant.mutatorName}\n`;
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when some survive with context
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:133:39
                 mutant.id,
               );
               if (contextResult.isOk) {
-                fullContextDetails += `\n--- Mutant ID: ${mutant.id} an Ort: ${mutant.filePath}:${mutant.line}:${mutant.column} ---\n`;
+                fullContextDetails += ``;
                 fullContextDetails += `Mutator: ${mutant.mutatorName}\n`;
                 fullContextDetails += `Code Context (Vorher/Nachher):\n`;
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when some survive with context
statusReason: expected 'Hier sind Informationen über überlebe…' to contain '--- Mutant ID: 1 an Ort: a:1:1 ---'

[Survived] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:137:39
                 fullContextDetails += `Mutator: ${mutant.mutatorName}\n`;
                 fullContextDetails += `Code Context (Vorher/Nachher):\n`;
                 fullContextDetails += `Original:\n\`\`\`typescript\n${contextResult.value.originalCodeSnippet}\n\`\`\`\n`;
-                fullContextDetails += `Mutiert:\n\`\`\`typescript\n${contextResult.value.mutatedCodeSnippet}\n\`\`\`\n`;
+                fullContextDetails += ``;
               } else {
                 fullContextDetails += `\n--- Mutant ID: ${mutant.id} ---\nFehler beim Abrufen des Context: ${contextResult.error.message}\n`;

[Killed] BlockStatement
src/infrastructure/mcp/mcp-prompt.controller.ts:138:22
                 fullContextDetails += `Code Context (Vorher/Nachher):\n`;
                 fullContextDetails += `Original:\n\`\`\`typescript\n${contextResult.value.originalCodeSnippet}\n\`\`\`\n`;
                 fullContextDetails += `Mutiert:\n\`\`\`typescript\n${contextResult.value.mutatedCodeSnippet}\n\`\`\`\n`;
-              } else {
-                fullContextDetails += `\n--- Mutant ID: ${mutant.id} ---\nFehler beim Abrufen des Context: ${contextResult.error.message}\n`;
-              }
+              } else {}
             }
 
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when some survive without context error
statusReason: expected 'Hier sind Informationen über überlebe…' to contain 'Fehler beim Abrufen des Context: fail…'

[Killed] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:139:39
                 fullContextDetails += `Original:\n\`\`\`typescript\n${contextResult.value.originalCodeSnippet}\n\`\`\`\n`;
                 fullContextDetails += `Mutiert:\n\`\`\`typescript\n${contextResult.value.mutatedCodeSnippet}\n\`\`\`\n`;
               } else {
-                fullContextDetails += `\n--- Mutant ID: ${mutant.id} ---\nFehler beim Abrufen des Context: ${contextResult.error.message}\n`;
+                fullContextDetails += ``;
               }
             }
killedBy: McpPromptController GetPrompt why_is_this_bad should handle all mutants when some survive without context error
statusReason: expected 'Hier sind Informationen über überlebe…' to contain 'Fehler beim Abrufen des Context: fail…'

[Survived] StringLiteral
src/infrastructure/mcp/mcp-prompt.controller.ts:148:15
 
           return {
             description:
-              "Aufforderung zur Analyse von realen Risiken eines Mutanten.",
+              "",
             messages: [
               {
