[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:22:18
     args: string[],
     cb: (error: Error | null) => void,
   ) => void = execFile,
-): Promise<void> {
-  return new Promise((resolve) => {
-    let file: string;
-    let args: string[];
-
-    if (platform === "win32") {
-      file = "powershell";
-      const escapedPath = soundPath.replace(/'/g, "''");
-      args = [
-        "-c",
-        `(New-Object System.Media.SoundPlayer '${escapedPath}').Play()`,
-      ];
-    } else if (platform === "darwin") {
-      file = "afplay";
-      args = [soundPath];
-    } else {
-      file = "sh";
-      args = ["-c", `aplay "${soundPath}" || paplay "${soundPath}"`];
-    }
-
-    execFn(file, args, () => {
-      resolve();
-    });
-  });
-}
+): Promise<void> {}
 
 export class DesktopNotifierAdapter implements NotificationServicePort {
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:23:35
     cb: (error: Error | null) => void,
   ) => void = execFile,
 ): Promise<void> {
-  return new Promise((resolve) => {
-    let file: string;
-    let args: string[];
-
-    if (platform === "win32") {
-      file = "powershell";
-      const escapedPath = soundPath.replace(/'/g, "''");
-      args = [
-        "-c",
-        `(New-Object System.Media.SoundPlayer '${escapedPath}').Play()`,
-      ];
-    } else if (platform === "darwin") {
-      file = "afplay";
-      args = [soundPath];
-    } else {
-      file = "sh";
-      args = ["-c", `aplay "${soundPath}" || paplay "${soundPath}"`];
-    }
-
-    execFn(file, args, () => {
-      resolve();
-    });
-  });
+  return new Promise((resolve) => {});
 }
 
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:27:9
     let file: string;
     let args: string[];
 
-    if (platform === "win32") {
+    if (true) {
       file = "powershell";
       const escapedPath = soundPath.replace(/'/g, "''");
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "vi.fn()" to be called with arguments: [ 'afplay', ArrayContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   "afplay",

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:27:9
     let file: string;
     let args: string[];
 
-    if (platform === "win32") {
+    if (false) {
       file = "powershell";
       const escapedPath = soundPath.replace(/'/g, "''");
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "vi.fn()" to be called with arguments: [ Any<String>, …(2) ]

Received:

  1st vi.fn() call:

  [
-   Any<String>,

[Survived] StringLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:31:9
       file = "powershell";
       const escapedPath = soundPath.replace(/'/g, "''");
       args = [
-        "-c",
+        "",
         `(New-Object System.Media.SoundPlayer '${escapedPath}').Play()`,
       ];

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:34:16
         "-c",
         `(New-Object System.Media.SoundPlayer '${escapedPath}').Play()`,
       ];
-    } else if (platform === "darwin") {
+    } else if (true) {
       file = "afplay";
       args = [soundPath];
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "vi.fn()" to be called with arguments: [ 'sh', ArrayContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   "sh",

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:34:39
         "-c",
         `(New-Object System.Media.SoundPlayer '${escapedPath}').Play()`,
       ];
-    } else if (platform === "darwin") {
-      file = "afplay";
-      args = [soundPath];
-    } else {
+    } else if (platform === "darwin") {} else {
       file = "sh";
       args = ["-c", `aplay "${soundPath}" || paplay "${soundPath}"`];
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "vi.fn()" to be called with arguments: [ 'afplay', ArrayContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   "afplay",

[Killed] ArrayDeclaration
src/infrastructure/notification/desktop-notifier.adapter.ts:36:14
       ];
     } else if (platform === "darwin") {
       file = "afplay";
-      args = [soundPath];
+      args = [];
     } else {
       file = "sh";
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "vi.fn()" to be called with arguments: [ 'afplay', ArrayContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   "afplay",

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:37:12
     } else if (platform === "darwin") {
       file = "afplay";
       args = [soundPath];
-    } else {
-      file = "sh";
-      args = ["-c", `aplay "${soundPath}" || paplay "${soundPath}"`];
-    }
+    } else {}
 
     execFn(file, args, () => {
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "vi.fn()" to be called with arguments: [ 'sh', ArrayContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   "sh",

[Killed] ArrayDeclaration
src/infrastructure/notification/desktop-notifier.adapter.ts:39:14
       args = [soundPath];
     } else {
       file = "sh";
-      args = ["-c", `aplay "${soundPath}" || paplay "${soundPath}"`];
+      args = [];
     }
 
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: expected "vi.fn()" to be called with arguments: [ 'sh', ArrayContaining{…}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   "sh",

[Survived] StringLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:39:15
       args = [soundPath];
     } else {
       file = "sh";
-      args = ["-c", `aplay "${soundPath}" || paplay "${soundPath}"`];
+      args = ["", `aplay "${soundPath}" || paplay "${soundPath}"`];
     }
 

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:42:30
       args = ["-c", `aplay "${soundPath}" || paplay "${soundPath}"`];
     }
 
-    execFn(file, args, () => {
-      resolve();
-    });
+    execFn(file, args, () => {});
   });
 }
killedBy: DesktopNotifierAdapter prüft defaultAudioPlayer für win32, darwin und linux Plattformen
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:68:20
   public async notifyStatus(
     message: string,
     title: string = "Stryker MCP Control Server",
-  ): Promise<void> {
-    if (!this.options.enabled) return;
-
-    await this.sendNotification({
-      title,
-      message,
-      sound: this.options.sound,
-      wait: false,
-    });
-  }
+  ): Promise<void> {}
 
   public async notifyProgress(
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Number of calls: 0

[Killed] BooleanLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:69:9
     message: string,
     title: string = "Stryker MCP Control Server",
   ): Promise<void> {
-    if (!this.options.enabled) return;
+    if (this.options.enabled) return;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:69:9
     message: string,
     title: string = "Stryker MCP Control Server",
   ): Promise<void> {
-    if (!this.options.enabled) return;
+    if (false) return;
 
     await this.sendNotification({
killedBy: DesktopNotifierAdapter blockiert Benachrichtigungen, wenn enabled false ist
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      Object {

[Killed] ObjectLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:71:33
   ): Promise<void> {
     if (!this.options.enabled) return;
 
-    await this.sendNotification({
-      title,
-      message,
-      sound: this.options.sound,
-      wait: false,
-    });
+    await this.sendNotification({});
   }
 
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:82:20
   public async notifyProgress(
     progressPercent: number,
     currentMutant?: string,
-  ): Promise<void> {
-    if (!this.options.enabled) return;
-
-    const message = currentMutant
-      ? `Fortschritt: ${progressPercent}% | Mutieren: ${currentMutant}`
-      : `Fortschritt: ${progressPercent}% abgeschlossen`;
-
-    await this.sendNotification({
-      title: `⚡ Stryker Mutationstests (${progressPercent}%)`,
-      message,
-      sound: false,
-      wait: false,
-    });
-  }
+  ): Promise<void> {}
 
   public async notifyCompletion(
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:83:9
     progressPercent: number,
     currentMutant?: string,
   ): Promise<void> {
-    if (!this.options.enabled) return;
+    if (true) return;
 
     const message = currentMutant
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Number of calls: 0

[Killed] StringLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:90:14
       : `Fortschritt: ${progressPercent}% abgeschlossen`;
 
     await this.sendNotification({
-      title: `⚡ Stryker Mutationstests (${progressPercent}%)`,
+      title: ``,
       message,
       sound: false,
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fortschrittsaktualisierung mit und ohne Mutanten-Name
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:101:20
     score: number,
     killed: number,
     survived: number,
-  ): Promise<void> {
-    if (!this.options.enabled) return;
-
-    const title = `🧬 Mutationstests Beendet (${score}% Score)`;
-    const message = `${killed} Mutanten getötet | ${survived} überlebt`;
-    const isPersistent = this.options.persistentOverlay !== false;
-
-    await this.sendNotification({
-      title,
-      message,
-      sound: this.options.sound,
-      wait: isPersistent,
-      timeout: isPersistent ? false : undefined,
-      sticky: isPersistent,
-    });
-  }
+  ): Promise<void> {}
 
   public async notifyError(errorMessage: string): Promise<void> {
killedBy: DesktopNotifierAdapter sendet Benachrichtigung bei Fertigstellung als persistenten Overlay mit Sound
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:119:9
   }
 
   public async notifyError(errorMessage: string): Promise<void> {
-    if (!this.options.enabled) return;
+    if (true) return;
 
     const isPersistent = this.options.persistentOverlay !== false;
killedBy: DesktopNotifierAdapter sendet Fehlerbenachrichtigung als persistenten Overlay mit Sound
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, Any<Function> ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:144:20
     const playSound = Boolean(params.sound);
     const soundPath = this.getSoundPath();
 
-    if (playSound) {
-      try {
-        await this.audioPlayer(soundPath);
-      } catch (audioErr) {
-        const errObj =
-          audioErr instanceof Error ? audioErr : new Error(String(audioErr));
-        this.logger.debug("Audio-Wiedergabe fehlgeschlagen:", errObj);
-      }
-    }
+    if (playSound) {}
 
     return new Promise((resolve) => {
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:147:26
     if (playSound) {
       try {
         await this.audioPlayer(soundPath);
-      } catch (audioErr) {
-        const errObj =
-          audioErr instanceof Error ? audioErr : new Error(String(audioErr));
-        this.logger.debug("Audio-Wiedergabe fehlgeschlagen:", errObj);
-      }
+      } catch (audioErr) {}
     }
 
killedBy: DesktopNotifierAdapter fängt Fehler bei der Audio-Wiedergabe sicher ab und loggt sie
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:155:11
     }
 
     return new Promise((resolve) => {
-      try {
-        const notificationPayload = {
-          ...params,
-          sound: playSound ? soundPath : false,
-        };
-
-        this.notifierService.notify(
-          notificationPayload as any,
-          (err: Error | null) => {
-            if (err) {
-              this.logger.debug(
-                "Desktop-Benachrichtigung konnte nicht gesendet werden:",
-                err,
-              );
-            }
-            resolve();
-          },
-        );
-      } catch (err) {
+      try {} catch (err) {
         const errObj = err instanceof Error ? err : new Error(String(err));
         this.logger.debug(
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:163:34
 
         this.notifierService.notify(
           notificationPayload as any,
-          (err: Error | null) => {
-            if (err) {
-              this.logger.debug(
-                "Desktop-Benachrichtigung konnte nicht gesendet werden:",
-                err,
-              );
-            }
-            resolve();
-          },
+          (err: Error | null) => {},
         );
       } catch (err) {
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:164:22
         this.notifierService.notify(
           notificationPayload as any,
           (err: Error | null) => {
-            if (err) {
-              this.logger.debug(
-                "Desktop-Benachrichtigung konnte nicht gesendet werden:",
-                err,
-              );
-            }
+            if (err) {}
             resolve();
           },
killedBy: DesktopNotifierAdapter fängt Fehler im Notifier Callback sicher ab und loggt sie
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/notification/desktop-notifier.adapter.ts:164:17
         this.notifierService.notify(
           notificationPayload as any,
           (err: Error | null) => {
-            if (err) {
+            if (false) {
               this.logger.debug(
                 "Desktop-Benachrichtigung konnte nicht gesendet werden:",
killedBy: DesktopNotifierAdapter fängt Fehler im Notifier Callback sicher ab und loggt sie
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/notification/desktop-notifier.adapter.ts:173:21
             resolve();
           },
         );
-      } catch (err) {
-        const errObj = err instanceof Error ? err : new Error(String(err));
-        this.logger.debug(
-          "Unerwarteter Fehler beim Senden der Benachrichtigung:",
-          errObj,
-        );
-        resolve();
-      }
+      } catch (err) {}
     });
   }
killedBy: DesktopNotifierAdapter fängt synchrone Fehler im Notifier.notify Aufruf ab und loggt sie
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:176:11
       } catch (err) {
         const errObj = err instanceof Error ? err : new Error(String(err));
         this.logger.debug(
-          "Unerwarteter Fehler beim Senden der Benachrichtigung:",
+          "",
           errObj,
         );
killedBy: DesktopNotifierAdapter fängt synchrone Fehler im Notifier.notify Aufruf ab und loggt sie
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Unerwarteter Fehler beim Senden der Benachrichtigung:",

[Killed] StringLiteral
src/infrastructure/notification/desktop-notifier.adapter.ts:188:60
     if (this.options.customSoundPath) {
       return path.resolve(this.options.customSoundPath);
     }
-    return path.resolve(process.cwd(), "assets", "sounds", "mutant_hunter.wav");
+    return path.resolve(process.cwd(), "assets", "sounds", "");
   }
 }
killedBy: DesktopNotifierAdapter sendet Desktop-Benachrichtigung bei Statusänderungen mit Default-Titel
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "mutant_hunter.wav",
